
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// №6999 для определенных настроек отчета включили обязательное заполнение полей
	// Вид номенклатуры потолков обязательно для заполнения если вид отчета "Потолок" или "Все"
	Если НЕ (ВидПрайсЛиста = 1 ИЛИ ВидПрайсЛиста = 3) Тогда
		Если НЕ ПроверяемыеРеквизиты.Найти("ВидНоменклатурыПотолки") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидНоменклатурыПотолки"));
		КонецЕсли;
	КонецЕсли;
	
	// проверка перенесена из формы по кнопке "Сформировать"
	Если НЕ ИндивидуальныеЦены Тогда
		Если НЕ ПроверяемыеРеквизиты.Найти("Контрагент") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
		КонецЕсли;
		Если НЕ ПроверяемыеРеквизиты.Найти("ДоговорКонтрагента") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДоговорКонтрагента"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
