
//&ИзменениеИКонтроль("СформироватьПечатнуюФормуТоварнойНакладной")
//Функция НВД_СформироватьПечатнуюФормуТоварнойНакладной(МассивОбъектов, ОбъектыПечати)

//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
//	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_Накладная";
//	//Макет = ПолучитьОбщийМакет("ТоварнаяНакладнаяНаПеремещение");
//	#Удаление
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеТоваров.ПФ_MXL_НакладнаяНаПеремещение");
//	#КонецУдаления
//	#Вставка
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеТоваров.ПФ_MXL_НакладнаяНаПеремещениеИЗМ");
//	#КонецВставки
//	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();

//	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
//	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
//	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати);

//	ПервыйДокумент = Истина;
//	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
//		Если Не ПервыйДокумент Тогда
//			// Все документы нужно выводить на разных страницах.
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		ПервыйДокумент = Ложь;
//		// Запомним номер строки, с которой начали выводить текущий документ.
//		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

//		ТекстЗаголовка = "Перемещение №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.Дата, "ДЛф=Д");

//		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
//		//nva+++
//		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
//				ТабличныйДокумент,
//				Макет,
//				ОбластьМакета,
//				ДанныеПечати.Ссылка);
//		//nva---
//		ТабличныйДокумент.Вывести(ОбластьМакета);

//		Если ЗначениеЗаполнено(ДанныеПечати.Основание) Тогда
//			Попытка
//				ОбластьМакета = Макет.ПолучитьОбласть("Основание");
//				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//				ТабличныйДокумент.Вывести(ОбластьМакета);
//			Исключение
//			КонецПопытки;
//		КонецЕсли;
//		
//		#Вставка
//		Если ЗначениеЗаполнено(ДанныеПечати.Основание) Тогда
//			Попытка
//				ОбластьМакета = Макет.ПолучитьОбласть("Контрагент");
//				ОбластьМакета.Параметры.Заполнить(ДанныеПечати.Основание);
//				ТабличныйДокумент.Вывести(ОбластьМакета);
//			Исключение
//			КонецПопытки;
//		КонецЕсли;
//		#КонецВставки

//		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ТабличныйДокумент.Вывести(ОбластьМакета);

//		ОбластьМакета = Макет.ПолучитьОбласть("СкладОтправитель");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ТабличныйДокумент.Вывести(ОбластьМакета);

//		ОбластьМакета = Макет.ПолучитьОбласть("СкладПолучатель");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ТабличныйДокумент.Вывести(ОбластьМакета);

//		//#12283
//		Если ЗначениеЗаполнено(ДанныеПечати.АдресМонтажа) ИЛИ ЗначениеЗаполнено(ДанныеПечати.НомерРозничногоДоговора) Тогда
//			ОбластьМакета = Макет.ПолучитьОбласть("ДанныеМонтажа");
//			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//			ТабличныйДокумент.Вывести(ОбластьМакета);
//		КонецЕсли;

//		// Изменения размера колоноки, в зависимости от вывода Артикула
//		Если Не ВыводитьАртикул Тогда
//			Попытка
//				Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
//			Исключение
//			КонецПопытки;
//		КонецЕсли;

//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ТабличныйДокумент.Вывести(ОбластьМакета);

//		Если ВыводитьАртикул Тогда
//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул");
//			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//			ТабличныйДокумент.Присоединить(ОбластьМакета);
//		КонецЕсли;

//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ТабличныйДокумент.Присоединить(ОбластьМакета);		

//		//подготовим табличную часть в зависимости от варианта формирования ПФ 
//		ВариантФормированияПФ = Константы.ВариантФормированияПФПеремещения.Получить();
//		МассивДопРеквизитов = Новый Массив;
//		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));		
//		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ГруппаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")));

//		ТаблицаТоваров = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ПеремещениеТоваров", "Товары", МассивДопРеквизитов);
//		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
//		ВыборкаПоТоварам.Сбросить();
//		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
//			Выборка = ВыборкаПоТоварам.Выбрать();			
//			Пока Выборка.Следующий() Цикл
//				ТекущаяСтрока = ТаблицаТоваров.Добавить();
//				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);				

//				ТекущаяСтрока.ГруппаНоменклатуры = ТекущаяСтрока.Номенклатура.Родитель;
//			КонецЦикла;
//		КонецЕсли;

//		ОтступНоменклатуры = "";
//		//0. Без группировок
//		//1. По группам номенклатуры
//		Если ВариантФормированияПФ = 0 Тогда
//			// ничего не делаем 		
//		ИначеЕсли ВариантФормированияПФ = 1 Тогда
//			ОтступНоменклатуры = "   ";
//			ТаблицаТоваров.Сортировать("ГруппаНоменклатуры");
//		КонецЕсли;

//		НомерСтроки = 1;
//		ТекущаяГруппа = Неопределено;
//		Для каждого Выборка из ТаблицаТоваров Цикл

//			//#12807
//			Если ВариантФормированияПФ = 1 Тогда
//				Если НЕ ТекущаяГруппа = Выборка.ГруппаНоменклатуры Тогда
//					ТекущаяГруппа = Выборка.ГруппаНоменклатуры;
//					ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
//					ТабличныйДокумент.Вывести(ОбластьМакета);
//					Если ВыводитьАртикул Тогда						
//						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
//						ТабличныйДокумент.Присоединить(ОбластьМакета);
//					КонецЕсли;					
//					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
//					ДопДанныеСтроки = Новый Структура;					
//					ДопДанныеСтроки.Вставить("Номенклатура", ?(ТекущаяГруппа.Пустая(), "<...>", ТекущаяГруппа));
//					ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", ДопДанныеСтроки.Номенклатура);
//					ОбластьМакета.Параметры.Заполнить(ДопДанныеСтроки);

//					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
//					ШрифтПотолка = Новый Шрифт(ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
//					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;

//					ТабличныйДокумент.Присоединить(ОбластьМакета);
//				КонецЕсли;
//			КонецЕсли;

//			ДопДанныеСтроки = Новый Структура("НомерСтроки", НомерСтроки);
//			//++ №12909
//			//ПредставлениеНоменклатуры = Строка(Выборка.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Выборка.ХарактеристикаНоменклатуры));
//			ПредставлениеНоменклатуры = ОтступНоменклатуры + ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры);
//			//-- №12909
//			ДопДанныеСтроки.Вставить("ПредставлениеНоменклатуры", ПредставлениеНоменклатуры);

//			ОбластьМакета = Макет.ПолучитьОбласть("Строка|НомерСтроки");
//			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//			ОбластьМакета.Параметры.Заполнить(Выборка);
//			ОбластьМакета.Параметры.Заполнить(ДопДанныеСтроки);
//			ТабличныйДокумент.Вывести(ОбластьМакета);

//			Если ВыводитьАртикул Тогда
//				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Артикул");
//				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//				ОбластьМакета.Параметры.Заполнить(Выборка);
//				ОбластьМакета.Параметры.Заполнить(ДопДанныеСтроки);
//				ТабличныйДокумент.Присоединить(ОбластьМакета);
//			КонецЕсли;

//			ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
//			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//			ОбластьМакета.Параметры.Заполнить(Выборка);
//			ОбластьМакета.Параметры.Заполнить(ДопДанныеСтроки);

//			ТабличныйДокумент.Присоединить(ОбластьМакета);

//			НомерСтроки = НомерСтроки + 1;
//		КонецЦикла;

//		ОбластьМакета = Макет.ПолучитьОбласть("Итого|НомерСтроки");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ТабличныйДокумент.Вывести(ОбластьМакета);

//		Если ВыводитьАртикул Тогда
//			ОбластьМакета = Макет.ПолучитьОбласть("Итого|Артикул");
//			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//			ТабличныйДокумент.Присоединить(ОбластьМакета);
//		КонецЕсли;

//		ОбластьМакета = Макет.ПолучитьОбласть("Итого|Данные");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ТабличныйДокумент.Присоединить(ОбластьМакета);

//		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
//		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
//		ТабличныйДокумент.Вывести(ОбластьМакета);

//		// В табличном документе необходимо задать имя области, в которую был 
//		// выведен объект. Нужно для возможности печати комплектов документов.
//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
//		НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);		
//	КонецЦикла;

//	ТабличныйДокумент.ТолькоПросмотр = Истина;
//	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
//	ТабличныйДокумент.ОтображатьСетку = Ложь;

//	Возврат ТабличныйДокумент;

//КонецФункции
