Функция ПолучитьКонтрагентаПоQRCID(qrcId);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.НВД_qrcld = &qrcId";
	
	Запрос.УстановитьПараметр("qrcId", qrcId);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
	Иначе
		Контрагент = Неопределено;
	КонецЕсли;
    Возврат Контрагент;
КонецФункции

Функция ПолучитьЗаказПоQRCID(qrcId);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СБП_QRКоды.qrcId КАК qrcId,
		|	СБП_QRКоды.status КАК status,
		|	СБП_QRКоды.ДатаГенерации КАК ДатаГенерации,
		|	СБП_QRКоды.imageParams_mediaType КАК imageParams_mediaType,
		|	СБП_QRКоды.imageParams_content КАК imageParams_content,
		|	СБП_QRКоды.amount КАК amount,
		|	СБП_QRКоды.payload КАК payload,
		|	СБП_QRКоды.qrcType КАК qrcType,
		|	СБП_QRКоды.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
		|ГДЕ
		|	СБП_QRКоды.qrcId = &qrcId";
	
	Запрос.УстановитьПараметр("qrcId", qrcId);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Заказ = ВыборкаДетальныеЗаписи.Заказ;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
    Возврат Заказ;
КонецФункции

Процедура ОбновитьСтатусQRКода(qrcId, status)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СБП_QRКоды.qrcId КАК qrcId,
		|	СБП_QRКоды.status КАК status,
		|	СБП_QRКоды.ДатаГенерации КАК ДатаГенерации,
		|	СБП_QRКоды.imageParams_mediaType КАК imageParams_mediaType,
		|	СБП_QRКоды.imageParams_content КАК imageParams_content,
		|	СБП_QRКоды.amount КАК amount,
		|	СБП_QRКоды.payload КАК payload,
		|	СБП_QRКоды.qrcType КАК qrcType,
		|	СБП_QRКоды.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
		|ГДЕ
		|	СБП_QRКоды.qrcId = &qrcId";
	
	Запрос.УстановитьПараметр("qrcId", qrcId);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НаборЗаписейQR = РегистрыСведений.СБП_QRКоды.СоздатьНаборЗаписей();
		НаборЗаписейQR.Отбор.qrcId.Установить(ВыборкаДетальныеЗаписи.qrcId);
		НаборЗаписейQR.Прочитать();
		ЗаписьQR = НаборЗаписейQR[0];
		ЗаписьQR.status = status;
		НаборЗаписейQR.Записать();
	КонецЕсли;
	
КонецПроцедуры	
	
Функция ПлатёжОбработан(ДанныеПлатежа)
	
	Если ТипЗнч(ДанныеПлатежа) <> Тип("Структура") Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
		
	qrcId  = ДанныеПлатежа.qrcId;
	
	Если НЕ ЗначениеЗаполнено(qrcId) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли; 
	
	Контрагент = ПолучитьКонтрагентаПоQRCID(qrcId);
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		НайденКонтрагент = ЛОЖЬ;
	Иначе
		НайденКонтрагент = ИСТИНА;
	КонецЕсли;
	
	Заказ = ПолучитьЗаказПоQRCID(qrcId);
	
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		НайденЗаказ = ЛОЖЬ;
	Иначе
		НайденЗаказ = ИСТИНА;
	КонецЕсли;
	
	Если Не НайденКонтрагент И Не НайденЗаказ Тогда
		Текст = "Пришел callback по QR коду" + qrcId + ", но не был найден ни заказ, ни контрагент по нему
		|Телефон плательщика " + ДанныеПлатежа.senderId + "
		|Назначение платежа " + ДанныеПлатежа.comment + "
		|Дата операции " + ДанныеПлатежа.operDate + "
		|Статус " + ДанныеПлатежа.status;
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);	
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Если СтрНайти(ВРЕГ(ДанныеПлатежа.status), "ACCEPTED") = 0 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Если Не НайденКонтрагент И НайденЗаказ Тогда
		Контрагент = Заказ.Контрагент;
	КонецЕсли;	
	
	СчетДляСБП = Константы.НВД_ОсновнойБанковскийСчетДляСБП.Получить();
	
	Если НЕ ЗначениеЗаполнено(СчетДляСБП) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	СуммаПлатежа = ДанныеПлатежа.amount; //в копейках
	
	Если НЕ ЗначениеЗаполнено(СуммаПлатежа) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли; 
	
	СуммаПлатежа = Число(СуммаПлатежа)/100;  //в рублях
	
	merchantId = ДанныеПлатежа.merchantId;
	
	Валюта = СчетДляСБП.Валюта;
	
	ДатаПлатежа = Дата(СтрЗаменить(ДанныеПлатежа.operDate,"-",""));
	
	БикБанкаОтправителя = ДанныеПлатежа.senderBic;
	
	//БанковскийСчетОтправителя = ДанныеПлатежа.
	Организация = СчетДляСБП.Владелец;
	
	ПоступлениеНаРС = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
	ПоступлениеНаРС.Дата = ДатаПлатежа;
	Если НайденЗаказ Тогда
		ПоступлениеНаРС.ДобавитьОснование(Заказ);
	КонецЕсли;
	ПоступлениеНаРС.Организация = Организация;//СчетДляСБП.Владелец;
	ПоступлениеНаРС.Валюта = Валюта;
	ПоступлениеНаРС.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя;	
	ПоступлениеНаРС.Контрагент = Контрагент;
	ПоступлениеНаРС.Договор = Контрагент.ОсновнойДоговор;
	ПоступлениеНаРС.КомиссияБанка = 0;
	ПоступлениеНаРС.НазначениеПлатежа = ДанныеПлатежа.comment;
	ПоступлениеНаРС.Комментарий = "Загружен из Банка " + "transactionId:" + ДанныеПлатежа.transactionId + " fpTransactionId:" + ДанныеПлатежа.fpTransactionId; 
	ПоступлениеНаРС.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Основной");
	ПоступлениеНаРС.СтатьяДоходов = Справочники.СтатьиДоходовИРасходов.Продажи; 
	ПоступлениеНаРС.СтатьяДоходовПоНачислению = Справочники.СтатьиДоходовИРасходов.Продажи;
	ПоступлениеНаРС.Сумма = СуммаПлатежа;
	ПоступлениеНаРС.Счет = СчетДляСБП; 
	ПоступлениеНаРС.Автор = Пользователи.ТекущийПользователь();
	ПоступлениеНаРС.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	ПоступлениеНаРС.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(ПоступлениеНаРС, УчитыватьНДС);
	
	Попытка
    	ПоступлениеНаРС.Записать(РежимЗаписиДокумента.Проведение);
		
		ОбработкаСБПКасса = Обработки.СБПКасса.Создать();
		ОбработкаСБПКасса.СоздатьЧекСПроверкойНаСуществующий(ПоступлениеНаРС.Ссылка, "Приход");
		
		ОбновитьСтатусQRКода(qrcId, ДанныеПлатежа.status);
			
		ЗаписатьДокументПоступлениеНаРСПоQRКодуВРегистр(qrcId, ПоступлениеНаРС.Ссылка);
		
		Возврат ИСТИНА;
		
	Исключение
   		Инфо1 = ОписаниеОшибки();
		Инфо2 = ИнформацияОбОшибке();
		
		Инфо = Инфо1 + "
		|" + Инфо2.Описание + "
		|" + ?(Инфо2.Причина = Неопределено, "", Инфо2.Причина.Описание);
		
		ЗаписьЖурналаРегистрации("Запись документа оплаты по Call Back GPB", УровеньЖурналаРегистрации.Ошибка,,,Инфо);
		Возврат ЛОЖЬ;
	КонецПопытки;
	
КонецФункции	

Процедура ЗаписатьДокументПоступлениеНаРСПоQRКодуВРегистр(qrcId, ПоступлениеНаРС)
	НаборЗаписей = РегистрыСведений.СБП_QRКоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.qrcId.Установить(qrcId);
	НаборЗаписей.Прочитать();
	
	ЗаписьРегистра = НаборЗаписей[0];
	ЗаписьРегистра.ПоступлениеНаРС = ПоступлениеНаРС;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Инфо1 = ОписаниеОшибки();
		Инфо2 = ИнформацияОбОшибке();
		
		Инфо = Инфо1 + "
		|" + Инфо2.Описание + "
		|" + ?(Инфо2.Причина = Неопределено, "", Инфо2.Причина.Описание);
		
		ЗаписьЖурналаРегистрации("Изменение записи в регистре СБП_QRКоды  по /merchant/qrc-status", УровеньЖурналаРегистрации.Ошибка,,,Инфо);
	КонецПопытки;
КонецПроцедуры

Функция MerchantNotificationsPOST(Запрос)
	
	Если Ложь Тогда 
		Запрос = Новый HTTPЗапрос;
	КонецЕсли;
		
	ИменаСвойствСоЗначениямиДата = Новый Массив;
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьПоток(Запрос.ПолучитьТелоКакПоток());
		
		ДанныеИнфо = ПрочитатьJSON(ЧтениеJSON, Ложь, ИменаСвойствСоЗначениямиДата);
		
		ЗаписьЖурналаРегистрации("MerchantNotifications", УровеньЖурналаРегистрации.Информация,,,Запрос.ПолучитьТелоКакСтроку());
		
		ЧтениеJSON.Закрыть();
		
		Если НЕ ПлатёжОбработан(ДанныеИнфо) Тогда
			Возврат Новый HTTPСервисОтвет(400);
		КонецЕсли;	
	Исключение	
		Инфо1 = ОписаниеОшибки();
		Инфо2 = ИнформацияОбОшибке();
		
		Инфо = Инфо1 + "
		|" + Инфо2.Описание + "
		|" + ?(Инфо2.Причина = Неопределено, "", Инфо2.Причина.Описание);
		
		ЗаписьЖурналаРегистрации("CallBack GPB", УровеньЖурналаРегистрации.Ошибка,,,Инфо);
		
		Возврат Новый HTTPСервисОтвет(400);	
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;

КонецФункции
