Функция НВД_ИзменитьСтатусДокументаРезервирование(Резервирование, УстановитьСтатус) Экспорт
	
	Если ТипЗнч(Резервирование) <> Тип("ДокументСсылка.Резервирование") Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Если Резервирование.ТекущийСтатус = УстановитьСтатус Тогда
		Возврат Истина;
	КонецЕсли;

	Попытка
		ДокОбъект = Резервирование.ПолучитьОбъект();
		ДокОбъект.ТекущийСтатус = УстановитьСтатус;
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОбъект.Записать();
		КонецЕсли;
		Возврат Истина;
	Исключение
		Возврат Ложь
	КонецПопытки;
	
КонецФункции



	//ИначеЕсли ТипЗнч(СсылкаДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//	
	//	СтруктураОтвета = Документы.ЗаказПокупателя.ВсеТоварыПоЗаказуОтгружены(СсылкаДокумент, СсылкаДокумент.Товары);
	//	Если СтруктураОтвета.Результат Тогда
	//		ДокОбъект = СсылкаДокумент.ПолучитьОбъект();		
	//		ДокОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен;
	//		Попытка
	//			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);			 
	//			РезультатОбработки.Успешно = Истина;
	//		Исключение
	//			РезультатОбработки.Успешно = Ложь;
	//			РезультатОбработки.ОписаниеОшибки = ОписаниеОшибки();
	//		КонецПопытки;
	//	Иначе
	//		// заказ еще не отгружен
	//		//просто его перепроведем, чтобы заполнить регистр ЗаказыПокупателейВПроизводстве
	//		ДокОбъект = СсылкаДокумент.ПолучитьОбъект();		
	//		Попытка
	//			Если ДокОбъект.Проведен Тогда
	//				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//			КонецЕсли;
	//			РезультатОбработки.Успешно = Истина;
	//		Исключение
	//			РезультатОбработки.Успешно = Ложь;
	//			РезультатОбработки.ОписаниеОшибки = ОписаниеОшибки();
	//		КонецПопытки;
	//	КонецЕсли;