
&ИзменениеИКонтроль("ПолучитьЦенуПродукцииВВалюте")
Функция НВД_ПолучитьЦенуПродукцииВВалюте(ПараметрыПродукции, Знач ДатаЦены, Знач ВидЦены, Знач Валюта, Знач Контрагент, Знач ДоговорКонтрагента)

	// ПараметрыПродукции: СФотопечатью = Ложь, Знач ДатаЦены, Знач ВидЦены, Знач ФактураШаблон, Знач ЦветФактуры = Неопределено, Знач Валюта, Знач ВидНоменклатуры = Неопределено								
	СФотопечатью = Ложь;
	Если ПараметрыПродукции.Свойство("СФотопечатью") Тогда
		СФотопечатью = ПараметрыПродукции.СФотопечатью;	
	КонецЕсли;
	ВидНоменклатуры = Неопределено;
	Если ПараметрыПродукции.Свойство("ВидНоменклатуры") Тогда
		ВидНоменклатуры = ПараметрыПродукции.ВидНоменклатуры;	
	КонецЕсли;
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
	КонецЕсли;
	Фактура = Неопределено;
	Если ПараметрыПродукции.Свойство("Фактура") Тогда
		Фактура = ПараметрыПродукции.Фактура;	
	КонецЕсли;
	ЦветФактуры = Неопределено;
	Если ПараметрыПродукции.Свойство("ЦветФактуры") Тогда
		ЦветФактуры = ПараметрыПродукции.ЦветФактуры;	
	КонецЕсли;
	Шаблон = Неопределено;
	Если ПараметрыПродукции.Свойство("Шаблон") Тогда
		Шаблон = ПараметрыПродукции.Шаблон;	
	КонецЕсли;
	Номенклатура = Неопределено;
	Если ПараметрыПродукции.Свойство("Номенклатура") Тогда
		Номенклатура = ПараметрыПродукции.Номенклатура;	
	КонецЕсли;
	ЕдиницаИзмерения = Неопределено;
	Если ПараметрыПродукции.Свойство("ЕдиницаИзмерения") Тогда
		ЕдиницаИзмерения = ПараметрыПродукции.ЕдиницаИзмерения;	
	КонецЕсли;

	Результат = 0;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА НЕ &СФотопечатью
	|			ТОГДА ЦеныМатериаловСрезПоследних.Цена
	|		ИНАЧЕ ЦеныМатериаловСрезПоследних.ЦенаСФотопечатью
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|			&ДатаЦены,
	//++#7256
	|			ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен).СсылочныйВидЦены = ИСТИНА
	|						ТОГДА ВидЦен = ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен).ВидЦеныНаПродукцию
	|					ИНАЧЕ ВидЦен = &ВидЦены
	|				КОНЕЦ
	//|			ВидЦен = &ВидЦены
	//--#7256
	|				И Валюта = &Валюта
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И ВЫБОР 
	|					КОГДА &ОтборПоШаблону ТОГДА Шаблон = &Шаблон 
	|					КОГДА &ОтборПоНоменклатуре ТОГДА Номенклатура = &Номенклатура И ЕдиницаИзмерения = &ЕдиницаИзмерения
	#Вставка 
	|				  	ИНАЧЕ Фактура = &Фактура И ЦветФактуры = ЕстьNULL(&ЦветФактуры, Значение(Справочник.ЦветФактуры.ПустаяСсылка))
	#КонецВставки       
	#Удаление
	|				  	ИНАЧЕ Фактура = &Фактура И ЦветФактуры = &ЦветФактуры
	#КонецУдаления
	|                 КОНЕЦ
	|	) КАК ЦеныМатериаловСрезПоследних";

	Запрос.УстановитьПараметр("ДатаЦены",			КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("ВидЦены",			ВидЦены);
	Запрос.УстановитьПараметр("Валюта",				Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры",	ВидНоменклатуры);

	Запрос.УстановитьПараметр("Фактура",			Фактура);
	#Вставка
	Запрос.УстановитьПараметр("ЦветФактуры",		?(ЦветФактуры= Неопределено, Справочники.ЦветФактуры.ПустаяСсылка(), ЦветФактуры));
	#КонецВставки
	#Удаление
	Запрос.УстановитьПараметр("ЦветФактуры",		ЦветФактуры);
	#КонецУдаления
	Запрос.УстановитьПараметр("СФотопечатью",		СФотопечатью);

	Запрос.УстановитьПараметр("ОтборПоШаблону",		НЕ Шаблон = Неопределено);
	#Вставка
	Запрос.УстановитьПараметр("Шаблон",				?(Шаблон= Неопределено, Справочники.ШаблоныПродукции.ПустаяСсылка(), Шаблон));
	#КонецВставки
    #Удаление
	Запрос.УстановитьПараметр("Шаблон",				Шаблон);
	#КонецУдаления
	
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре",НЕ Номенклатура = Неопределено);
	#Вставка
	Запрос.УстановитьПараметр("Номенклатура",		?(Номенклатура= Неопределено, Справочники.Номенклатура.ПустаяСсылка(), Номенклатура));
	#КонецВставки
	#Удаление
	Запрос.УстановитьПараметр("Номенклатура",		Номенклатура);
	#КонецУдаления
	#Вставка
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",	?(ЕдиницаИзмерения= Неопределено, Справочники.ЕдиницыИзмерений.ПустаяСсылка(), ЕдиницаИзмерения));
	#КонецВставки
	#Удаление
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",	ЕдиницаИзмерения);
	#КонецУдаления


	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Цена;
	КонецЕсли;

	//#7256
	#Удаление
	Если НЕ Контрагент = Неопределено ИЛИ ДоговорКонтрагента = Неопределено Тогда
	#КонецУдаления
	#Вставка 
	Если ЗначениеЗаполнено(Контрагент) ИЛИ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
	#КонецВставки
		Если Контрагент = Неопределено Тогда
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		Если ДоговорКонтрагента = Неопределено Тогда
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		Результат = ПолучитьИндивидуальнуюЦенуПродукции(Результат, ВидНоменклатуры, Фактура, ЦветФактуры, СФотопечатью, Шаблон, Номенклатура, ЕдиницаИзмерения,
		ДатаЦены, Валюта, Контрагент, ДоговорКонтрагента);
	КонецЕсли;

	Возврат Результат;

КонецФункции
