Функция ТелефонЗаполнен(ВладелецКонтактнойИформации)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	КонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
		|	КонтактнаяИнформация.Значение КАК Значение
		|ИЗ
		|	Справочник.@ВладелецКИ@.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид
		|	И КонтактнаяИнформация.Ссылка = &Ссылка";
	
	Если ТипЗнч(ВладелецКонтактнойИформации) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "@ВладелецКИ@", "КонтактныеЛица");
	ИначеЕсли ТипЗнч(ВладелецКонтактнойИформации) = Тип("СправочникСсылка.Контрагенты") Тогда
	    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "@ВладелецКИ@", "Контрагенты");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса; 
	
    Если ТипЗнч(ВладелецКонтактнойИформации) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	ИначеЕсли ТипЗнч(ВладелецКонтактнойИформации) = Тип("СправочникСсылка.Контрагенты") Тогда
	    Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Ссылка", ВладелецКонтактнойИформации); 

	ТЗКИ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗКИ.Количество() > 0 Тогда
		Возврат ИСТИНА;
	Иначе
		Возврат ЛОЖЬ;
	КонецЕсли;	
		 
КонецФункции	 
 
&После("ПередЗаписью")
Процедура НВД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Если ЗначениеЗаполнено(ЭтотОбъект.НВД_КонтактноеЛицо) Тогда //проверим, заполнен ли номер телефона
	//	Если НЕ ТелефонЗаполнен(ЭтотОбъект.НВД_КонтактноеЛицо) Тогда
	//		ТекстОшибки = НСтр("ru='Документ %Документ% не проведен. Не заполнен телефон контактного лица'");
	//		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ЭтотОбъект);	
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , Отказ);
	//	КонецЕсли;
	//Иначе
	//	Если НЕ ТелефонЗаполнен(ЭтотОбъект.Получатель) Тогда
	//		ТекстОшибки = НСтр("ru='Документ %Документ% не проведен. Не заполнен телефон получателя'");
	//		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ЭтотОбъект);	
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , Отказ);
	//	КонецЕсли;
	//КонецЕсли;	
КонецПроцедуры

&После("ЗаполнитьПоЗаказуПокупателяИлиРеализацииТоваровИУслуг")
Процедура НВД_ЗаполнитьПоЗаказуПокупателяИлиРеализацииТоваровИУслуг(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	СуммаДоставки = 0;
	
	Для Каждого ЭлементМассива из МассивДокументов Цикл
		
		Если Получатель <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Если Организация <> ЭлементМассива.Организация Тогда
			Текст = НСтр("ru = 'Организации в выделенных документах различаются, создание документа невозможно'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрокаТоварыОснования Из ЭлементМассива.Товары Цикл
			
			Если ТекущаяСтрокаТоварыОснования.Номенклатура =ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Номенклатура.Доставка") ИЛИ
				ТекущаяСтрокаТоварыОснования.Номенклатура =ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Номенклатура.Доставка2") ИЛИ
				ТекущаяСтрокаТоварыОснования.Номенклатура =ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Номенклатура.Доставка3") ИЛИ
				ТекущаяСтрокаТоварыОснования.Номенклатура =ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Номенклатура.Доставка4") ИЛИ
				ТекущаяСтрокаТоварыОснования.Номенклатура =ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Номенклатура.Доставка5") Тогда
				СуммаДоставки = СуммаДоставки + ТекущаяСтрокаТоварыОснования.Сумма;
			КонецЕсли;			
		КонецЦикла;
		
	КонецЦикла;
	
	СтоимостьДоставки = СуммаДоставки;
	
КонецПроцедуры
