
&НаСервере
&ИзменениеИКонтроль("ДобавитьПодгруппы")
Процедура НВД_ДобавитьПодгруппы(Группа)
	Запрос = Новый Запрос;
	Запрос.Текст =
	#Удаление
	"ВЫБРАТЬ 
	#КонецУдаления
	#Вставка 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	#КонецВставки
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Представление КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Родитель
	|	И Номенклатура.ЭтоГруппа = ИСТИНА";

	Запрос.Параметры.Вставить("Родитель", Группа.Ссылка);

	ВыборкаГрупп = Запрос.Выполнить().Выбрать();
	КоличествоГруппНоменклатуры = КоличествоГруппНоменклатуры + ВыборкаГрупп.Количество();
	Пока ВыборкаГрупп.Следующий() Цикл
		Подгруппа = Группа.Строки.Добавить();
		Подгруппа.Наименование = ВыборкаГрупп.Наименование;
		Подгруппа.Ссылка = ВыборкаГрупп.Ссылка;
		Подгруппа.Индекс = ИндексГруппы;
		ИндексГруппы = ИндексГруппы + 1;
		ДобавитьПодгруппы(Подгруппа);
	КонецЦикла;
КонецПроцедуры
