&НаКлиенте
Процедура НВД_ПриОткрытииПосле(Отказ)
	КСУ_ПриОткрытии();
КонецПроцедуры

#Область КСУ

&НаКлиенте
Процедура КСУ_ПриОткрытии()
	//ИА_КСУ+
	ОбновитьОбщийИтог();
	ОбновитьДоступностьСписанияСФондов();
	Элементы.ИА_ЗаказыНаПриобретениеЗП.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Элементы.ИА_ЗаказыНаПриобретениеЗП.КнопкаСоздания = ложь;
	//ИА_КСУ-
КонецПроцедуры

//ИА_КСУ
&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеЗПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПарамПодб = Новый Структура("НаДату,Организация", Объект.Дата, Объект.Организация);		
	ОпОп = новый ОписаниеОповещения("КомандаПодобратьЗаказЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ИА_ФП_ПодборЗаказаУпр", ПарамПодб,,,,, ОпОп);

КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьЗаказЗавершение(рез, ДополнительныеПараметры) Экспорт		
	Если рез<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Элементы.ИА_ЗаказыНаПриобретение.ТекущиеДанные, рез);
		ОбновитьОбщийИтог();
	КонецЕсли;
КонецПроцедуры

		
&НаКлиенте
Процедура Спецдоход(Команда)
    
	НастройкиФП = ПолучитьНастройкиФП();
	Парам = новый Структура("Док,Организация,НастройкиФП,ДатаОстатков",Объект.Ссылка, Объект.Организация,НастройкиФП, объект.Дата);

	ОткрытьФорму("Документ.ИА_ФинансовоеПланирование.Форма.ФормаПодбораДБПУпр", Парам,,,,, Новый ОписаниеОповещения("КомандаПодобратьЗавершение", ЭтотОбъект, Парам), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	
	Если ТипЗнч(рез) = тип("Массив") Тогда
		Для каждого стр из рез Цикл
			УжеЕсть = ложь;
			для каждого стрСущ из Объект.ИА_Фонды цикл
				Если стрСущ.Источник = стр.Источник и ЗначениеЗаполнено(стр.Источник) тогда
					УжеЕсть = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если УжеЕсть тогда
				ИдИсточникаСтр = ИА_ФПСервер.ИдИсточника(стр.Источник);
				Сообщить("Отложенный доход "+ИдИсточникаСтр+" уже добавлен в документ!");
				Продолжить;
			КонецЕсли;
			
			Новстр = Объект.ИА_Фонды.Добавить();
	        
	        Новстр.ВидДохода = стр.ВидДохода;
			Новстр.ПодразделениеДохода = стр.Подразделение;
	        Новстр.Источник = стр.Источник;
			
			Новстр.Сумма = стр.СуммаБезнал;
			
			Если ДополнительныеПараметры.НастройкиФП.ДоходыПоПодр Тогда
				Новстр.Подразделение = стр.Подразделение;
			Иначе
	        	Новстр.Подразделение = ДополнительныеПараметры.НастройкиФП.ПодразделениеДоходовБП;
			КонецЕсли;
	        Новстр.Фонд = ДополнительныеПараметры.НастройкиФП.ФондДоходовБП; 
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиФП()
    Возврат Новый Структура("ПодразделениеДоходовБП, ФондДоходовБП,РазделятьНалИБезнал,ДоходыПоПодр", 
	Константы.ИА_ФП_ПодразделениеДоходовБП.Получить(), Константы.ИА_ФП_ФондДоходовБП.Получить(),Константы.ИА_ФП_РазделятьНалИБезнал.Получить(),Константы.КСУ_ДоходыПоПодразделениям.Получить());
КонецФункции

&НаКлиенте
Процедура ИА_ЗаказыНаПриобретениеПриИзменении(Элемент)
	ОбновитьОбщийИтог();
КонецПроцедуры

&НаКлиенте
Процедура ИА_ФондыПриИзменении(Элемент)
	ОбновитьОбщийИтог();
КонецПроцедуры

&НаСервере
Процедура ПодборФондовЗаказовНаСервере(СтруктураПараметров, ЭтоФонды)
	Если ЭтоФонды Тогда
		ТЗ = Объект.ИА_Фонды.Выгрузить();
	Иначе	
		ТЗ = Объект.ИА_ЗаказыНаПриобретение.Выгрузить();
	КонецЕсли; 
	СтруктураПараметров = Новый Структура;
	АдресХранилища      = ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор);
	СтруктураПараметров.Вставить("ЭтоТолстыйКлиент" ,	Ложь);
	СтруктураПараметров.Вставить("АдресХранилища" ,		АдресХранилища);
	СтруктураПараметров.Вставить("Организация" ,		Объект.Организация);
	СтруктураПараметров.Вставить("ЭтоНал",				Константы.ИА_ФП_РазделятьНалИБезнал.Получить());
	СтруктураПараметров.Вставить("ДатаДок",				Объект.Дата);
	
	
	СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
	ВалютаДок = Неопределено;
	ВалютаУпр = Неопределено;
	Попытка
		ВалютаДок = Объект[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаДокумента];
		ВалютаУпр = Константы[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаУПР].Получить();
	Исключение
	КонецПопытки;
	СтруктураПараметров.Вставить("ВалютаДок", ВалютаДок);
	СтруктураПараметров.Вставить("ВалютаУпр", ВалютаУпр);
   
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗаказов(Команда)  	
	СтруктураПараметров = Неопределено; 
	ПодборФондовЗаказовНаСервере(СтруктураПараметров, Ложь);
	ОткрытьФорму("ОбщаяФорма.ИА_ПодборЗаявокНаДенСредств", СтруктураПараметров, ЭтаФорма); //,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПодбораНаСервере(Парам)			
	ТЗ = ПолучитьИзВременногоХранилища(Парам.АдресХранилища);
	Если НЕ ТЗ = Неопределено Тогда
		Если ТЗ.Количество() > 0  Тогда
			Если Парам.ЭтоФонды Тогда
				Объект.ИА_Фонды.Загрузить(ТЗ);
			Иначе
				иа_фп.ОбработатьТЧЗаказыПоВалюте(Объект, ТЗ); 
				Объект.ИА_ЗаказыНаПриобретение.Загрузить(ТЗ);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораЗаказовФондов(Парам) Экспорт	
	ОбработкаПодбораНаСервере(Парам); 
	ОбновитьОбщийИтог();
КонецПроцедуры

&НаКлиенте
Процедура ПодборФондов(Команда)
	СтруктураПараметров = Неопределено; 
	ПодборФондовЗаказовНаСервере(СтруктураПараметров, Истина);
	ОткрытьФорму("ОбщаяФорма.ИА_ПодборСтатейЗатратИПодразделений", СтруктураПараметров, ЭтаФорма); //,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОбновитьОбщийИтог();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбщийИтог()
	ИА_ОбщийИтог = Объект.ИА_ЗаказыНаПриобретение.Итог("Сумма") + Объект.ИА_Фонды.Итог("Сумма");
	Элементы.ДекорацияИА_ОбщийИтог.Заголовок = "Общий итог: " + Формат(ИА_ОбщийИтог,"ЧЦ=15; ЧДЦ=2; ЧН=0")+ ИА_ФП_Клиент.ПолучитьУточнениеПоВалюте(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьСписанияСФондов()
	Дост = ИА_ПраваС.ЗначениеПраваТекПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.ИА_ПраваПользователей.ВыплатаНапрямуюСФондов"))
				или ИА_ПраваС.ЗначениеПраваТекПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.ИА_ПраваПользователей.ФП_ПолныеПрава"));
	Элементы.ИА_Фонды.Доступность = Дост;
	Элементы.ИА_Фонды.КоманднаяПанель.Доступность = Дост;
	Элементы.ДекорацияНетправ.Видимость = не Дост;
КонецПроцедуры

//ИА_КСУ

#КонецОбласти