
Функция ЗаказыGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	
	Если ИмяМетода = "orderslist" Тогда 
		Результат = "Расходная накладная, 1, 01.01.2014
    	|Расходная накладная, 2, 01.01.2014";

	ИначеЕсли ИмяМетода = "order" Тогда
		//ПраметрыЗапроса - number
		ПарНомер = Запрос.ПараметрыЗапроса.Получить("number");
		//Номер = Число(?(ПарНомер=Неопределено,0,ПарНомер));
		
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номер = &Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПокупателя.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Номер", ПарНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Если НЕ ВыборкаДетальныеЗаписи.Следующий() Тогда
			Ответ.КодСостояния = 404;
	        Результат = "Отсутствует документ с номером: " + ПарНомер;
	    Иначе
			//Если Номер = 1 Тогда
			//    Результат = "Расходная накладная, 1, 01.01.2014";
			//Иначе
			//    Результат = "Расходная накладная, 2, 01.01.2014";
			//КонецЕсли;  
			ЗаписьJson = Новый ЗаписьJSON();
			ЗаписьJson.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJson, ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(), НазначениеТипаXML.Явное);
			JSON = ЗаписьJson.Закрыть();
			
			Результат = JSON;
	    КонецЕсли;
	Иначе
		 Ответ.КодСостояния = 405;
		 Результат = "Отсутствует Метод " + ИмяМетода;
	КонецЕсли;	
	
	Ответ.УстановитьТелоИзСтроки(Результат,КодировкаТекста.UTF8);	
	//Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Возврат Ответ;
КонецФункции
