
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();	
	Для Каждого Элемент Из Настройки.ПараметрыДанных.Элементы Цикл
		Если Элемент.Параметр = Новый ПараметрКомпоновкиДанных("СтПериод")  Тогда
			ДатаНачалаПериода = ОбщийМодульСервер.ПолучитьДатуПоПараметру(Элемент.Значение.ДатаНачала);
			ДатаОкончанияПериода = ОбщийМодульСервер.ПолучитьДатуПоПараметру(Элемент.Значение.ДатаОкончания);
			
		ИначеЕсли Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ГоризонтПланирования") Тогда			
			ДатаГоризонта = ОбщийМодульСервер.ПолучитьДатуПоПараметру(Элемент);	
		
		// #14728
		ИначеЕсли Элемент.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
			Элемент.Значение = КонецДня(ТекущаяДатаСеанса());	
			Элемент.Использование = Истина;
		
		ИначеЕсли Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ПС") Тогда
			Элемент.Значение = Символы.ПС;
			
		ИначеЕсли Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ПараметрКоличествоМесяцев") Тогда
			ПараметрКоличествоМесяцев = Элемент;
			
		ИначеЕсли Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ПараметрКоличествоДней") Тогда
			ПараметрКоличествоДней = Элемент;
			
		ИначеЕсли Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ПараметрКоличествоДнейДоГоризонтаПланирования") Тогда
			ПараметрКоличествоДнейДоГоризонтаПланирования = Элемент;
			
		КонецЕсли;
	КонецЦикла;
	
	//Нужно проверить, чтобы дата горизонт планирования была больше конца периода
	Если ДатаГоризонта <> Неопределено И ДатаОкончанияПериода <> Неопределено Тогда			
		Если ДатаГоризонта <= ДатаОкончанияПериода Тогда
			ВызватьИсключение("Дата горизонта планирования не может быть меньше или равна окончания периода! Отчет не сформирован.");
		КонецЕсли;
	КонецЕсли;
	
	// #14728 считаем количество месяцев 
	КоличествоМесяцев = 0;
	ТекТочка = ДатаНачалаПериода;	
	Пока ТекТочка < ДатаОкончанияПериода Цикл
		Точка2 = Мин(ДатаОкончанияПериода, КонецМесяца(ТекТочка));
		Разность = (НачалоДня(Точка2) - НачалоДня(ТекТочка)) / (60 * 60 * 24) + 1;
		КалендарныхДней = День(КонецМесяца(Точка2));
		
		КоличествоМесяцев = КоличествоМесяцев + Разность / КалендарныхДней;
		
		ТекТочка = Точка2+1;
	КонецЦикла;
	ПараметрКоличествоМесяцев.Значение = КоличествоМесяцев;
	
	ПараметрКоличествоДней.Значение = (НачалоДня(ДатаОкончанияПериода) - НачалоДня(ДатаНачалаПериода)) / (60 * 60 * 24) + 1;
	ПараметрКоличествоДнейДоГоризонтаПланирования.Значение = (НачалоДня(ДатаГоризонта) - НачалоДня(ДатаОкончанияПериода)) / (60 * 60 * 24);
	
	// компонуем отчет		
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если НЕ Настройки.Структура[0].Имя = "Расшифровка" Тогда
		ПослеКомпоновкиРезультата(ДокументРезультат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеКомпоновкиРезультата(ТабличныйДокумент) Экспорт
		
	// #14728
	ПодстрокаПоиска = "Расход";
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);		
	Пока НЕ НайденнаяОбласть = Неопределено Цикл
		Если НайденнаяОбласть.Право > 1 Тогда
			НижняяЯчейка = ТабличныйДокумент.Область(НайденнаяОбласть.Верх+1, НайденнаяОбласть.Лево, НайденнаяОбласть.Низ+1, НайденнаяОбласть.Право);
			Если НижняяЯчейка.Текст = "Количество" Тогда				
				Область = ТабличныйДокумент.Область(НайденнаяОбласть.Верх, НайденнаяОбласть.Лево, НайденнаяОбласть.Низ+1, НайденнаяОбласть.Право);
				Область.Объединить();
			КонецЕсли;
		КонецЕсли;
		
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);			
	КонецЦикла;
	
	// #14728
	ПодстрокаПоиска = "Общий расход";
	ОбъединитьИСместитьНаверх(ТабличныйДокумент, ПодстрокаПоиска);
		
	ПодстрокаПоиска = "Средний расход";
	ОбъединитьИСместитьНаверх(ТабличныйДокумент, ПодстрокаПоиска);
	
	ПодстрокаПоиска = "на текущий момент";
	ОбъединитьИСместитьНаверх(ТабличныйДокумент, ПодстрокаПоиска);
	
	ПодстрокаПоиска = "Ожидаемый расход к горизонту планирования";
	ОбъединитьИСместитьНаверх(ТабличныйДокумент, ПодстрокаПоиска);
	
	ПодстрокаПоиска = "Ожидаемый остаток";
	ОбъединитьИСместитьНаверх(ТабличныйДокумент, ПодстрокаПоиска);
	
КонецПроцедуры

Процедура ОбъединитьИСместитьНаверх(ТабличныйДокумент, ПодстрокаПоиска)
		
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);		
	Если НЕ НайденнаяОбласть = Неопределено Тогда
		ТекстЯчейки = НайденнаяОбласть.Текст;
		
		Область = ТабличныйДокумент.Область(НайденнаяОбласть.Верх-1, НайденнаяОбласть.Лево, НайденнаяОбласть.Низ, НайденнаяОбласть.Право);
		Область.Объединить();
		Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Область.Текст = ТекстЯчейки;
	КонецЕсли;
		
КонецПроцедуры
