
Функция НВД_ПечатьЗаказПокупателя2(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТоварнаяНакладнаяСВесом";
	//#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателя2");
	//#КонецВставки
	//#Удаление
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	//#КонецУдаления
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ТаблицаНеоплаченныеЗаказы = СтруктураДанныхДляПечати.РезультатПоНеоплаченнымЗаказам.Выгрузить();
	ТаблицаНеоплаченныхЗаказов = СтруктураДанныхДляПечати.РезультатПоСпискуНеоплаченныхЗаказов.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	СоответствияПотолокГарпун = СтруктураДанныхДляПечати.СоответствияПотолокГарпун;
	ТаблицаQRКодовДляОплаты = СтруктураДанныхДляПечати.ТаблицаQRКодовДляОплаты;
	//ДополнитьДаннымиПоМатериалам(ТаблицаДанныеПечати, ТаблицаМатериалы);
	// Изменения размера колоноки, в зависимости от вывода Артикула
	Если Не ВыводитьАртикул Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидка = ДанныеПечати.СуммаРучнойСкидки > 0;		
		ЕстьБонусы = ДанныеПечати.СуммаБонусовКСписанию > 0;		
		
		ВставкаСкидок = ?(ЕстьСкидка, "Скидка","");
		ВставкаСкидок = ?(ЕстьБонусы, ВставкаСкидок+"Бонус", ВставкаСкидок);
		
		//ТекстЗаголовка = "Заказ покупателя №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);
		ДатаЗаказа = Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		
		Попытка
			//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"); 
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКрупный");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка				
				//ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка; 
				ОбластьМакета.Параметры.НомерЗаказа = НомерЗаказа;
				ОбластьМакета.Параметры.ДатаЗаказа = ДатаЗаказа;
			Исключение
			КонецПопытки;
			
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
			ТабличныйДокумент,
			Макет,
			ОбластьМакета,
			ДанныеПечати.Ссылка);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//#13343 
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//#Вставка 
		МассивСсылокНаДоставки = НВД_ОбщийМодульСервер.ПолучитьМассивСсылокНаДоставки(ДанныеПечати.Ссылка);
		//берем данные только из первого документв Доставки, так как предполагается, что к одному заказу клиента может быть привязана 1 доставка
		Если МассивСсылокНаДоставки.Количество() > 0 И МассивСсылокНаДоставки[0].Результат <> Справочники.СтатусыЗаявокНаДоставку.Отказ И МассивСсылокНаДоставки[0].Проведен Тогда
			ЗаявкаНаДоставку = МассивСсылокНаДоставки[0];
			Попытка 
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ТелефонКонтактногоЛица) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("КонтактноеЛицо");					
					ОбластьМакета.Параметры.КонтактноеЛицо = "" + ЗаявкаНаДоставку.ТелефонКонтактногоЛица;
					ТабличныйДокумент.Вывести(ОбластьМакета);
				ИначеЕсли ЗначениеЗаполнено(ЗаявкаНаДоставку.НВД_КонтактноеЛицо) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("КонтактноеЛицо");					
					ОбластьМакета.Параметры.КонтактноеЛицо = "" + ЗаявкаНаДоставку.НВД_КонтактноеЛицо.Наименование + "" + НВД_ОбщийМодульСервер.ПолучитьТелефонКонтактногоЛица(ЗаявкаНаДоставку.НВД_КонтактноеЛицо);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;	
			Исключение
			КонецПопытки;					
			Попытка
				Если ЗаявкаНаДоставку.Срочно ИЛИ ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки) ИЛИ ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ДатаДоставки");
				    
					//ОбластьМакета.Параметры.ОжидаемаяДатаОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=dd.MM.yy; ДЛФ=D");
					//ОбластьМакета.Параметры.ОжидаемоеВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=HH.mm; ДЛФ=T");
					Если ЗаявкаНаДоставку.Срочно Тогда
						ОбластьМакета.Параметры.КрайняяДатаОтгрузки = "" + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ='dd.MM.yy'") + " Срочно (сразу по готовности)";
						ОбластьМакета.Области.ДатаДоставки.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
						//ОбластьМакета.Области.ДатаДоставки.Шрифт = Новый Шрифт(ОбластьМакета.Шрифт,14,Истина);
					Иначе	
						ОбластьМакета.Параметры.КрайняяДатаОтгрузки = "" + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ='dd.MM.yy HH:00'") + " - " + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки + 3600, "ДФ='HH:00'");
					КонецЕсли;	
					//ОбластьМакета.Параметры.КрайнееВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ=HH.mm; ДЛФ=T");
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;
			Исключение
				Ошибка = ОписаниеОшибки();
			КонецПопытки;

			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.АдресДоставки) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("АдресДоставки"); 
					ОбластьМакета.Параметры.АдресДоставки = "" + ЗаявкаНаДоставку.Город + " " + ЗаявкаНаДоставку.АдресДоставки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЕсли;	
		//#КонецВставки
		
		//#13343
		//#Удаление
		Если ЗначениеЗаполнено(ДанныеПечати.АдресМонтажа) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("АдресМонтажа");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		//#КонецУдаления
		//// Изменения размера колоноки, в зависимости от вывода Артикула
		//Если Не ВыводитьАртикул Тогда
		//	Попытка
		//		Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.Комментарий) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Комментарий"); 
				ОбластьМакета.Параметры.Комментарий = ДанныеПечати.Комментарий;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Внимание1");
			//ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
		ВариантФормированияПФЗаказаПокупателя = Константы.ВариантФормированияПФЗаказаПокупателя.Получить();
		
		МассивДопРеквизитов = Новый Массив;
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Скидка", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "СуммаБезСкидки", 		Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Ячейка", 	            Новый ОписаниеТипов("Строка")));
		
		ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказПокупателя", "Товары", МассивДопРеквизитов);
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		
		СоответствиеНомеровСтрокПотолков = Новый Соответствие;
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 1;
					ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
					СоответствиеНомеровСтрокПотолков.Вставить(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.НомерСтрокиПотолка);
					ТекущаяСтрока.ЭтоПотолок = Истина;
					
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 3;
				Иначе
					ТекущаяСтрока.ВидНоменклатуры = 2;
				КонецЕсли;
				Если ТекущаяСтрока.Потолок.Пустая() Тогда
					ТекущаяСтрока.ЕстьПотолок = 2;
				Иначе
					ТекущаяСтрока.ЕстьПотолок = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		Если ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4 Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
				Если НЕ СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок) = Неопределено Тогда
					ТекущаяСтрока.НомерСтрокиПотолка = СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок);
				Иначе
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//4. Потолок - товар - услуга - ПОДЫТОГ - потолок - товар - услуга - ПОДЫТОГ
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются)
		//3. Без сортировки
		Если ВариантФормированияПФЗаказаПокупателя = 0 Тогда
			//#11059
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 4 Тогда			
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("АдресМонтажа, Артикул, Номенклатура, Ячейка, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, СуммаРучнойСкидки, ВидНоменклатуры", "Вес, Количество, Сумма");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 3 Тогда	
			//не сортируем
		КонецЕсли;
		
		ИтогоВес = 0;
		Сумма = 0;
		НомерСтроки = 1;
		
		СуммаПодытог = 0;
		ВесПодытог = 0;
		
		ТекНомерСтрокиПотолка = 1; 
		
		ТаблицаТоварыИУслуги.Колонки.Добавить("Гарпун");
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл
			Если ЗначениеЗаполнено(Товары.Номенклатура) Тогда
				Гарпун = СоответствияПотолокГарпун.Получить(Товары.Номенклатура);
				Если Гарпун <> Неопределено Тогда
					Товары.Гарпун = Гарпун; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл //Шапка.Товары Цикл
			Попытка
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|НомерСтроки");
				
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Артикул");
					ОбластьМакета.Параметры.Заполнить(Товары);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Данные");
				ОбластьМакета.Параметры.Заполнить(Товары);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры);
				//-- №12909
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И НЕ Товары.ЭтоПотолок 
					И Товары.ЕстьПотолок = 1 Тогда
					ПредставлениеНоменклатуры = "    " + ПредставлениеНоменклатуры;	
				КонецЕсли;
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И Товары.ВидНоменклатуры = 1 Тогда
					//ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				КонецЕсли;
				
				//Вес = Товары.Вес * Товары.Количество;
				//Попытка
				//	ОбластьМакета.Параметры.Вес = Вес;
				//Исключение
				//КонецПопытки;
				
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;
				
				ИтогоВес = ИтогоВес + Товары.Вес;
				Сумма = Сумма + Товары.Сумма;
			Исключение
			КонецПопытки;
			
			Если ВариантФормированияПФЗаказаПокупателя = 4 Тогда
				ТребуетсяВыводПодытога = Ложь;
				Если Товары.ЕстьПотолок = 1 Тогда
					Если ТаблицаТоварыИУслуги.Индекс(Товары)+1 = ТаблицаТоварыИУслуги.Количество() Тогда // последняя строка
						ТребуетсяВыводПодытога = Истина;
					Иначе
						СледующаяСТрокаТЗ = ТаблицаТоварыИУслуги[ТаблицаТоварыИУслуги.Индекс(Товары)+1];
						Если НЕ СледующаяСТрокаТЗ.НомерСтрокиПотолка = Товары.НомерСтрокиПотолка Тогда
							ТребуетсяВыводПодытога = Истина;
							ТекНомерСтрокиПотолка = СледующаяСТрокаТЗ.НомерСтрокиПотолка;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ВесПодытог   = ВесПодытог + Товары.Вес;
				СуммаПодытог = СуммаПодытог + Товары.Сумма;
				
				Если ТребуетсяВыводПодытога Тогда
					
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Товары);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;	
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ОбластьМакета.Параметры.Сумма = СуммаПодытог;
						ОбластьМакета.Параметры.Вес   = ВесПодытог;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
					Исключение
					КонецПопытки;
					
					СуммаПодытог = 0;
					ВесПодытог = 0;
				Иначе
					//ВесПодытог   = ВесПодытог + Вес;
					//СуммаПодытог = СуммаПодытог + Товары.Сумма;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
		
		Попытка
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|НомерСтроки"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Артикул"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Артикул"));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Данные"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС И ДанныеПечати.ИтогоСуммаНДС = 0 Тогда			
					ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
				КонецЕсли;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		//НайденныеСтрокиТаблицыНеоплаченныеЗаказы = ТаблицаНеоплаченныеЗаказы.НайтиСтроки(СтруктураПоиска);
		//Если НайденныеСтрокиТаблицыНеоплаченныеЗаказы.Количество() > 0 Тогда
		//	ДанныеПоНеоплаченнымЗаказам = НайденныеСтрокиТаблицыНеоплаченныеЗаказы[0];
		//	СуммаНеоплаченныхЗаказов = ?(ТипЗнч(ДанныеПоНеоплаченнымЗаказам.СуммаНеоплаченныхЗаказов) = Тип("Null"), 0, ДанныеПоНеоплаченнымЗаказам.СуммаНеоплаченныхЗаказов);
		//	Попытка
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНеоплаченныхЗаказав|НомерСтроки");
		//		ТабличныйДокумент.Вывести(ОбластьМакета);
		//		
		//		Если ВыводитьАртикул Тогда
		//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНеоплаченныхЗаказав|Артикул");
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//		КонецЕсли;	
		//		
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНеоплаченныхЗаказав|Данные");
		//		ОбластьМакета.Параметры.СуммаНеоплаченныхЗаказов = СуммаНеоплаченныхЗаказов;
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	Исключение
		//	КонецПопытки; 
		//КонецЕсли; 
		//
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("ДолгКонтрагента|НомерСтроки"); 
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//	
		//	Если ВыводитьАртикул Тогда
		//		ОбластьМакета = Макет.ПолучитьОбласть("ДолгКонтрагента|Артикул");
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	КонецЕсли;  
		//	
		//	ОбластьМакета = Макет.ПолучитьОбласть("ДолгКонтрагента|Данные");		
		//	Долг = ДанныеПечати.ТекущийДолг;
		//	Если Не ЗначениеЗаполнено(Долг) ИЛИ Долг = 0 Тогда
		//		ОбластьМакета.Параметры.ТекстДолгКлиента = "Долг клиента:";
		//		ДолгВПараметр = 0;
		//	ИначеЕсли Долг < 0 Тогда
		//		ДолгВПараметр = Долг * (-1);
		//		ОбластьМакета.Параметры.ТекстДолгКлиента = "Депозит клиента:";
		//	Иначе
		//		ДолгВПараметр = Долг;
		//		ОбластьМакета.Параметры.ТекстДолгКлиента = "Долг клиента:";
		//	КонецЕсли;	
		//	ОбластьМакета.Параметры.СуммаДолгаКонтрагента = ДолгВПараметр;	
		//	ТабличныйДокумент.Присоединить(ОбластьМакета);
		//Исключение
		//КонецПопытки;  
		
		//ИтогоКОплате = 0;
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате|НомерСтроки"); 
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//	
		//	Если ВыводитьАртикул Тогда
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате|Артикул");
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	КонецЕсли;  
		//	
		//	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате|Данные");		
		//	ИтогоКОплате = ДанныеПечати.СуммаДокумента + Долг + СуммаНеоплаченныхЗаказов;
		//	Если ИтогоКОплате < 0  Тогда
		//		ИтогоКОплате = 0;
		//	КонецЕсли;
		//	ОбластьМакета.Параметры.ИтогоКОплате = ИтогоКОплате;	
		//	ТабличныйДокумент.Присоединить(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		//Попытка 
		//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	Попытка
		//		ОбластьМакета.Параметры.СуммаДокументаПрописью = 
		//		РаботаСВалютой.СформироватьЧислоПрописьюВсп(ДанныеПечати.СуммаДокумента, ДанныеПечати.Валюта, "Л=ru_RU;ДП=Ложь");
		//	Исключение
		//	КонецПопытки;		
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		
		
		// #13343 		
		Если ЗначениеЗаполнено(ДанныеПечати.Примечание) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Примечание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли; 
		
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Внимание2");
		//	Долг = ДанныеПечати.ТекущийДолг;
		//	Если Не ЗначениеЗаполнено(Долг) Тогда
		//		ОбластьМакета.Параметры.ДолгКлиента = "Долгов между исполнителем и заказчиком нет.";
		//	ИначеЕсли Долг < 0 Тогда
		//		Долг = Долг * (-1);
		//		ОбластьМакета.Параметры.ДолгКлиента = "Депозит клиента составляет " + Долг + " рублей.";
		//	Иначе
		//		ОбластьМакета.Параметры.ДолгКлиента = "Долг клиента составляет " + Долг + " рублей.";
		//	КонецЕсли;	
		//		
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("МенеджерСделки");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		СтруктураПоиска = Новый Структура("Заказ", ДанныеПечати.Ссылка);		
		НайденныеСтрокиТаблицыQRКодовДляОплаты = ТаблицаQRКодовДляОплаты.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтрокиТаблицыQRКодовДляОплаты.Количество() > 0 Тогда
			Для Каждого СтрокаQRКода Из НайденныеСтрокиТаблицыQRКодовДляОплаты Цикл
				Попытка 
					Данные = СтрокаQRКода.imageParams_content.Получить();
					ДД = Base64Значение(Данные);
					КартинкаQR = Новый Картинка(ДД, Ложь);
					ОбластьМакета = Макет.ПолучитьОбласть("QRКод");
					ОбластьМакета.Рисунки["КартинкаQRКодаНаОплату"].Картинка = КартинкаQR;
					ТабличныйДокумент.Вывести(ОбластьМакета);
				Исключение
				КонецПопытки;
			КонецЦикла;	
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Контрагент", ДанныеПечати.Ссылка.Контрагент);		
		НайденныеСтрокиТаблицыНеоплаченныхЗаказов = ТаблицаНеоплаченныхЗаказов.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтрокиТаблицыНеоплаченныхЗаказов.Количество() > 0 Тогда
			//шапка
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|НомерСтроки");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|Артикул");
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;	
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|Данные");
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			Исключение
			КонецПопытки;
			
			Попытка 
				
				ИтогоСуммаНеоплаченныхЗаказов = 0;
				Для Каждого НеоплаченныйЗаказ Из НайденныеСтрокиТаблицыНеоплаченныхЗаказов Цикл
						
					СуммаНеоплаченныхЗаказов = НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|НомерСтроки");
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|Артикул");
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;	
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|Данные");
					ОбластьМакета.Параметры.ДатаЗаказа = Формат(НеоплаченныйЗаказ.ДатаЗаказа, "ДФ=dd.MM.yyyy");
					ОбластьМакета.Параметры.НомерЗаказа = Формат(НеоплаченныйЗаказ.НомерЗаказа, "ЧФ=Ч"); 
					ОбластьМакета.Параметры.СуммаНеоплаченныхЗаказов = НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа;
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов + НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа
					
				КонецЦикла;

			
			
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|НомерСтроки");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Артикул");
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;	
				
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Данные");
				ОбластьМакета.Параметры.ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов;
				ТабличныйДокумент.Присоединить(ОбластьМакета);

			Исключение
				
			КонецПопытки;
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		Если НЕ ОбъектыПечати = Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция НВД_ПечатьЗаказПокупателя3(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТоварнаяНакладнаяСВесом3";
	//#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателя3");
	//#КонецВставки
	//#Удаление
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	//#КонецУдаления
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм3(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ТаблицаНеоплаченныеЗаказы = СтруктураДанныхДляПечати.РезультатПоНеоплаченнымЗаказам.Выгрузить();
	ТаблицаНеоплаченныхЗаказов = СтруктураДанныхДляПечати.РезультатПоСпискуНеоплаченныхЗаказов.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	СоответствияПотолокГарпун = СтруктураДанныхДляПечати.СоответствияПотолокГарпун;
	ТаблицаQRКодовДляОплаты = СтруктураДанныхДляПечати.ТаблицаQRКодовДляОплаты;
	//ДополнитьДаннымиПоМатериалам(ТаблицаДанныеПечати, ТаблицаМатериалы);
	// Изменения размера колоноки, в зависимости от вывода Артикула
	Если Не ВыводитьАртикул Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидка = ДанныеПечати.СуммаРучнойСкидки > 0;		
		ЕстьБонусы = ДанныеПечати.СуммаБонусовКСписанию > 0;		
		
		ВставкаСкидок = ?(ЕстьСкидка, "Скидка","");
		ВставкаСкидок = ?(ЕстьБонусы, ВставкаСкидок+"Бонус", ВставкаСкидок);
		
		//ТекстЗаголовка = "Заказ покупателя №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);
		ДатаЗаказа = Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		
		Попытка
			//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"); 
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКрупный");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка				
				//ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка; 
				ОбластьМакета.Параметры.НомерЗаказа = НомерЗаказа;
				ОбластьМакета.Параметры.ДатаЗаказа = ДатаЗаказа;
			Исключение
			КонецПопытки;
			
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
			ТабличныйДокумент,
			Макет,
			ОбластьМакета,
			ДанныеПечати.Ссылка);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//#13343 
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//#Вставка 
		МассивСсылокНаДоставки = НВД_ОбщийМодульСервер.ПолучитьМассивСсылокНаДоставки(ДанныеПечати.Ссылка);
		//берем данные только из первого документв Доставки, так как предполагается, что к одному заказу клиента может быть привязана 1 доставка
		Если МассивСсылокНаДоставки.Количество() > 0 И МассивСсылокНаДоставки[0].Результат <> Справочники.СтатусыЗаявокНаДоставку.Отказ И МассивСсылокНаДоставки[0].Проведен Тогда
			ЗаявкаНаДоставку = МассивСсылокНаДоставки[0];
			Попытка 
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ТелефонКонтактногоЛица) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("КонтактноеЛицо");					
					ОбластьМакета.Параметры.КонтактноеЛицо = "" + ЗаявкаНаДоставку.ТелефонКонтактногоЛица;
					ТабличныйДокумент.Вывести(ОбластьМакета);
				ИначеЕсли ЗначениеЗаполнено(ЗаявкаНаДоставку.НВД_КонтактноеЛицо) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("КонтактноеЛицо");					
					ОбластьМакета.Параметры.КонтактноеЛицо = "" + ЗаявкаНаДоставку.НВД_КонтактноеЛицо.Наименование + "" + НВД_ОбщийМодульСервер.ПолучитьТелефонКонтактногоЛица(ЗаявкаНаДоставку.НВД_КонтактноеЛицо);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;	
			Исключение
			КонецПопытки;					
			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки) ИЛИ ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ДатаДоставки");
				    
					//ОбластьМакета.Параметры.ОжидаемаяДатаОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=dd.MM.yy; ДЛФ=D");
					//ОбластьМакета.Параметры.ОжидаемоеВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=HH.mm; ДЛФ=T");
					ОбластьМакета.Параметры.КрайняяДатаОтгрузки = "" + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ='dd.MM.yy HH:00'") + " - " + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки + 3600, "ДФ='HH:00'");
					//ОбластьМакета.Параметры.КрайнееВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ=HH.mm; ДЛФ=T");
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;
			Исключение
			КонецПопытки;

			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.АдресДоставки) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("АдресДоставки"); 
					ОбластьМакета.Параметры.АдресДоставки = "" + ЗаявкаНаДоставку.Город + " " + ЗаявкаНаДоставку.АдресДоставки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЕсли;	
		//#КонецВставки
		
		//#13343
		//#Удаление
		Если ЗначениеЗаполнено(ДанныеПечати.АдресМонтажа) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("АдресМонтажа");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		//#КонецУдаления
		//// Изменения размера колоноки, в зависимости от вывода Артикула
		//Если Не ВыводитьАртикул Тогда
		//	Попытка
		//		Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.Комментарий) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Комментарий"); 
				ОбластьМакета.Параметры.Комментарий = ДанныеПечати.Комментарий;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Внимание1");
			//ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
		ВариантФормированияПФЗаказаПокупателя = Константы.ВариантФормированияПФЗаказаПокупателя.Получить();
		
		МассивДопРеквизитов = Новый Массив;
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Скидка", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "СуммаБезСкидки", 		Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));
		
		//МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Ячейка", 	            Новый ОписаниеТипов("Строка")));
		
		ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказПокупателя", "Товары", МассивДопРеквизитов);
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		
		СоответствиеНомеровСтрокПотолков = Новый Соответствие;
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 1;
					ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
					СоответствиеНомеровСтрокПотолков.Вставить(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.НомерСтрокиПотолка);
					ТекущаяСтрока.ЭтоПотолок = Истина;
					
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 3;
				Иначе
					ТекущаяСтрока.ВидНоменклатуры = 2;
				КонецЕсли;
				Если ТекущаяСтрока.Потолок.Пустая() Тогда
					ТекущаяСтрока.ЕстьПотолок = 2;
				Иначе
					ТекущаяСтрока.ЕстьПотолок = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		Если ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4 Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
				Если НЕ СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок) = Неопределено Тогда
					ТекущаяСтрока.НомерСтрокиПотолка = СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок);
				Иначе
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//4. Потолок - товар - услуга - ПОДЫТОГ - потолок - товар - услуга - ПОДЫТОГ
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются)
		//3. Без сортировки
		Если ВариантФормированияПФЗаказаПокупателя = 0 Тогда
			//#11059
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 4 Тогда			
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("АдресМонтажа, Артикул, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, СуммаРучнойСкидки, ВидНоменклатуры", "Вес, Количество, Сумма");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 3 Тогда	
			//не сортируем
		КонецЕсли;
		
		ИтогоВес = 0;
		Сумма = 0;
		НомерСтроки = 1;
		
		СуммаПодытог = 0;
		ВесПодытог = 0;
		
		ТекНомерСтрокиПотолка = 1; 
		
		ТаблицаТоварыИУслуги.Колонки.Добавить("Гарпун");
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл
			Если ЗначениеЗаполнено(Товары.Номенклатура) Тогда
				Гарпун = СоответствияПотолокГарпун.Получить(Товары.Номенклатура);
				Если Гарпун <> Неопределено Тогда
					Товары.Гарпун = Гарпун; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл //Шапка.Товары Цикл
			Попытка
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|НомерСтроки");
				
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Артикул");
					ОбластьМакета.Параметры.Заполнить(Товары);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Данные");
				ОбластьМакета.Параметры.Заполнить(Товары);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры);
				//-- №12909
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И НЕ Товары.ЭтоПотолок 
					И Товары.ЕстьПотолок = 1 Тогда
					ПредставлениеНоменклатуры = "    " + ПредставлениеНоменклатуры;	
				КонецЕсли;
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И Товары.ВидНоменклатуры = 1 Тогда
					//ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				КонецЕсли;
				
				//Вес = Товары.Вес * Товары.Количество;
				//Попытка
				//	ОбластьМакета.Параметры.Вес = Вес;
				//Исключение
				//КонецПопытки;
				
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;
				
				ИтогоВес = ИтогоВес + Товары.Вес;
				Сумма = Сумма + Товары.Сумма;
			Исключение
			КонецПопытки;
			
			Если ВариантФормированияПФЗаказаПокупателя = 4 Тогда
				ТребуетсяВыводПодытога = Ложь;
				Если Товары.ЕстьПотолок = 1 Тогда
					Если ТаблицаТоварыИУслуги.Индекс(Товары)+1 = ТаблицаТоварыИУслуги.Количество() Тогда // последняя строка
						ТребуетсяВыводПодытога = Истина;
					Иначе
						СледующаяСТрокаТЗ = ТаблицаТоварыИУслуги[ТаблицаТоварыИУслуги.Индекс(Товары)+1];
						Если НЕ СледующаяСТрокаТЗ.НомерСтрокиПотолка = Товары.НомерСтрокиПотолка Тогда
							ТребуетсяВыводПодытога = Истина;
							ТекНомерСтрокиПотолка = СледующаяСТрокаТЗ.НомерСтрокиПотолка;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ВесПодытог   = ВесПодытог + Товары.Вес;
				СуммаПодытог = СуммаПодытог + Товары.Сумма;
				
				Если ТребуетсяВыводПодытога Тогда
					
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Товары);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;	
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ОбластьМакета.Параметры.Сумма = СуммаПодытог;
						ОбластьМакета.Параметры.Вес   = ВесПодытог;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
					Исключение
					КонецПопытки;
					
					СуммаПодытог = 0;
					ВесПодытог = 0;
				Иначе
					//ВесПодытог   = ВесПодытог + Вес;
					//СуммаПодытог = СуммаПодытог + Товары.Сумма;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
		
		Попытка
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|НомерСтроки"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Артикул"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Артикул"));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Данные"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС И ДанныеПечати.ИтогоСуммаНДС = 0 Тогда			
					ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
				КонецЕсли;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		//НайденныеСтрокиТаблицыНеоплаченныеЗаказы = ТаблицаНеоплаченныеЗаказы.НайтиСтроки(СтруктураПоиска);
		//Если НайденныеСтрокиТаблицыНеоплаченныеЗаказы.Количество() > 0 Тогда
		//	ДанныеПоНеоплаченнымЗаказам = НайденныеСтрокиТаблицыНеоплаченныеЗаказы[0];
		//	СуммаНеоплаченныхЗаказов = ?(ТипЗнч(ДанныеПоНеоплаченнымЗаказам.СуммаНеоплаченныхЗаказов) = Тип("Null"), 0, ДанныеПоНеоплаченнымЗаказам.СуммаНеоплаченныхЗаказов);
		//	Попытка
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНеоплаченныхЗаказав|НомерСтроки");
		//		ТабличныйДокумент.Вывести(ОбластьМакета);
		//		
		//		Если ВыводитьАртикул Тогда
		//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНеоплаченныхЗаказав|Артикул");
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//		КонецЕсли;	
		//		
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНеоплаченныхЗаказав|Данные");
		//		ОбластьМакета.Параметры.СуммаНеоплаченныхЗаказов = СуммаНеоплаченныхЗаказов;
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	Исключение
		//	КонецПопытки; 
		//КонецЕсли; 
		//
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("ДолгКонтрагента|НомерСтроки"); 
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//	
		//	Если ВыводитьАртикул Тогда
		//		ОбластьМакета = Макет.ПолучитьОбласть("ДолгКонтрагента|Артикул");
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	КонецЕсли;  
		//	
		//	ОбластьМакета = Макет.ПолучитьОбласть("ДолгКонтрагента|Данные");		
		//	Долг = ДанныеПечати.ТекущийДолг;
		//	Если Не ЗначениеЗаполнено(Долг) ИЛИ Долг = 0 Тогда
		//		ОбластьМакета.Параметры.ТекстДолгКлиента = "Долг клиента:";
		//		ДолгВПараметр = 0;
		//	ИначеЕсли Долг < 0 Тогда
		//		ДолгВПараметр = Долг * (-1);
		//		ОбластьМакета.Параметры.ТекстДолгКлиента = "Депозит клиента:";
		//	Иначе
		//		ДолгВПараметр = Долг;
		//		ОбластьМакета.Параметры.ТекстДолгКлиента = "Долг клиента:";
		//	КонецЕсли;	
		//	ОбластьМакета.Параметры.СуммаДолгаКонтрагента = ДолгВПараметр;	
		//	ТабличныйДокумент.Присоединить(ОбластьМакета);
		//Исключение
		//КонецПопытки;  
		
		//ИтогоКОплате = 0;
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате|НомерСтроки"); 
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//	
		//	Если ВыводитьАртикул Тогда
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате|Артикул");
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	КонецЕсли;  
		//	
		//	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоКОплате|Данные");		
		//	ИтогоКОплате = ДанныеПечати.СуммаДокумента + Долг + СуммаНеоплаченныхЗаказов;
		//	Если ИтогоКОплате < 0  Тогда
		//		ИтогоКОплате = 0;
		//	КонецЕсли;
		//	ОбластьМакета.Параметры.ИтогоКОплате = ИтогоКОплате;	
		//	ТабличныйДокумент.Присоединить(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		//Попытка 
		//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	Попытка
		//		ОбластьМакета.Параметры.СуммаДокументаПрописью = 
		//		РаботаСВалютой.СформироватьЧислоПрописьюВсп(ДанныеПечати.СуммаДокумента, ДанныеПечати.Валюта, "Л=ru_RU;ДП=Ложь");
		//	Исключение
		//	КонецПопытки;		
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		
		
		// #13343 		
		Если ЗначениеЗаполнено(ДанныеПечати.Примечание) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Примечание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли; 
		
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Внимание2");
		//	Долг = ДанныеПечати.ТекущийДолг;
		//	Если Не ЗначениеЗаполнено(Долг) Тогда
		//		ОбластьМакета.Параметры.ДолгКлиента = "Долгов между исполнителем и заказчиком нет.";
		//	ИначеЕсли Долг < 0 Тогда
		//		Долг = Долг * (-1);
		//		ОбластьМакета.Параметры.ДолгКлиента = "Депозит клиента составляет " + Долг + " рублей.";
		//	Иначе
		//		ОбластьМакета.Параметры.ДолгКлиента = "Долг клиента составляет " + Долг + " рублей.";
		//	КонецЕсли;	
		//		
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("МенеджерСделки");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		СтруктураПоиска = Новый Структура("Заказ", ДанныеПечати.Ссылка);		
		НайденныеСтрокиТаблицыQRКодовДляОплаты = ТаблицаQRКодовДляОплаты.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтрокиТаблицыQRКодовДляОплаты.Количество() > 0 Тогда
			Для Каждого СтрокаQRКода Из НайденныеСтрокиТаблицыQRКодовДляОплаты Цикл
				Попытка 
					Данные = СтрокаQRКода.imageParams_content.Получить();
					ДД = Base64Значение(Данные);
					КартинкаQR = Новый Картинка(ДД, Ложь);
					ОбластьМакета = Макет.ПолучитьОбласть("QRКод");
					ОбластьМакета.Рисунки["КартинкаQRКодаНаОплату"].Картинка = КартинкаQR;
					ТабличныйДокумент.Вывести(ОбластьМакета);
				Исключение
				КонецПопытки;
			КонецЦикла;	
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Контрагент", ДанныеПечати.Ссылка.Контрагент);		
		НайденныеСтрокиТаблицыНеоплаченныхЗаказов = ТаблицаНеоплаченныхЗаказов.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтрокиТаблицыНеоплаченныхЗаказов.Количество() > 0 Тогда
			//шапка
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|НомерСтроки");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|Артикул");
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;	
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|Данные");
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			Исключение
			КонецПопытки;
			
			Попытка 
				
				ИтогоСуммаНеоплаченныхЗаказов = 0;
				Для Каждого НеоплаченныйЗаказ Из НайденныеСтрокиТаблицыНеоплаченныхЗаказов Цикл
						
					СуммаНеоплаченныхЗаказов = НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|НомерСтроки");
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|Артикул");
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;	
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|Данные");
					ОбластьМакета.Параметры.ДатаЗаказа = Формат(НеоплаченныйЗаказ.ДатаЗаказа, "ДФ=dd.MM.yyyy");
					ОбластьМакета.Параметры.НомерЗаказа = Формат(НеоплаченныйЗаказ.НомерЗаказа, "ЧФ=Ч"); 
					ОбластьМакета.Параметры.СуммаНеоплаченныхЗаказов = НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа;
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов + НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа
					
				КонецЦикла;

			
			
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|НомерСтроки");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Артикул");
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;	
				
				ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Данные");
				ОбластьМакета.Параметры.ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов;
				ТабличныйДокумент.Присоединить(ОбластьМакета);

			Исключение
				
			КонецПопытки;
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		Если НЕ ОбъектыПечати = Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция НВД_ПечатьЗаказПокупателяДляПокупателя(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ЗаказПокупателяДляПокупателя";
	//#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателяДляПокупателя");
	//#КонецВставки
	//#Удаление
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	//#КонецУдаления
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм3(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ТаблицаНеоплаченныеЗаказы = СтруктураДанныхДляПечати.РезультатПоНеоплаченнымЗаказам.Выгрузить();
	ТаблицаНеоплаченныхЗаказов = СтруктураДанныхДляПечати.РезультатПоСпискуНеоплаченныхЗаказов.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	СоответствияПотолокГарпун = СтруктураДанныхДляПечати.СоответствияПотолокГарпун;
	ТаблицаQRКодовДляОплаты = СтруктураДанныхДляПечати.ТаблицаQRКодовДляОплаты;
	//ДополнитьДаннымиПоМатериалам(ТаблицаДанныеПечати, ТаблицаМатериалы);
	// Изменения размера колоноки, в зависимости от вывода Артикула
	Если Не ВыводитьАртикул Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидка = ДанныеПечати.СуммаРучнойСкидки > 0;		
		ЕстьБонусы = ДанныеПечати.СуммаБонусовКСписанию > 0;		
		
		ВставкаСкидок = ?(ЕстьСкидка, "Скидка","");
		ВставкаСкидок = ?(ЕстьБонусы, ВставкаСкидок+"Бонус", ВставкаСкидок);
		
		//ТекстЗаголовка = "Заказ покупателя №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);
		ДатаЗаказа = Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD"); 
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
		//	ТабличныйДокумент,
		//	Макет,
		//	ОбластьМакета,
		//	ДанныеПечати.Ссылка);

		
		
		//Попытка				
		//	//ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка; 
		//	ОбластьМакета.Параметры.НомерЗаказа = НомерЗаказа;
		//	ОбластьМакета.Параметры.ДатаЗаказа = ДатаЗаказа;
		//Исключение
		//КонецПопытки;			
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		ТекстЗаголовка = "УВАЖАЕМЫЙ КЛИЕНТ, ПРОСИМ ПРОВЕРЯТЬ СЧЕТ НА КОРРЕКТНОСТЬ ДАННЫХ ВАШЕГО ЗАКАЗА";	
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка				
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Вывести(ОбластьМакета);
	    Исключение
		КонецПопытки;
				
		////#13343 
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Склад");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		//
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		//#Вставка
		КонтактноеЛицо = "";
		КрайняяДатаОтгрузки = "";
		АдресДоставки = "";
		Комментарий = ""; 
		ОжидаемаяДатаОтгрузки = "";
		МассивСсылокНаДоставки = НВД_ОбщийМодульСервер.ПолучитьМассивСсылокНаДоставки(ДанныеПечати.Ссылка);
		//берем данные только из первого документв Доставки, так как предполагается, что к одному заказу клиента может быть привязана 1 доставка
		Если МассивСсылокНаДоставки.Количество() > 0 И МассивСсылокНаДоставки[0].Результат <> Справочники.СтатусыЗаявокНаДоставку.Отказ И МассивСсылокНаДоставки[0].Проведен Тогда
			ЗаявкаНаДоставку = МассивСсылокНаДоставки[0];
			Попытка 
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ТелефонКонтактногоЛица) Тогда					
					КонтактноеЛицо = "" + ЗаявкаНаДоставку.ТелефонКонтактногоЛица;
				ИначеЕсли ЗначениеЗаполнено(ЗаявкаНаДоставку.НВД_КонтактноеЛицо) Тогда					
					КонтактноеЛицо = "" + ЗаявкаНаДоставку.НВД_КонтактноеЛицо.Наименование + "" + НВД_ОбщийМодульСервер.ПолучитьТелефонКонтактногоЛица(ЗаявкаНаДоставку.НВД_КонтактноеЛицо);
				КонецЕсли;	
			Исключение
			КонецПопытки;					
			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки) ИЛИ ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки) Тогда
					//ОбластьМакета.Параметры.ОжидаемаяДатаОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=dd.MM.yy; ДЛФ=D");
					//ОбластьМакета.Параметры.ОжидаемоеВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=HH.mm; ДЛФ=T");
					КрайняяДатаОтгрузки = "" + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ='dd.MM.yy HH:00'") + " - " + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки + 3600, "ДФ='HH:00'");
					//ОбластьМакета.Параметры.КрайнееВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ=HH.mm; ДЛФ=T");
				КонецЕсли;
			Исключение
			КонецПопытки;

			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.АдресДоставки) Тогда
					АдресДоставки = "" + ЗаявкаНаДоставку.Город + " " + ЗаявкаНаДоставку.АдресДоставки;
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.Комментарий) Тогда
				Комментарий = ДанныеПечати.Комментарий;
			КонецЕсли;	
		Исключение
		КонецПопытки;
		//#КонецВставки
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКрупный2"); 
			ОбластьМакета.Параметры.НомерЗаказа = НомерЗаказа;
			ОбластьМакета.Параметры.ДатаЗаказа = ДатаЗаказа; 
			ОбластьМакета.Параметры.Контрагент = ДанныеПечати.Ссылка.Контрагент;
			ОбластьМакета.Параметры.Склад = ДанныеПечати.Склад;
			ОбластьМакета.Параметры.КонтактноеЛицо = КонтактноеЛицо;
			ОбластьМакета.Параметры.КрайняяДатаОтгрузки = КрайняяДатаОтгрузки;
			ОбластьМакета.Параметры.АдресДоставки = АдресДоставки;
			ОбластьМакета.Параметры.Комментарий = Комментарий;
			ТабличныйДокумент.Вывести(ОбластьМакета);	
		Исключение
		КонецПопытки; 
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
		ВариантФормированияПФЗаказаПокупателя = Константы.ВариантФормированияПФЗаказаПокупателя.Получить();
		
		МассивДопРеквизитов = Новый Массив;
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Скидка", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "СуммаБезСкидки", 		Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));
		
		//МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Ячейка", 	            Новый ОписаниеТипов("Строка")));
		
		ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказПокупателя", "Товары", МассивДопРеквизитов);
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		
		СоответствиеНомеровСтрокПотолков = Новый Соответствие;
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 1;
					ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
					СоответствиеНомеровСтрокПотолков.Вставить(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.НомерСтрокиПотолка);
					ТекущаяСтрока.ЭтоПотолок = Истина;
					
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 3;
				Иначе
					ТекущаяСтрока.ВидНоменклатуры = 2;
				КонецЕсли;
				Если ТекущаяСтрока.Потолок.Пустая() Тогда
					ТекущаяСтрока.ЕстьПотолок = 2;
				Иначе
					ТекущаяСтрока.ЕстьПотолок = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		Если ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4 Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
				Если НЕ СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок) = Неопределено Тогда
					ТекущаяСтрока.НомерСтрокиПотолка = СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок);
				Иначе
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//4. Потолок - товар - услуга - ПОДЫТОГ - потолок - товар - услуга - ПОДЫТОГ
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются)
		//3. Без сортировки
		Если ВариантФормированияПФЗаказаПокупателя = 0 Тогда
			//#11059
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 4 Тогда			
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("АдресМонтажа, Артикул, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, СуммаРучнойСкидки, ВидНоменклатуры", "Вес, Количество, Сумма");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 3 Тогда	
			//не сортируем
		КонецЕсли;
		
		ИтогоВес = 0;
		Сумма = 0;
		НомерСтроки = 1;
		
		СуммаПодытог = 0;
		ВесПодытог = 0;
		
		ТекНомерСтрокиПотолка = 1; 
		
		ТаблицаТоварыИУслуги.Колонки.Добавить("Гарпун");
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл
			Если ЗначениеЗаполнено(Товары.Номенклатура) Тогда
				Гарпун = СоответствияПотолокГарпун.Получить(Товары.Номенклатура);
				Если Гарпун <> Неопределено Тогда
					Товары.Гарпун = Гарпун; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл //Шапка.Товары Цикл
			Попытка
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|НомерСтроки");
				
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Артикул");
					ОбластьМакета.Параметры.Заполнить(Товары);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Данные");
				ОбластьМакета.Параметры.Заполнить(Товары);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры);
				//-- №12909
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И НЕ Товары.ЭтоПотолок 
					И Товары.ЕстьПотолок = 1 Тогда
					ПредставлениеНоменклатуры = "    " + ПредставлениеНоменклатуры;	
				КонецЕсли;
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И Товары.ВидНоменклатуры = 1 Тогда
					//ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				КонецЕсли;
				
				//Вес = Товары.Вес * Товары.Количество;
				//Попытка
				//	ОбластьМакета.Параметры.Вес = Вес;
				//Исключение
				//КонецПопытки;
				
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;
				
				ИтогоВес = ИтогоВес + Товары.Вес;
				Сумма = Сумма + Товары.Сумма;
			Исключение
			КонецПопытки;
			
			Если ВариантФормированияПФЗаказаПокупателя = 4 Тогда
				ТребуетсяВыводПодытога = Ложь;
				Если Товары.ЕстьПотолок = 1 Тогда
					Если ТаблицаТоварыИУслуги.Индекс(Товары)+1 = ТаблицаТоварыИУслуги.Количество() Тогда // последняя строка
						ТребуетсяВыводПодытога = Истина;
					Иначе
						СледующаяСТрокаТЗ = ТаблицаТоварыИУслуги[ТаблицаТоварыИУслуги.Индекс(Товары)+1];
						Если НЕ СледующаяСТрокаТЗ.НомерСтрокиПотолка = Товары.НомерСтрокиПотолка Тогда
							ТребуетсяВыводПодытога = Истина;
							ТекНомерСтрокиПотолка = СледующаяСТрокаТЗ.НомерСтрокиПотолка;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ВесПодытог   = ВесПодытог + Товары.Вес;
				СуммаПодытог = СуммаПодытог + Товары.Сумма;
				
				Если ТребуетсяВыводПодытога Тогда
					
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Товары);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;	
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ОбластьМакета.Параметры.Сумма = СуммаПодытог;
						ОбластьМакета.Параметры.Вес   = ВесПодытог;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
					Исключение
					КонецПопытки;
					
					СуммаПодытог = 0;
					ВесПодытог = 0;
				Иначе
					//ВесПодытог   = ВесПодытог + Вес;
					//СуммаПодытог = СуммаПодытог + Товары.Сумма;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
		
		Попытка
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|НомерСтроки"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Артикул"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Артикул"));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Данные"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС И ДанныеПечати.ИтогоСуммаНДС = 0 Тогда			
					ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
				КонецЕсли;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;		
		
		
		// #13343 		
		Если ЗначениеЗаполнено(ДанныеПечати.Примечание) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Примечание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли; 
		
		Попытка
			//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"); 
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьАкция");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Внимание2");
		//	Долг = ДанныеПечати.ТекущийДолг;
		//	Если Не ЗначениеЗаполнено(Долг) Тогда
		//		ОбластьМакета.Параметры.ДолгКлиента = "Долгов между исполнителем и заказчиком нет.";
		//	ИначеЕсли Долг < 0 Тогда
		//		Долг = Долг * (-1);
		//		ОбластьМакета.Параметры.ДолгКлиента = "Депозит клиента составляет " + Долг + " рублей.";
		//	Иначе
		//		ОбластьМакета.Параметры.ДолгКлиента = "Долг клиента составляет " + Долг + " рублей.";
		//	КонецЕсли;	
		//		
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("МенеджерСделки");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		//СтруктураПоиска = Новый Структура("Заказ", ДанныеПечати.Ссылка);		
		//НайденныеСтрокиТаблицыQRКодовДляОплаты = ТаблицаQRКодовДляОплаты.НайтиСтроки(СтруктураПоиска);
		//Если НайденныеСтрокиТаблицыQRКодовДляОплаты.Количество() > 0 Тогда
		//	Для Каждого СтрокаQRКода Из НайденныеСтрокиТаблицыQRКодовДляОплаты Цикл
		//		Попытка 
		//			Данные = СтрокаQRКода.imageParams_content.Получить();
		//			ДД = Base64Значение(Данные);
		//			КартинкаQR = Новый Картинка(ДД, Ложь);
		//			ОбластьМакета = Макет.ПолучитьОбласть("QRКод");
		//			ОбластьМакета.Рисунки["КартинкаQRКодаНаОплату"].Картинка = КартинкаQR;
		//			ТабличныйДокумент.Вывести(ОбластьМакета);
		//		Исключение
		//		КонецПопытки;
		//	КонецЦикла;	
		//КонецЕсли;
		
		//СтруктураПоиска = Новый Структура("Контрагент", ДанныеПечати.Ссылка.Контрагент);		
		//НайденныеСтрокиТаблицыНеоплаченныхЗаказов = ТаблицаНеоплаченныхЗаказов.НайтиСтроки(СтруктураПоиска);
		//Если НайденныеСтрокиТаблицыНеоплаченныхЗаказов.Количество() > 0 Тогда
		//	//шапка
		//	Попытка
		//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|НомерСтроки");
		//		ТабличныйДокумент.Вывести(ОбластьМакета);
		//		
		//		Если ВыводитьАртикул Тогда
		//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|Артикул");
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//		КонецЕсли;	
		//		
		//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|Данные");
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	Исключение
		//	КонецПопытки;
		//	
		//	Попытка 
		//		
		//		ИтогоСуммаНеоплаченныхЗаказов = 0;
		//		Для Каждого НеоплаченныйЗаказ Из НайденныеСтрокиТаблицыНеоплаченныхЗаказов Цикл
		//				
		//			СуммаНеоплаченныхЗаказов = НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа;
		//			
		//			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|НомерСтроки");
		//			ТабличныйДокумент.Вывести(ОбластьМакета);
		//			
		//			Если ВыводитьАртикул Тогда
		//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|Артикул");
		//				ТабличныйДокумент.Присоединить(ОбластьМакета);
		//			КонецЕсли;	
		//			
		//			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|Данные");
		//			ОбластьМакета.Параметры.ДатаЗаказа = Формат(НеоплаченныйЗаказ.ДатаЗаказа, "ДФ=dd.MM.yyyy");
		//			ОбластьМакета.Параметры.НомерЗаказа = Формат(НеоплаченныйЗаказ.НомерЗаказа, "ЧФ=Ч"); 
		//			ОбластьМакета.Параметры.СуммаНеоплаченныхЗаказов = НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа;
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//			ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов + НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа
		//			
		//		КонецЦикла;

		//	
		//	
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|НомерСтроки");
		//		ТабличныйДокумент.Вывести(ОбластьМакета);
		//		
		//		Если ВыводитьАртикул Тогда
		//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Артикул");
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//		КонецЕсли;	
		//		
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Данные");
		//		ОбластьМакета.Параметры.ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов;
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);

		//	Исключение
		//		
		//	КонецПопытки;
		//КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		Если НЕ ОбъектыПечати = Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция НВД_ПечатьЗаказПокупателяДляПокупателяСФото(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ЗаказПокупателяДляПокупателяСФото";
	//#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателяДляПокупателяСФото");
	//#КонецВставки
	//#Удаление
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	//#КонецУдаления
	ВыводитьФото = Истина;
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм3(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ТаблицаНеоплаченныеЗаказы = СтруктураДанныхДляПечати.РезультатПоНеоплаченнымЗаказам.Выгрузить();
	ТаблицаНеоплаченныхЗаказов = СтруктураДанныхДляПечати.РезультатПоСпискуНеоплаченныхЗаказов.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	СоответствияПотолокГарпун = СтруктураДанныхДляПечати.СоответствияПотолокГарпун;
	ТаблицаQRКодовДляОплаты = СтруктураДанныхДляПечати.ТаблицаQRКодовДляОплаты;
	//ДополнитьДаннымиПоМатериалам(ТаблицаДанныеПечати, ТаблицаМатериалы);
	// Изменения размера колоноки, в зависимости от вывода Фото
	Если Не ВыводитьФото Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Фото").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидка = ДанныеПечати.СуммаРучнойСкидки > 0;		
		ЕстьБонусы = ДанныеПечати.СуммаБонусовКСписанию > 0;		
		
		ВставкаСкидок = ?(ЕстьСкидка, "Скидка","");
		ВставкаСкидок = ?(ЕстьБонусы, ВставкаСкидок+"Бонус", ВставкаСкидок);
		
		//ТекстЗаголовка = "Заказ покупателя №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);
		ДатаЗаказа = Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD"); 
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
		//	ТабличныйДокумент,
		//	Макет,
		//	ОбластьМакета,
		//	ДанныеПечати.Ссылка);

		
		
		//Попытка				
		//	//ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка; 
		//	ОбластьМакета.Параметры.НомерЗаказа = НомерЗаказа;
		//	ОбластьМакета.Параметры.ДатаЗаказа = ДатаЗаказа;
		//Исключение
		//КонецПопытки;			
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		ТекстЗаголовка = "УВАЖАЕМЫЙ КЛИЕНТ, ПРОСИМ ПРОВЕРЯТЬ СЧЕТ НА КОРРЕКТНОСТЬ ДАННЫХ ВАШЕГО ЗАКАЗА";	
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка				
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Вывести(ОбластьМакета);
	    Исключение
		КонецПопытки;
				
		////#13343 
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Склад");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		//
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		//#Вставка
		КонтактноеЛицо = "";
		КрайняяДатаОтгрузки = "";
		АдресДоставки = "";
		Комментарий = ""; 
		ОжидаемаяДатаОтгрузки = "";
		МассивСсылокНаДоставки = НВД_ОбщийМодульСервер.ПолучитьМассивСсылокНаДоставки(ДанныеПечати.Ссылка);
		//берем данные только из первого документв Доставки, так как предполагается, что к одному заказу клиента может быть привязана 1 доставка
		Если МассивСсылокНаДоставки.Количество() > 0 И МассивСсылокНаДоставки[0].Результат <> Справочники.СтатусыЗаявокНаДоставку.Отказ И МассивСсылокНаДоставки[0].Проведен Тогда
			ЗаявкаНаДоставку = МассивСсылокНаДоставки[0];
			Попытка 
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ТелефонКонтактногоЛица) Тогда					
					КонтактноеЛицо = "" + ЗаявкаНаДоставку.ТелефонКонтактногоЛица;
				ИначеЕсли ЗначениеЗаполнено(ЗаявкаНаДоставку.НВД_КонтактноеЛицо) Тогда					
					КонтактноеЛицо = "" + ЗаявкаНаДоставку.НВД_КонтактноеЛицо.Наименование + "" + НВД_ОбщийМодульСервер.ПолучитьТелефонКонтактногоЛица(ЗаявкаНаДоставку.НВД_КонтактноеЛицо);
				КонецЕсли;	
			Исключение
			КонецПопытки;					
			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки) ИЛИ ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки) Тогда
					//ОбластьМакета.Параметры.ОжидаемаяДатаОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=dd.MM.yy; ДЛФ=D");
					//ОбластьМакета.Параметры.ОжидаемоеВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=HH.mm; ДЛФ=T");
					КрайняяДатаОтгрузки = "" + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ='dd.MM.yy HH:00'") + " - " + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки + 3600, "ДФ='HH:00'");
					//ОбластьМакета.Параметры.КрайнееВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ=HH.mm; ДЛФ=T");
				КонецЕсли;
			Исключение
			КонецПопытки;

			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.АдресДоставки) Тогда
					АдресДоставки = "" + ЗаявкаНаДоставку.Город + " " + ЗаявкаНаДоставку.АдресДоставки;
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.Комментарий) Тогда
				Комментарий = ДанныеПечати.Комментарий;
			КонецЕсли;	
		Исключение
		КонецПопытки;
		//#КонецВставки
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКрупный2"); 
			ОбластьМакета.Параметры.НомерЗаказа = НомерЗаказа;
			ОбластьМакета.Параметры.ДатаЗаказа = ДатаЗаказа; 
			ОбластьМакета.Параметры.Контрагент = ДанныеПечати.Ссылка.Контрагент;
			ОбластьМакета.Параметры.Склад = ДанныеПечати.Склад;
			ОбластьМакета.Параметры.КонтактноеЛицо = КонтактноеЛицо;
			ОбластьМакета.Параметры.КрайняяДатаОтгрузки = КрайняяДатаОтгрузки;
			ОбластьМакета.Параметры.АдресДоставки = АдресДоставки;
			ОбластьМакета.Параметры.Комментарий = Комментарий;
			ТабличныйДокумент.Вывести(ОбластьМакета);	
		Исключение
		КонецПопытки; 
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьФото Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Фото"); 
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
		ВариантФормированияПФЗаказаПокупателя = Константы.ВариантФормированияПФЗаказаПокупателя.Получить();
		
		МассивДопРеквизитов = Новый Массив;
		//МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Фото", 			    Новый ОписаниеТипов("Строка")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Скидка", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "СуммаБезСкидки", 		Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));
		
		//МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Ячейка", 	            Новый ОписаниеТипов("Строка")));
		
		ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказПокупателя", "Товары", МассивДопРеквизитов);
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		
		СоответствиеНомеровСтрокПотолков = Новый Соответствие;
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 1;
					ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
					СоответствиеНомеровСтрокПотолков.Вставить(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.НомерСтрокиПотолка);
					ТекущаяСтрока.ЭтоПотолок = Истина;
					
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 3;
				Иначе
					ТекущаяСтрока.ВидНоменклатуры = 2;
				КонецЕсли;
				Если ТекущаяСтрока.Потолок.Пустая() Тогда
					ТекущаяСтрока.ЕстьПотолок = 2;
				Иначе
					ТекущаяСтрока.ЕстьПотолок = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		Если ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4 Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
				Если НЕ СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок) = Неопределено Тогда
					ТекущаяСтрока.НомерСтрокиПотолка = СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок);
				Иначе
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//4. Потолок - товар - услуга - ПОДЫТОГ - потолок - товар - услуга - ПОДЫТОГ
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются)
		//3. Без сортировки
		Если ВариантФормированияПФЗаказаПокупателя = 0 Тогда
			//#11059
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 4 Тогда			
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("АдресМонтажа, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, СуммаРучнойСкидки, ВидНоменклатуры", "Вес, Количество, Сумма");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 3 Тогда	
			//не сортируем
		КонецЕсли;
		
		ИтогоВес = 0;
		Сумма = 0;
		НомерСтроки = 1;
		
		СуммаПодытог = 0;
		ВесПодытог = 0;
		
		ТекНомерСтрокиПотолка = 1; 
		
		ТаблицаТоварыИУслуги.Колонки.Добавить("Гарпун");
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл
			Если ЗначениеЗаполнено(Товары.Номенклатура) Тогда
				Гарпун = СоответствияПотолокГарпун.Получить(Товары.Номенклатура);
				Если Гарпун <> Неопределено Тогда
					Товары.Гарпун = Гарпун; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл //Шапка.Товары Цикл
			Попытка
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|НомерСтроки");
				
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьФото Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Фото");
					Если НЕ Товары.Номенклатура.ФайлКартинки.Пустая() Тогда	
						ДвоичныеДанныеФайла = Товары.Номенклатура.ФайлКартинки.ФайлХранилище.Получить();
						Картинка = Новый Картинка(ДвоичныеДанныеФайла);
		            	ОбластьМакета.Параметры.Фото = Картинка;
					КонецЕсли;					
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Данные");
				ОбластьМакета.Параметры.Заполнить(Товары);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры);
				//-- №12909
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И НЕ Товары.ЭтоПотолок 
					И Товары.ЕстьПотолок = 1 Тогда
					ПредставлениеНоменклатуры = "    " + ПредставлениеНоменклатуры;	
				КонецЕсли;
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И Товары.ВидНоменклатуры = 1 Тогда
					//ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				КонецЕсли;
				
				//Вес = Товары.Вес * Товары.Количество;
				//Попытка
				//	ОбластьМакета.Параметры.Вес = Вес;
				//Исключение
				//КонецПопытки;
				
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;
				
				ИтогоВес = ИтогоВес + Товары.Вес;
				Сумма = Сумма + Товары.Сумма;
			Исключение
			КонецПопытки;
			
			Если ВариантФормированияПФЗаказаПокупателя = 4 Тогда
				ТребуетсяВыводПодытога = Ложь;
				Если Товары.ЕстьПотолок = 1 Тогда
					Если ТаблицаТоварыИУслуги.Индекс(Товары)+1 = ТаблицаТоварыИУслуги.Количество() Тогда // последняя строка
						ТребуетсяВыводПодытога = Истина;
					Иначе
						СледующаяСТрокаТЗ = ТаблицаТоварыИУслуги[ТаблицаТоварыИУслуги.Индекс(Товары)+1];
						Если НЕ СледующаяСТрокаТЗ.НомерСтрокиПотолка = Товары.НомерСтрокиПотолка Тогда
							ТребуетсяВыводПодытога = Истина;
							ТекНомерСтрокиПотолка = СледующаяСТрокаТЗ.НомерСтрокиПотолка;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ВесПодытог   = ВесПодытог + Товары.Вес;
				СуммаПодытог = СуммаПодытог + Товары.Сумма;
				
				Если ТребуетсяВыводПодытога Тогда
					
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьФото Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Фото");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Товары);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;	
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ОбластьМакета.Параметры.Сумма = СуммаПодытог;
						ОбластьМакета.Параметры.Вес   = ВесПодытог;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
					Исключение
					КонецПопытки;
					
					СуммаПодытог = 0;
					ВесПодытог = 0;
				Иначе
					//ВесПодытог   = ВесПодытог + Вес;
					//СуммаПодытог = СуммаПодытог + Товары.Сумма;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
		
		Попытка
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|НомерСтроки"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьФото Тогда
				ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Фото"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Фото"));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Данные"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС И ДанныеПечати.ИтогоСуммаНДС = 0 Тогда			
					ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
				КонецЕсли;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;		
		
		
		// #13343 		
		Если ЗначениеЗаполнено(ДанныеПечати.Примечание) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Примечание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли; 
		
		Попытка
			//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"); 
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьАкция");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("Внимание2");
		//	Долг = ДанныеПечати.ТекущийДолг;
		//	Если Не ЗначениеЗаполнено(Долг) Тогда
		//		ОбластьМакета.Параметры.ДолгКлиента = "Долгов между исполнителем и заказчиком нет.";
		//	ИначеЕсли Долг < 0 Тогда
		//		Долг = Долг * (-1);
		//		ОбластьМакета.Параметры.ДолгКлиента = "Депозит клиента составляет " + Долг + " рублей.";
		//	Иначе
		//		ОбластьМакета.Параметры.ДолгКлиента = "Долг клиента составляет " + Долг + " рублей.";
		//	КонецЕсли;	
		//		
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		//Попытка
		//	ОбластьМакета = Макет.ПолучитьОбласть("МенеджерСделки");
		//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//Исключение
		//КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		//СтруктураПоиска = Новый Структура("Заказ", ДанныеПечати.Ссылка);		
		//НайденныеСтрокиТаблицыQRКодовДляОплаты = ТаблицаQRКодовДляОплаты.НайтиСтроки(СтруктураПоиска);
		//Если НайденныеСтрокиТаблицыQRКодовДляОплаты.Количество() > 0 Тогда
		//	Для Каждого СтрокаQRКода Из НайденныеСтрокиТаблицыQRКодовДляОплаты Цикл
		//		Попытка 
		//			Данные = СтрокаQRКода.imageParams_content.Получить();
		//			ДД = Base64Значение(Данные);
		//			КартинкаQR = Новый Картинка(ДД, Ложь);
		//			ОбластьМакета = Макет.ПолучитьОбласть("QRКод");
		//			ОбластьМакета.Рисунки["КартинкаQRКодаНаОплату"].Картинка = КартинкаQR;
		//			ТабличныйДокумент.Вывести(ОбластьМакета);
		//		Исключение
		//		КонецПопытки;
		//	КонецЦикла;	
		//КонецЕсли;
		
		//СтруктураПоиска = Новый Структура("Контрагент", ДанныеПечати.Ссылка.Контрагент);		
		//НайденныеСтрокиТаблицыНеоплаченныхЗаказов = ТаблицаНеоплаченныхЗаказов.НайтиСтроки(СтруктураПоиска);
		//Если НайденныеСтрокиТаблицыНеоплаченныхЗаказов.Количество() > 0 Тогда
		//	//шапка
		//	Попытка
		//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|НомерСтроки");
		//		ТабличныйДокумент.Вывести(ОбластьМакета);
		//		
		//		Если ВыводитьАртикул Тогда
		//			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|Артикул");
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//		КонецЕсли;	
		//		
		//		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыНеоплаченныхЗаказов|Данные");
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);
		//	Исключение
		//	КонецПопытки;
		//	
		//	Попытка 
		//		
		//		ИтогоСуммаНеоплаченныхЗаказов = 0;
		//		Для Каждого НеоплаченныйЗаказ Из НайденныеСтрокиТаблицыНеоплаченныхЗаказов Цикл
		//				
		//			СуммаНеоплаченныхЗаказов = НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа;
		//			
		//			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|НомерСтроки");
		//			ТабличныйДокумент.Вывести(ОбластьМакета);
		//			
		//			Если ВыводитьАртикул Тогда
		//				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|Артикул");
		//				ТабличныйДокумент.Присоединить(ОбластьМакета);
		//			КонецЕсли;	
		//			
		//			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыНеоплаченныхЗаказов|Данные");
		//			ОбластьМакета.Параметры.ДатаЗаказа = Формат(НеоплаченныйЗаказ.ДатаЗаказа, "ДФ=dd.MM.yyyy");
		//			ОбластьМакета.Параметры.НомерЗаказа = Формат(НеоплаченныйЗаказ.НомерЗаказа, "ЧФ=Ч"); 
		//			ОбластьМакета.Параметры.СуммаНеоплаченныхЗаказов = НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа;
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//			ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов + НеоплаченныйЗаказ.СуммаНеоплаченногоЗаказа
		//			
		//		КонецЦикла;

		//	
		//	
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|НомерСтроки");
		//		ТабличныйДокумент.Вывести(ОбластьМакета);
		//		
		//		Если ВыводитьАртикул Тогда
		//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Артикул");
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//		КонецЕсли;	
		//		
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Данные");
		//		ОбластьМакета.Параметры.ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов;
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);

		//	Исключение
		//		
		//	КонецПопытки;
		//КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		Если НЕ ОбъектыПечати = Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции


Функция НВД_ПечатьЗаказПокупателяДляСклада(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ЗаказПокупателяДляСклада";
	//#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателяДляСклада");
	//#КонецВставки
	//#Удаление
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	//#КонецУдаления
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм3(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить();
	ТаблицаНеоплаченныеЗаказы = СтруктураДанныхДляПечати.РезультатПоНеоплаченнымЗаказам.Выгрузить();
	ТаблицаНеоплаченныхЗаказов = СтруктураДанныхДляПечати.РезультатПоСпискуНеоплаченныхЗаказов.Выгрузить(); 
	ТаблицаПеремещенийНаОснованииЗаказов = СтруктураДанныхДляПечати.РезультатПоСпискуПеремещенийНаОснованииЗаказа.Выгрузить();
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	СоответствияПотолокГарпун = СтруктураДанныхДляПечати.СоответствияПотолокГарпун;
	ТаблицаQRКодовДляОплаты = СтруктураДанныхДляПечати.ТаблицаQRКодовДляОплаты;
	//ДополнитьДаннымиПоМатериалам(ТаблицаДанныеПечати, ТаблицаМатериалы);
	// Изменения размера колоноки, в зависимости от вывода Артикула
	Если Не ВыводитьАртикул Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидка = ДанныеПечати.СуммаРучнойСкидки > 0;		
		ЕстьБонусы = ДанныеПечати.СуммаБонусовКСписанию > 0;		
		
		ВставкаСкидок = ?(ЕстьСкидка, "Скидка","");
		ВставкаСкидок = ?(ЕстьБонусы, ВставкаСкидок+"Бонус", ВставкаСкидок);
		
		//ТекстЗаголовка = "Заказ покупателя №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер);
		ДатаЗаказа = Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");  
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
			ТабличныйДокумент,
			Макет,
			ОбластьМакета,
			ДанныеПечати.Ссылка);	
		ТекстЗаголовка = "СЧЕТ ДЛЯ СКЛАДА";	
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Приоритет = ДанныеПечати.Ссылка.Контрагент.Приоритет.Наименование;
			Попытка		
				ОбластьМакета.Параметры.Приоритет = Приоритет;
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Вывести(ОбластьМакета);
	    Исключение
		КонецПопытки;

		
		КонтактноеЛицо = "";
		КрайняяДатаОтгрузки = "";
		АдресДоставки = "";
		Комментарий = "";
		СостояниеОплаты = "";
		МассивСсылокНаДоставки = НВД_ОбщийМодульСервер.ПолучитьМассивСсылокНаДоставки(ДанныеПечати.Ссылка);
		//берем данные только из первого документв Доставки, так как предполагается, что к одному заказу клиента может быть привязана 1 доставка
		Если МассивСсылокНаДоставки.Количество() > 0 И МассивСсылокНаДоставки[0].Результат <> Справочники.СтатусыЗаявокНаДоставку.Отказ И МассивСсылокНаДоставки[0].Проведен Тогда
			ЗаявкаНаДоставку = МассивСсылокНаДоставки[0];
			Попытка 
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ТелефонКонтактногоЛица) Тогда					
					КонтактноеЛицо = "" + ЗаявкаНаДоставку.ТелефонКонтактногоЛица;
				ИначеЕсли ЗначениеЗаполнено(ЗаявкаНаДоставку.НВД_КонтактноеЛицо) Тогда					
					КонтактноеЛицо = "" + ЗаявкаНаДоставку.НВД_КонтактноеЛицо.Наименование + "" + НВД_ОбщийМодульСервер.ПолучитьТелефонКонтактногоЛица(ЗаявкаНаДоставку.НВД_КонтактноеЛицо);
				КонецЕсли;	
			Исключение
			КонецПопытки;					
			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки) ИЛИ ЗначениеЗаполнено(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки) Тогда
					//ОбластьМакета.Параметры.ОжидаемаяДатаОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=dd.MM.yy; ДЛФ=D");
					//ОбластьМакета.Параметры.ОжидаемоеВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаОтправки, "ДФ=HH.mm; ДЛФ=T");
					КрайняяДатаОтгрузки = "" + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ='dd.MM.yy HH:00'") + " - " + Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки + 3600, "ДФ='HH:00'");
					//ОбластьМакета.Параметры.КрайнееВремяОтгрузки = Формат(ЗаявкаНаДоставку.ОжидаемаяДатаДоставки, "ДФ=HH.mm; ДЛФ=T");
				КонецЕсли
			Исключение
			КонецПопытки;

			Попытка
				Если ЗначениеЗаполнено(ЗаявкаНаДоставку.АдресДоставки) Тогда
					АдресДоставки = "" + ЗаявкаНаДоставку.Город + " " + ЗаявкаНаДоставку.АдресДоставки;
				КонецЕсли;	
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			Если НЕ ЗначениеЗаполнено(КрайняяДатаОтгрузки) И ЗначениеЗаполнено(ДанныеПечати.Ссылка.ОжидаемаяДатаОтгрузки) Тогда
				КрайняяДатаОтгрузки = "" + Формат(ДанныеПечати.Ссылка.ОжидаемаяДатаОтгрузки, "ДФ='dd.MM.yy'")
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.Комментарий) Тогда
				Комментарий = ДанныеПечати.Комментарий;
			КонецЕсли;	
		Исключение
		КонецПопытки;   
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.ОжидаемаяДатаОтгрузки) Тогда
				ОжидаемаяДатаОтгрузки = ДанныеПечати.ОжидаемаяДатаОтгрузки;
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.СостояниеОплаты) Тогда
				СостояниеОплаты = ДанныеПечати.СостояниеОплаты;
			КонецЕсли;	
		Исключение
		КонецПопытки;
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокКрупный2");
			ОбластьМакета.Параметры.НомерЗаказа = НомерЗаказа;
			ОбластьМакета.Параметры.ДатаЗаказа = ДатаЗаказа;
			ОбластьМакета.Параметры.Контрагент = ДанныеПечати.Ссылка.Контрагент;
			ОбластьМакета.Параметры.Склад = ДанныеПечати.Склад;
			ОбластьМакета.Параметры.КонтактноеЛицо = КонтактноеЛицо;
			ОбластьМакета.Параметры.КрайняяДатаОтгрузки = КрайняяДатаОтгрузки;
			ОбластьМакета.Параметры.АдресДоставки = АдресДоставки;
			ОбластьМакета.Параметры.Комментарий = Комментарий;
			//ОбластьМакета.Параметры.ОжидаемаяДатаОтгрузки = ОжидаемаяДатаОтгрузки;
			ОбластьМакета.Параметры.СостояниеОплаты	 = СостояниеОплаты;
			ТабличныйДокумент.Вывести(ОбластьМакета);	
		Исключение
		КонецПопытки; 
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
		//ВариантФормированияПФЗаказаПокупателя = Константы.ВариантФормированияПФЗаказаПокупателя.Получить();
		ВариантФормированияПФЗаказаПокупателя = 1;
		
		МассивДопРеквизитов = Новый Массив;
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Скидка", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "СуммаБезСкидки", 		Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Ячейка", 	            Новый ОписаниеТипов("Строка")));
		
		ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказПокупателя", "Товары", МассивДопРеквизитов);
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		
		СоответствиеНомеровСтрокПотолков = Новый Соответствие;
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 1;
					ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
					СоответствиеНомеровСтрокПотолков.Вставить(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.НомерСтрокиПотолка);
					ТекущаяСтрока.ЭтоПотолок = Истина;
					
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 3;
				Иначе
					ТекущаяСтрока.ВидНоменклатуры = 2;
				КонецЕсли;
				Если ТекущаяСтрока.Потолок.Пустая() Тогда
					ТекущаяСтрока.ЕстьПотолок = 2;
				Иначе
					ТекущаяСтрока.ЕстьПотолок = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		Если ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4 Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
				Если НЕ СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок) = Неопределено Тогда
					ТекущаяСтрока.НомерСтрокиПотолка = СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок);
				Иначе
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//4. Потолок - товар - услуга - ПОДЫТОГ - потолок - товар - услуга - ПОДЫТОГ
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются)
		//3. Без сортировки
		Если ВариантФормированияПФЗаказаПокупателя = 0 Тогда
			//#11059
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 4 Тогда			
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("АдресМонтажа, Артикул, Номенклатура, Ячейка, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, СуммаРучнойСкидки, ВидНоменклатуры", "Вес, Количество, Сумма");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 3 Тогда	
			ТаблицаТоварыИУслуги.Сортировать("Ячейка")
		КонецЕсли;
		
		ИтогоВес = 0;
		Сумма = 0;
		НомерСтроки = 1;
		
		СуммаПодытог = 0;
		ВесПодытог = 0;
		
		ТекНомерСтрокиПотолка = 1; 
		
		ТаблицаТоварыИУслуги.Колонки.Добавить("Гарпун");
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл
			Если ЗначениеЗаполнено(Товары.Номенклатура) Тогда
				Гарпун = СоответствияПотолокГарпун.Получить(Товары.Номенклатура);
				Если Гарпун <> Неопределено Тогда
					Товары.Гарпун = Гарпун; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл //Шапка.Товары Цикл
			Попытка
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|НомерСтроки");
				
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Артикул");
					ОбластьМакета.Параметры.Заполнить(Товары);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Данные");
				ОбластьМакета.Параметры.Заполнить(Товары);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры);
				//-- №12909
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И НЕ Товары.ЭтоПотолок 
					И Товары.ЕстьПотолок = 1 Тогда
					ПредставлениеНоменклатуры = "    " + ПредставлениеНоменклатуры;	
				КонецЕсли;
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И Товары.ВидНоменклатуры = 1 Тогда
					//ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				КонецЕсли;
				
				//Вес = Товары.Вес * Товары.Количество;
				//Попытка
				//	ОбластьМакета.Параметры.Вес = Вес;
				//Исключение
				//КонецПопытки;
				
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;
				
				ИтогоВес = ИтогоВес + Товары.Вес;
				Сумма = Сумма + Товары.Сумма;
			Исключение
			КонецПопытки;
			
			Если ВариантФормированияПФЗаказаПокупателя = 4 Тогда
				ТребуетсяВыводПодытога = Ложь;
				Если Товары.ЕстьПотолок = 1 Тогда
					Если ТаблицаТоварыИУслуги.Индекс(Товары)+1 = ТаблицаТоварыИУслуги.Количество() Тогда // последняя строка
						ТребуетсяВыводПодытога = Истина;
					Иначе
						СледующаяСТрокаТЗ = ТаблицаТоварыИУслуги[ТаблицаТоварыИУслуги.Индекс(Товары)+1];
						Если НЕ СледующаяСТрокаТЗ.НомерСтрокиПотолка = Товары.НомерСтрокиПотолка Тогда
							ТребуетсяВыводПодытога = Истина;
							ТекНомерСтрокиПотолка = СледующаяСТрокаТЗ.НомерСтрокиПотолка;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ВесПодытог   = ВесПодытог + Товары.Вес;
				СуммаПодытог = СуммаПодытог + Товары.Сумма;
				
				Если ТребуетсяВыводПодытога Тогда
					
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Товары);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;	
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ОбластьМакета.Параметры.Сумма = СуммаПодытог;
						ОбластьМакета.Параметры.Вес   = ВесПодытог;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
					Исключение
					КонецПопытки;
					
					СуммаПодытог = 0;
					ВесПодытог = 0;
				Иначе
					//ВесПодытог   = ВесПодытог + Вес;
					//СуммаПодытог = СуммаПодытог + Товары.Сумма;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
		
		Попытка
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|НомерСтроки"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Артикул"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Артикул"));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Данные"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС И ДанныеПечати.ИтогоСуммаНДС = 0 Тогда			
					ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
				КонецЕсли;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		СтруктураПоиска = Новый Структура("Заказ", ДанныеПечати.Ссылка);		
		НайденныеСтрокиТаблицыПеремещенийНаОснованииЗаказов = ТаблицаПеремещенийНаОснованииЗаказов.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтрокиТаблицыПеремещенийНаОснованииЗаказов.Количество() > 0 Тогда
			//шапка
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПеремещения|НомерСтроки");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПеремещения|Артикул");
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;	
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПеремещения|Данные");
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			Исключение
			КонецПопытки;
			
			Попытка 
				
				НомерПоПорядку = 1;
				Для Каждого Перемещение Из НайденныеСтрокиТаблицыПеремещенийНаОснованииЗаказов Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыПеремещения|НомерСтроки");
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Если ВыводитьАртикул Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыПеремещения|Артикул");
						ТабличныйДокумент.Присоединить(ОбластьМакета);
					КонецЕсли;	
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыПеремещения|Данные");
					ОбластьМакета.Параметры.ДатаПеремещения = Формат(Перемещение.Дата, "ДФ=dd.MM.yyyy");
					ОбластьМакета.Параметры.НомерПеремещения = Формат(Перемещение.Номер, "ЧФ=Ч"); 
					ОбластьМакета.Параметры.НомерСтроки = НомерПоПорядку;
					ОбластьМакета.Параметры.СтатусПеремещения = Перемещение.ТекущийСтатус;
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					НомерПоПорядку = НомерПоПорядку + 1;
					
				КонецЦикла;

		//	
		//	
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|НомерСтроки");
		//		ТабличныйДокумент.Вывести(ОбластьМакета);
		//		
		//		Если ВыводитьАртикул Тогда
		//			ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Артикул");
		//			ТабличныйДокумент.Присоединить(ОбластьМакета);
		//		КонецЕсли;	
		//		
		//		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоТаблицыНеоплаченныхЗаказов|Данные");
		//		ОбластьМакета.Параметры.ИтогоСуммаНеоплаченныхЗаказов = ИтогоСуммаНеоплаченныхЗаказов;
		//		ТабличныйДокумент.Присоединить(ОбластьМакета);

			Исключение
				
			КонецПопытки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПечати.Примечание) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Примечание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли; 
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
				
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки; 
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		Если НЕ ОбъектыПечати = Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	
	// Нумерация страниц в нижнем колонтитуле в формате "ТекущаяСтраница/ВсегоСтраниц" (например, 1/3, 2/3, 3/3).
	// Колонтитул выводится, только если документ не умещается на одном листе.
	Если ТабличныйДокумент.КоличествоСтраниц() > 1 Тогда
		ТабличныйДокумент.НижнийКолонтитул.Выводить    = Истина;
		ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы]/[&СтраницВсего]";

		// Увеличиваем шрифт колонтитула в полтора раза.
		ШрифтКолонтитула     = ТабличныйДокумент.НижнийКолонтитул.Шрифт;
		ИсходныйРазмерШрифта = ?(ШрифтКолонтитула <> Неопределено И ЗначениеЗаполнено(ШрифтКолонтитула.Размер), ШрифтКолонтитула.Размер, 8);
		Если ШрифтКолонтитула = Неопределено Тогда
			ТабличныйДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Arial", ИсходныйРазмерШрифта * 3);
		Иначе
			ТабличныйДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт(ШрифтКолонтитула, , ИсходныйРазмерШрифта * 3);
		КонецЕсли;
	КонецЕсли;	
	Возврат ТабличныйДокумент;
	
КонецФункции



&ИзменениеИКонтроль("ПечатьЗаказПокупателя")
Функция НВД_ПечатьЗаказПокупателя(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТоварнаяНакладнаяСВесом";
	#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателя");
	#КонецВставки
	#Удаление
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	#КонецУдаления
	ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	
	СтруктураДанныхДляПечати = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	ТаблицаДанныеПечати = СтруктураДанныхДляПечати.РезультатПоШапке.Выгрузить(); 
	ВыборкаПоТоварам = СтруктураДанныхДляПечати.РезультатПоТабличнойЧастиТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДополнитьДанныеДляПечатныхФорм(ТаблицаДанныеПечати, ВыборкаПоТоварам);
	
	// Изменения размера колоноки, в зависимости от вывода Артикула
	Если Не ВыводитьАртикул Тогда
		Попытка
			Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ТаблицаДанныеПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьСкидка = ДанныеПечати.СуммаРучнойСкидки > 0;		
		ЕстьБонусы = ДанныеПечати.СуммаБонусовКСписанию > 0;		
		
		ВставкаСкидок = ?(ЕстьСкидка, "Скидка","");
		ВставкаСкидок = ?(ЕстьБонусы, ВставкаСкидок+"Бонус", ВставкаСкидок);
		
		ТекстЗаголовка = "Заказ покупателя №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.ДатаДокумента, "ДЛФ=DD");
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка				
				ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Исключение
			КонецПопытки;
			
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
			ТабличныйДокумент,
			Макет,
			ОбластьМакета,
			ДанныеПечати.Ссылка);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Организация");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		#Вставка     
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.АдресМонтажа) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("АдресДоставки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.ВремяСамовывоза) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ВремяСамовывоза");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.Курьер) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Курьер");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		Попытка
			Если ЗначениеЗаполнено(ДанныеПечати.ОжидаемаяДатаОтгрузки) ИЛИ ЗначениеЗаполнено(ДанныеПечати.КрайняяДатаОтгрузки) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ДатаДоставки");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		Исключение
		КонецПопытки;
		#КонецВставки
		
		//#13343 
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		//#13343
		#Удаление
		Если ЗначениеЗаполнено(ДанныеПечати.АдресМонтажа) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("АдресМонтажа");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		#КонецУдаления
		//// Изменения размера колоноки, в зависимости от вывода Артикула
		//Если Не ВыводитьАртикул Тогда
		//	Попытка
		//		Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки = Макет.Область("ПерваяКолонкаТовара").ШиринаКолонки + Макет.Область("Артикул").ШиринаКолонки;
		//	Исключение
		//	КонецПопытки;
		//КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|НомерСтроки");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Артикул");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы"+ВставкаСкидок+"|Данные");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
		Исключение
		КонецПопытки;
		
		// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
		ВариантФормированияПФЗаказаПокупателя = Константы.ВариантФормированияПФЗаказаПокупателя.Получить();
		
		МассивДопРеквизитов = Новый Массив;
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Артикул", 			Новый ОписаниеТипов("Строка")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Вес", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "Скидка", 				Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "СуммаБезСкидки", 		Новый ОписаниеТипов("Число")));
		
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ВидНоменклатуры", 	Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЕстьПотолок", 		Новый ОписаниеТипов("Число")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "ЭтоПотолок", 			Новый ОписаниеТипов("Булево")));
		МассивДопРеквизитов.Добавить(Новый Структура("Имя, Тип", "НомерСтрокиПотолка", 	Новый ОписаниеТипов("Число")));
		
		ТаблицаТоварыИУслуги = ОбщийМодульСервер.ТаблицаЗначенийПоТабличнойЧастиОбъекта("ЗаказПокупателя", "Товары", МассивДопРеквизитов);
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);		
		ВыборкаПоТоварам.Сбросить();
		
		СоответствиеНомеровСтрокПотолков = Новый Соответствие;
		Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда			
			Выборка = ВыборкаПоТоварам.Выбрать();			
			Пока Выборка.Следующий() Цикл
				ТекущаяСтрока = ТаблицаТоварыИУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 1;
					ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
					СоответствиеНомеровСтрокПотолков.Вставить(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.НомерСтрокиПотолка);
					ТекущаяСтрока.ЭтоПотолок = Истина;
					
				ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
					ТекущаяСтрока.ВидНоменклатуры = 3;
				Иначе
					ТекущаяСтрока.ВидНоменклатуры = 2;
				КонецЕсли;
				Если ТекущаяСтрока.Потолок.Пустая() Тогда
					ТекущаяСтрока.ЕстьПотолок = 2;
				Иначе
					ТекущаяСтрока.ЕстьПотолок = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		Если ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4 Тогда
			Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
				Если НЕ СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок) = Неопределено Тогда
					ТекущаяСтрока.НомерСтрокиПотолка = СоответствиеНомеровСтрокПотолков.Получить(ТекущаяСтрока.Потолок);
				Иначе
					ТекущаяСтрока.НомерСтрокиПотолка = ТекущаяСтрока.НомерСтроки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//0. Потолок - товар - услуга - потолок - товар - услуга
		//4. Потолок - товар - услуга - ПОДЫТОГ - потолок - товар - услуга - ПОДЫТОГ
		//1. Потолок, Потолок, Товары, Товары, услуги, услуги
		//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются)
		//3. Без сортировки
		Если ВариантФормированияПФЗаказаПокупателя = 0 Тогда
			//#11059
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 4 Тогда			
			//ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
			ТаблицаТоварыИУслуги.Сортировать("НомерСтрокиПотолка, ЭтоПотолок Убыв, НомерСтроки");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 1 Тогда
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 2 Тогда
			ТаблицаТоварыИУслуги.Свернуть("АдресМонтажа, Артикул, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, СуммаРучнойСкидки, ВидНоменклатуры", "Вес, Количество, Сумма");
			ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
		ИначеЕсли ВариантФормированияПФЗаказаПокупателя = 3 Тогда	
			//не сортируем
		КонецЕсли;
		
		ИтогоВес = 0;
		Сумма = 0;
		НомерСтроки = 1;
		
		СуммаПодытог = 0;
		ВесПодытог = 0;
		
		ТекНомерСтрокиПотолка = 1;
		
		Для каждого Товары из ТаблицаТоварыИУслуги Цикл //Шапка.Товары Цикл
			Попытка
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|НомерСтроки");
				
				ОбластьМакета.Параметры.Заполнить(Товары);
				ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ВыводитьАртикул Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Артикул");
					ОбластьМакета.Параметры.Заполнить(Товары);
					ТабличныйДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка"+ВставкаСкидок+"|Данные");
				ОбластьМакета.Параметры.Заполнить(Товары);
				
				//++ №12909
				//ПредставлениеНоменклатуры = Строка(Товары.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(Товары.ХарактеристикаНоменклатуры));
				ПредставлениеНоменклатуры = ОбщийМодульСервер.ПредставлениеНоменклатурыДляПечати(Товары.Номенклатура, Товары.ХарактеристикаНоменклатуры);
				//-- №12909
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И НЕ Товары.ЭтоПотолок 
					И Товары.ЕстьПотолок = 1 Тогда
					ПредставлениеНоменклатуры = "    " + ПредставлениеНоменклатуры;	
				КонецЕсли;
				ОбластьМакета.Параметры.Номенклатура = ПредставлениеНоменклатуры;
				
				Если (ВариантФормированияПФЗаказаПокупателя = 0 ИЛИ ВариантФормированияПФЗаказаПокупателя = 4)
					И Товары.ВидНоменклатуры = 1 Тогда
					//ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,4,1,4);
					ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
					ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
					ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
				КонецЕсли;
				
				//Вес = Товары.Вес * Товары.Количество;
				//Попытка
				//	ОбластьМакета.Параметры.Вес = Вес;
				//Исключение
				//КонецПопытки;
				
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				НомерСтроки = НомерСтроки + 1;
				
				ИтогоВес = ИтогоВес + Товары.Вес;
				Сумма = Сумма + Товары.Сумма;
			Исключение
			КонецПопытки;
			
			Если ВариантФормированияПФЗаказаПокупателя = 4 Тогда
				ТребуетсяВыводПодытога = Ложь;
				Если Товары.ЕстьПотолок = 1 Тогда
					Если ТаблицаТоварыИУслуги.Индекс(Товары)+1 = ТаблицаТоварыИУслуги.Количество() Тогда // последняя строка
						ТребуетсяВыводПодытога = Истина;
					Иначе
						СледующаяСТрокаТЗ = ТаблицаТоварыИУслуги[ТаблицаТоварыИУслуги.Индекс(Товары)+1];
						Если НЕ СледующаяСТрокаТЗ.НомерСтрокиПотолка = Товары.НомерСтрокиПотолка Тогда
							ТребуетсяВыводПодытога = Истина;
							ТекНомерСтрокиПотолка = СледующаяСТрокаТЗ.НомерСтрокиПотолка;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ВесПодытог   = ВесПодытог + Товары.Вес;
				СуммаПодытог = СуммаПодытог + Товары.Сумма;
				
				Если ТребуетсяВыводПодытога Тогда
					
					Попытка
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|НомерСтроки");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Если ВыводитьАртикул Тогда
							ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Артикул");
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(Товары);
							ТабличныйДокумент.Присоединить(ОбластьМакета);
						КонецЕсли;	
						
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПодытог"+ВставкаСкидок+"|Данные");
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(Товары);
						ОбластьМакета.Параметры.Сумма = СуммаПодытог;
						ОбластьМакета.Параметры.Вес   = ВесПодытог;
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
					Исключение
					КонецПопытки;
					
					СуммаПодытог = 0;
					ВесПодытог = 0;
				Иначе
					//ВесПодытог   = ВесПодытог + Вес;
					//СуммаПодытог = СуммаПодытог + Товары.Сумма;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПрефиксОбласти = ?(ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС, "ИтогоНДС", "Итого");
		
		Попытка
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|НомерСтроки"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|НомерСтроки"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если ВыводитьАртикул Тогда
				ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Артикул"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Артикул"));
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Присоединить(ОбластьМакета);
			КонецЕсли;	
			
			ОбластьМакета = ?(НЕ ЕстьСкидка, Макет.ПолучитьОбласть(ПрефиксОбласти + "|Данные"), Макет.ПолучитьОбласть(ПрефиксОбласти + "Скидка|Данные"));
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				Если ДанныеПечати.ОрганизацияЯвляетсяПлательщикомНДС И ДанныеПечати.ИтогоСуммаНДС = 0 Тогда			
					ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
				КонецЕсли;
			Исключение
			КонецПопытки;
			ТабличныйДокумент.Присоединить(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка 
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			Попытка
				ОбластьМакета.Параметры.СуммаДокументаПрописью = 
				РаботаСВалютой.СформироватьЧислоПрописьюВсп(ДанныеПечати.СуммаДокумента, ДанныеПечати.Валюта, "Л=ru_RU;ДП=Ложь");
			Исключение
			КонецПопытки;		
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// #13343 		
		Если ЗначениеЗаполнено(ДанныеПечати.Примечание) Тогда
			Попытка
				ОбластьМакета = Макет.ПолучитьОбласть("Примечание");
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати комплектов документов.
		Если НЕ ОбъектыПечати = Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	Возврат ТабличныйДокумент;
	
КонецФункции

&Вместо("ПолучитьДанныеДляПечатныхФорм")
Функция НВД_ПолучитьДанныеДляПечатныхФорм(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.НастройкаИнтеркампани КАК НастройкаИнтеркампани
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеРегистра.Заказ КАК Ссылка,
	|	ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) КАК Оплачено,
	|	ЕСТЬNULL(ДанныеРегистра.СуммаПриход, 0) - ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) КАК КОплате,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) = 0
	|				ИЛИ ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) = 0
	|			ТОГДА ""НЕ ОПЛАЧЕН""
	|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) = ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0)
	|				И ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) > 0
	|			ТОГДА ""ОПЛАЧЕН""
	|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) < ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0)
	|				И ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) > 0
	|			ТОГДА ""ЧАСТ. ОПЛАЧЕН""
	|		ИНАЧЕ ""НЕ ОПЛАЧЕН""
	|	КОНЕЦ КАК СостояниеОплаты
	|ПОМЕСТИТЬ ВТ_СостоянияОплатыЗаказов
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Обороты(, , , Заказ В (&МассивОбъектов)) КАК ДанныеРегистра
	|		ПО ВТ_Заказы.Ссылка = ДанныеРегистра.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	""01.01.0001"" КАК Дата,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидЦен КАК ВидЦен,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Организация.ПолноеНаименование = """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
	|	ДанныеДокумента.БанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
	|	ДанныеДокумента.БанковскийСчет.БИК КАК БанковскийСчетБИК,
	|	ДанныеДокумента.БанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
	|	ДанныеДокумента.БанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
	|	ДанныеДокумента.ИнтернетОплатаСсылка КАК ИнтернетОплатаСсылка,
	|	ДанныеДокумента.ИнтернетОплатаНомерТелефонаПлательщика КАК ИнтернетОплатаНомерТелефонаПлательщика,
	|	ДанныеДокумента.ИнтернетОплатаЭлектроннаяПочтаПлательщика КАК ИнтернетОплатаЭлектроннаяПочтаПлательщика,
	|	ДанныеДокумента.Организация.ИНН КАК ИНН,
	|	ДанныеДокумента.Организация.КПП КАК КПП,
	|	ДанныеДокумента.Организация.Руководитель КАК ОрганизацияРуководитель,
	|	ДанныеДокумента.Организация.ГлавныйБухгалтер КАК ОрганизацияГлавныйБухгалтер,
	|	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДанныеДокумента.Организация.ЯвляетсяПлательщикомНДС КАК ОрганизацияЯвляетсяПлательщикомНДС,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.СуммаБонусовКСписаниюПоДисконтнойКарте КАК СуммаБонусовКСписанию,
	|	""текст расшифровки НДС"" КАК НДС,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСуммаБезНДС,
	|	0 КАК СуммаРучнойСкидки,
	|	0 КАК Скидка,
	|	0 КАК ИтогоВес,
	|	0 КАК Вес,
	|	0 КАК Сумма,
	|	0 КАК КолвоПозиций,
	|	ДанныеДокумента.НВД_ВидОтгрузки КАК ВидОтгрузки,
	|	ПОДСТРОКА(""0123456789"", ДЕНЬ(ДанныеДокумента.НВД_ДатаСамовывоза) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ДанныеДокумента.НВД_ДатаСамовывоза))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ДанныеДокумента.НВД_ДатаСамовывоза) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ДанныеДокумента.НВД_ДатаСамовывоза))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ДанныеДокумента.НВД_ДатаСамовывоза) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ДанныеДокумента.НВД_ДатаСамовывоза) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ДанныеДокумента.НВД_ДатаСамовывоза) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ДанныеДокумента.НВД_ДатаСамовывоза) * 6)) / 6 + 1, 1) КАК ДатаСамовывоза,
	|	ПОДСТРОКА(""0123456789"", ЧАС(ДанныеДокумента.НВД_ВремяСамовывоза) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ЧАС(ДанныеДокумента.НВД_ВремяСамовывоза))) / 6 + 1, 1) + "":"" + ПОДСТРОКА(""0123456789"", МИНУТА(ДанныеДокумента.НВД_ВремяСамовывоза) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МИНУТА(ДанныеДокумента.НВД_ВремяСамовывоза))) / 6 + 1, 1) КАК ВремяСамовывоза,
	|	ДанныеДокумента.НВД_СтатусДоставки КАК СтатусДоставки,
	|	ДанныеДокумента.НВД_Оплата КАК Оплата,
	|	ДанныеДокумента.НВД_ДопИнфоАдресМонтажа КАК ДопИнфоАдресМонтажа,
	|	ДанныеДокумента.НВД_Курьер КАК Курьер,
	|	ДанныеДокумента.НВД_КрайняяДатаОтгрузки КАК КрайняяДатаОтгрузки,
	|	ДанныеДокумента.НВД_КрайнееВремяОтгрузки КАК КрайнееВремяОтгрузки,
	|	ДанныеДокумента.НВД_АдресПартнера КАК АдресПартнера,
	|	ДанныеДокумента.НВД_ДопИнфоАдресПартнера КАК ДопИнфоАдресПартнера,
	|	ДанныеДокумента.ОжидаемаяДатаОтгрузки КАК ОжидаемаяДатаОтгрузки,
	|	ДанныеДокумента.ОжидаемоеВремяОтгрузки КАК ОжидаемоеВремяОтгрузки,
	|	ДанныеДокумента.Примечание КАК Примечание,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК ДолгКонтрагента,
	|	ВТ_СостоянияОплатыЗаказов.СостояниеОплаты КАК СостояниеОплаты
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО (ВзаиморасчетыСКонтрагентамиОстатки.Организация = ДанныеДокумента.Организация)
	|			И (ВзаиморасчетыСКонтрагентамиОстатки.Контрагент = ДанныеДокумента.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияОплатыЗаказов КАК ВТ_СостоянияОплатыЗаказов
	|		ПО (ВТ_СостоянияОплатыЗаказов.Ссылка = ДанныеДокумента.Ссылка)
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.ЦенаВал КАК ЦенаВал,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки + ДанныеДокумента.СкидкаБонусами КАК Скидка,
	|	ДанныеДокумента.СкидкаБонусами КАК СкидкаБонусами,
	|	ДанныеДокумента.Сумма + ДанныеДокумента.СуммаРучнойСкидки + ДанныеДокумента.СкидкаБонусами КАК СуммаБезСкидки,
	|	ДанныеДокумента.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ДанныеДокумента.НомерУпаковки КАК НомерУпаковки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерений)
	|			ТОГДА ДанныеДокумента.ЕдиницаИзмерения.Вес * ДанныеДокумента.Количество
	|		ИНАЧЕ ДанныеДокумента.Номенклатура.Вес * ДанныеДокумента.Количество
	|	КОНЕЦ КАК Вес,
	|	ДанныеДокумента.Потолок КАК Потолок,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	НоменклатураСкладскиеЯчейки.Ячейка КАК Ячейка
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.СкладскиеЯчейки КАК НоменклатураСкладскиеЯчейки
	|		ПО ДанныеДокумента.Номенклатура = НоменклатураСкладскиеЯчейки.Ссылка
	|			И ДанныеДокумента.Ссылка.Склад = НоменклатураСкладскиеЯчейки.Склад
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
//	|	Ячейка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(Сумма),
	|	СУММА(СуммаРучнойСкидки),
	|	СУММА(Скидка),
	|	СУММА(Вес),
	|	СУММА(СуммаНДС)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[2];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[3];
	РезультатПоНомерамУпаковки      = МассивРезультатов[4];
	
	ЗапросСуммаНеоплаченныхЗаказовКонтрагента = Новый Запрос;
	ЗапросСуммаНеоплаченныхЗаказовКонтрагента.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросСуммаНеоплаченныхЗаказовКонтрагента.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	РасчетыПоЗаказам.СуммаНеоплаченныхЗаказов КАК СуммаНеоплаченныхЗаказов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказПокупателя.Контрагент КАК Контрагент,
	|			СУММА(ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0)) КАК СуммаНеоплаченныхЗаказов
	|		ИЗ
	|			РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|				ПО РасчетыПоЗаказамОстатки.Заказ = ЗаказПокупателя.Ссылка
	|		ГДЕ
	|			ЗаказПокупателя.Проведен
	|			И ЗаказПокупателя.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
	|			И НЕ ЗаказПокупателя.Ссылка В (&МассивОбъектов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПокупателя.Контрагент) КАК РасчетыПоЗаказам
	|		ПО (ЗаказПокупателя.Контрагент = РасчетыПоЗаказам.Контрагент)
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В (&МассивОбъектов)";
	
	РезультатПоНеоплаченнымЗаказам = ЗапросСуммаНеоплаченныхЗаказовКонтрагента.Выполнить();
	
	ЗапросСписокЗаказовКонтрагента = Новый Запрос;
	ЗапросСписокЗаказовКонтрагента.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросСписокЗаказовКонтрагента.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК СуммаНеоплаченногоЗаказа,
	|	РасчетыПоЗаказамОстатки.Заказ.Ссылка КАК Заказ,
	|	РасчетыПоЗаказамОстатки.Заказ.Контрагент КАК Контрагент,
	|	РасчетыПоЗаказамОстатки.Заказ.Номер КАК НомерЗаказа,
	|	РасчетыПоЗаказамОстатки.Заказ.Дата КАК ДатаЗаказа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПокупателя.Контрагент КАК Контрагент
	|	ИЗ
	|		Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|	ГДЕ
	|		ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказПокупателя.Контрагент) КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|		ПО (Контрагенты.Контрагент = РасчетыПоЗаказамОстатки.Контрагент)
	|ГДЕ
	|	РасчетыПоЗаказамОстатки.Заказ.Проведен
	|	И РасчетыПоЗаказамОстатки.Заказ.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
	|   И НЕ РасчетыПоЗаказамОстатки.Заказ В (&МассивОбъектов)";
	
	РезультатПоСпискуНеоплаченныхЗаказов = ЗапросСписокЗаказовКонтрагента.Выполнить();
	
	ЗапросСписокПеремещенийНаОснованииЗаказа = Новый Запрос;
	ЗапросСписокПеремещенийНаОснованииЗаказа.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросСписокПеремещенийНаОснованииЗаказа.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Перемещение,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ПеремещениеТоваров.Основание КАК Заказ,
	|	ПеремещениеТоваров.ТекущийСтатус КАК ТекущийСтатус
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Основание В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	РезультатПоСпискуПеремещенийНаОснованииЗаказа = ЗапросСписокПеремещенийНаОснованииЗаказа.Выполнить();
	
	ЗапросПоТабличнойЧастиМатериалы = Новый Запрос;
	ЗапросПоТабличнойЧастиМатериалы.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоТабличнойЧастиМатериалы.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяМатериалы.Ссылка КАК Ссылка,
	|	ЗаказПокупателяМатериалы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателяМатериалы.ЗагруженоИзПостроителя КАК ЗагруженоИзПостроителя,
	|	ЗаказПокупателяМатериалы.Количество КАК Количество,
	|	ЗаказПокупателяМатериалы.КоличествоКВыработке КАК КоличествоКВыработке,
	|	ЗаказПокупателяМатериалы.Коэффициент КАК Коэффициент,
	|	ЗаказПокупателяМатериалы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяМатериалы.Потолок КАК Потолок,
	|	ЗаказПокупателяМатериалы.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ЗаказПокупателяМатериалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяМатериалы.УИСтроки КАК УИСтроки
	|ИЗ
	|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
	|ГДЕ
	|	ЗаказПокупателяМатериалы.Ссылка В (&МассивОбъектов)";
	
	ТаблицаМатериалов = ЗапросПоТабличнойЧастиМатериалы.Выполнить().Выгрузить();
	
	СоответствияПотолокГарпун = ПолучитьСоответствияПотолокГарпун(ТаблицаМатериалов); 
	
	ЗапросПоQRКодамДляОплаты = Новый Запрос;
	ЗапросПоQRКодамДляОплаты.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоQRКодамДляОплаты.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СБП_QRКоды.qrcId КАК qrcId,
	|	СБП_QRКоды.status КАК status,
	|	СБП_QRКоды.ДатаГенерации КАК ДатаГенерации,
	|	СБП_QRКоды.imageParams_mediaType КАК imageParams_mediaType,
	|	СБП_QRКоды.imageParams_content КАК imageParams_content,
	|	СБП_QRКоды.amount КАК amount,
	|	СБП_QRКоды.payload КАК payload,
	|	СБП_QRКоды.qrcType КАК qrcType,
	|	СБП_QRКоды.imageParams_height КАК imageParams_height,
	|	СБП_QRКоды.imageParams_width КАК imageParams_width,
	|	СБП_QRКоды.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
	|ГДЕ
	|	СБП_QRКоды.Заказ В(&МассивОбъектов)";
	
	ТаблицаQRКодовДляОплаты = ЗапросПоQRКодамДляОплаты.Выполнить().Выгрузить();
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоНомерамУпаковки, РезультатПоНеоплаченнымЗаказам, РезультатПоСпискуНеоплаченныхЗаказов, СоответствияПотолокГарпун, ТаблицаQRКодовДляОплаты, РезультатПоСпискуПеремещенийНаОснованииЗаказа",
	РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоНомерамУпаковки, РезультатПоНеоплаченнымЗаказам, РезультатПоСпискуНеоплаченныхЗаказов, СоответствияПотолокГарпун, ТаблицаQRКодовДляОплаты, РезультатПоСпискуПеремещенийНаОснованииЗаказа);
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Функция ПолучитьДанныеДляПечатныхФорм3(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказПокупателя.НастройкаИнтеркампани КАК НастройкаИнтеркампани
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеРегистра.Заказ КАК Ссылка,
	|	ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) КАК Оплачено,
	|	ЕСТЬNULL(ДанныеРегистра.СуммаПриход, 0) - ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) КАК КОплате,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) = 0
	|				ИЛИ ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) = 0
	|			ТОГДА ""НЕ ОПЛАЧЕН""
	|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) = ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0)
	|				И ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) > 0
	|			ТОГДА ""ОПЛАЧЕН""
	|		КОГДА ЕСТЬNULL(ВТ_Заказы.СуммаДокумента, 0) < ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0)
	|				И ЕСТЬNULL(ДанныеРегистра.СуммаРасход, 0) > 0
	|			ТОГДА ""ЧАСТ. ОПЛАЧЕН""
	|		ИНАЧЕ ""НЕ ОПЛАЧЕН""
	|	КОНЕЦ КАК СостояниеОплаты
	|ПОМЕСТИТЬ ВТ_СостоянияОплатыЗаказов
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Обороты(, , , Заказ В (&МассивОбъектов)) КАК ДанныеРегистра
	|		ПО ВТ_Заказы.Ссылка = ДанныеРегистра.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	""01.01.0001"" КАК Дата,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидЦен КАК ВидЦен,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Организация.ПолноеНаименование = """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.Склад КАК Склад,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
	|	ДанныеДокумента.БанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
	|	ДанныеДокумента.БанковскийСчет.БИК КАК БанковскийСчетБИК,
	|	ДанныеДокумента.БанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
	|	ДанныеДокумента.БанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
	|	ДанныеДокумента.ИнтернетОплатаСсылка КАК ИнтернетОплатаСсылка,
	|	ДанныеДокумента.ИнтернетОплатаНомерТелефонаПлательщика КАК ИнтернетОплатаНомерТелефонаПлательщика,
	|	ДанныеДокумента.ИнтернетОплатаЭлектроннаяПочтаПлательщика КАК ИнтернетОплатаЭлектроннаяПочтаПлательщика,
	|	ДанныеДокумента.Организация.ИНН КАК ИНН,
	|	ДанныеДокумента.Организация.КПП КАК КПП,
	|	ДанныеДокумента.Организация.Руководитель КАК ОрганизацияРуководитель,
	|	ДанныеДокумента.Организация.ГлавныйБухгалтер КАК ОрганизацияГлавныйБухгалтер,
	|	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДанныеДокумента.Организация.ЯвляетсяПлательщикомНДС КАК ОрганизацияЯвляетсяПлательщикомНДС,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ДанныеДокумента.СуммаБонусовКСписаниюПоДисконтнойКарте КАК СуммаБонусовКСписанию,
	|	""текст расшифровки НДС"" КАК НДС,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСуммаБезНДС,
	|	0 КАК СуммаРучнойСкидки,
	|	0 КАК Скидка,
	|	0 КАК ИтогоВес,
	|	0 КАК Вес,
	|	0 КАК Сумма,
	|	0 КАК КолвоПозиций,
	|	ДанныеДокумента.НВД_ВидОтгрузки КАК ВидОтгрузки,
	|	ПОДСТРОКА(""0123456789"", ДЕНЬ(ДанныеДокумента.НВД_ДатаСамовывоза) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ДанныеДокумента.НВД_ДатаСамовывоза))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ДанныеДокумента.НВД_ДатаСамовывоза) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ДанныеДокумента.НВД_ДатаСамовывоза))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ДанныеДокумента.НВД_ДатаСамовывоза) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ДанныеДокумента.НВД_ДатаСамовывоза) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ДанныеДокумента.НВД_ДатаСамовывоза) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ДанныеДокумента.НВД_ДатаСамовывоза) * 6)) / 6 + 1, 1) КАК ДатаСамовывоза,
	|	ПОДСТРОКА(""0123456789"", ЧАС(ДанныеДокумента.НВД_ВремяСамовывоза) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ЧАС(ДанныеДокумента.НВД_ВремяСамовывоза))) / 6 + 1, 1) + "":"" + ПОДСТРОКА(""0123456789"", МИНУТА(ДанныеДокумента.НВД_ВремяСамовывоза) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МИНУТА(ДанныеДокумента.НВД_ВремяСамовывоза))) / 6 + 1, 1) КАК ВремяСамовывоза,
	|	ДанныеДокумента.НВД_СтатусДоставки КАК СтатусДоставки,
	|	ДанныеДокумента.НВД_Оплата КАК Оплата,
	|	ДанныеДокумента.НВД_ДопИнфоАдресМонтажа КАК ДопИнфоАдресМонтажа,
	|	ДанныеДокумента.НВД_Курьер КАК Курьер,
	|	ДанныеДокумента.НВД_КрайняяДатаОтгрузки КАК КрайняяДатаОтгрузки,
	|	ДанныеДокумента.НВД_КрайнееВремяОтгрузки КАК КрайнееВремяОтгрузки,
	|	ДанныеДокумента.НВД_АдресПартнера КАК АдресПартнера,
	|	ДанныеДокумента.НВД_ДопИнфоАдресПартнера КАК ДопИнфоАдресПартнера,
	|	ДанныеДокумента.ОжидаемаяДатаОтгрузки КАК ОжидаемаяДатаОтгрузки,
	|	ДанныеДокумента.ОжидаемоеВремяОтгрузки КАК ОжидаемоеВремяОтгрузки,
	|	ДанныеДокумента.Примечание КАК Примечание,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК ДолгКонтрагента,
	|	ВТ_СостоянияОплатыЗаказов.СостояниеОплаты КАК СостояниеОплаты,
	|	ДанныеДокумента.СрочныйЗаказ КАК СрочныйЗаказ
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО (ВзаиморасчетыСКонтрагентамиОстатки.Организация = ДанныеДокумента.Организация)
	|			И (ВзаиморасчетыСКонтрагентамиОстатки.Контрагент = ДанныеДокумента.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияОплатыЗаказов КАК ВТ_СостоянияОплатыЗаказов
	|		ПО (ВТ_СостоянияОплатыЗаказов.Ссылка = ДанныеДокумента.Ссылка)
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.АдресМонтажа КАК АдресМонтажа,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.ЦенаВал КАК ЦенаВал,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки + ДанныеДокумента.СкидкаБонусами КАК Скидка,
	|	ДанныеДокумента.СкидкаБонусами КАК СкидкаБонусами,
	|	ДанныеДокумента.Сумма + ДанныеДокумента.СуммаРучнойСкидки + ДанныеДокумента.СкидкаБонусами КАК СуммаБезСкидки,
	|	ДанныеДокумента.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ДанныеДокумента.НомерУпаковки КАК НомерУпаковки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерений)
	|			ТОГДА ДанныеДокумента.ЕдиницаИзмерения.Вес * ДанныеДокумента.Количество
	|		ИНАЧЕ ДанныеДокумента.Номенклатура.Вес * ДанныеДокумента.Количество
	|	КОНЕЦ КАК Вес,
	|	ДанныеДокумента.Потолок КАК Потолок,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС,
	|	НоменклатураСкладскиеЯчейки.Ячейка КАК Ячейка
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.СкладскиеЯчейки КАК НоменклатураСкладскиеЯчейки
	|		ПО ДанныеДокумента.Номенклатура = НоменклатураСкладскиеЯчейки.Ссылка
	|			И ДанныеДокумента.Ссылка.Склад = НоменклатураСкладскиеЯчейки.Склад
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(Сумма),
	|	СУММА(СуммаРучнойСкидки),
	|	СУММА(Скидка),
	|	СУММА(Вес),
	|	СУММА(СуммаНДС)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[2];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[3];
	РезультатПоНомерамУпаковки      = МассивРезультатов[4];
	
	ЗапросСуммаНеоплаченныхЗаказовКонтрагента = Новый Запрос;
	ЗапросСуммаНеоплаченныхЗаказовКонтрагента.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросСуммаНеоплаченныхЗаказовКонтрагента.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	РасчетыПоЗаказам.СуммаНеоплаченныхЗаказов КАК СуммаНеоплаченныхЗаказов
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказПокупателя.Контрагент КАК Контрагент,
	|			СУММА(ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0)) КАК СуммаНеоплаченныхЗаказов
	|		ИЗ
	|			РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|				ПО РасчетыПоЗаказамОстатки.Заказ = ЗаказПокупателя.Ссылка
	|		ГДЕ
	|			ЗаказПокупателя.Проведен
	|			И ЗаказПокупателя.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
	|			И НЕ ЗаказПокупателя.Ссылка В (&МассивОбъектов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПокупателя.Контрагент) КАК РасчетыПоЗаказам
	|		ПО (ЗаказПокупателя.Контрагент = РасчетыПоЗаказам.Контрагент)
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В (&МассивОбъектов)";
	
	РезультатПоНеоплаченнымЗаказам = ЗапросСуммаНеоплаченныхЗаказовКонтрагента.Выполнить();
	
	ЗапросСписокЗаказовКонтрагента = Новый Запрос;
	ЗапросСписокЗаказовКонтрагента.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросСписокЗаказовКонтрагента.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК СуммаНеоплаченногоЗаказа,
	|	РасчетыПоЗаказамОстатки.Заказ.Ссылка КАК Заказ,
	|	РасчетыПоЗаказамОстатки.Заказ.Контрагент КАК Контрагент,
	|	РасчетыПоЗаказамОстатки.Заказ.Номер КАК НомерЗаказа,
	|	РасчетыПоЗаказамОстатки.Заказ.Дата КАК ДатаЗаказа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПокупателя.Контрагент КАК Контрагент
	|	ИЗ
	|		Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|	ГДЕ
	|		ЗаказПокупателя.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаказПокупателя.Контрагент) КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
	|		ПО (Контрагенты.Контрагент = РасчетыПоЗаказамОстатки.Контрагент)
	|ГДЕ
	|	РасчетыПоЗаказамОстатки.Заказ.Проведен
	|	И РасчетыПоЗаказамОстатки.Заказ.ТекущийСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыЗаказовПокупателей.ВРаботе)
	|   И НЕ РасчетыПоЗаказамОстатки.Заказ В (&МассивОбъектов)";
	
	РезультатПоСпискуНеоплаченныхЗаказов = ЗапросСписокЗаказовКонтрагента.Выполнить(); 
	
	ЗапросСписокПеремещенийНаОснованииЗаказа = Новый Запрос;
	ЗапросСписокПеремещенийНаОснованииЗаказа.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросСписокПеремещенийНаОснованииЗаказа.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Перемещение,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ПеремещениеТоваров.Основание КАК Заказ,
	|	ПеремещениеТоваров.ТекущийСтатус КАК ТекущийСтатус
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Основание В(&МассивОбъектов)
	|	И ПеремещениеТоваров.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещений.Отменен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	РезультатПоСпискуПеремещенийНаОснованииЗаказа = ЗапросСписокПеремещенийНаОснованииЗаказа.Выполнить();
	
	ЗапросПоТабличнойЧастиМатериалы = Новый Запрос;
	ЗапросПоТабличнойЧастиМатериалы.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоТабличнойЧастиМатериалы.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяМатериалы.Ссылка КАК Ссылка,
	|	ЗаказПокупателяМатериалы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПокупателяМатериалы.ЗагруженоИзПостроителя КАК ЗагруженоИзПостроителя,
	|	ЗаказПокупателяМатериалы.Количество КАК Количество,
	|	ЗаказПокупателяМатериалы.КоличествоКВыработке КАК КоличествоКВыработке,
	|	ЗаказПокупателяМатериалы.Коэффициент КАК Коэффициент,
	|	ЗаказПокупателяМатериалы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяМатериалы.Потолок КАК Потолок,
	|	ЗаказПокупателяМатериалы.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ЗаказПокупателяМатериалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяМатериалы.УИСтроки КАК УИСтроки
	|ИЗ
	|	Документ.ЗаказПокупателя.Материалы КАК ЗаказПокупателяМатериалы
	|ГДЕ
	|	ЗаказПокупателяМатериалы.Ссылка В (&МассивОбъектов)";
	
	ТаблицаМатериалов = ЗапросПоТабличнойЧастиМатериалы.Выполнить().Выгрузить();
	
	СоответствияПотолокГарпун = ПолучитьСоответствияПотолокГарпун(ТаблицаМатериалов); 
	
	ЗапросПоQRКодамДляОплаты = Новый Запрос;
	ЗапросПоQRКодамДляОплаты.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоQRКодамДляОплаты.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СБП_QRКоды.qrcId КАК qrcId,
	|	СБП_QRКоды.status КАК status,
	|	СБП_QRКоды.ДатаГенерации КАК ДатаГенерации,
	|	СБП_QRКоды.imageParams_mediaType КАК imageParams_mediaType,
	|	СБП_QRКоды.imageParams_content КАК imageParams_content,
	|	СБП_QRКоды.amount КАК amount,
	|	СБП_QRКоды.payload КАК payload,
	|	СБП_QRКоды.qrcType КАК qrcType,
	|	СБП_QRКоды.imageParams_height КАК imageParams_height,
	|	СБП_QRКоды.imageParams_width КАК imageParams_width,
	|	СБП_QRКоды.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
	|ГДЕ
	|	СБП_QRКоды.Заказ В(&МассивОбъектов)";
	
	ТаблицаQRКодовДляОплаты = ЗапросПоQRКодамДляОплаты.Выполнить().Выгрузить();
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоНомерамУпаковки, РезультатПоНеоплаченнымЗаказам, РезультатПоСпискуНеоплаченныхЗаказов, СоответствияПотолокГарпун, ТаблицаQRКодовДляОплаты, РезультатПоСпискуПеремещенийНаОснованииЗаказа",
	РезультатПоШапке, РезультатПоТабличнойЧастиТовары, РезультатПоНомерамУпаковки, РезультатПоНеоплаченнымЗаказам, РезультатПоСпискуНеоплаченныхЗаказов, СоответствияПотолокГарпун, ТаблицаQRКодовДляОплаты, РезультатПоСпискуПеремещенийНаОснованииЗаказа);
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции


&После("ДобавитьКомандыПечати")
Процедура НВД_ДобавитьКомандыПечати(КомандыПечати)
	//Товарная накладная с весом
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати 	= "Документ.ЗаказПокупателя";
	//КомандаПечати.Идентификатор 	= "ЗаказПокупателя2";
	//КомандаПечати.Представление 	= НСтр("ru = 'Заказ покупателя 2'");
	////КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	//КомандаПечати.ЗаголовокФормы 	= НСтр("ru = 'Заказ покупателя 2'");
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати 	= "Документ.ЗаказПокупателя";
	//КомандаПечати.Идентификатор 	= "ЗаказПокупателя3";
	//КомандаПечати.Представление 	= НСтр("ru = 'Заказ покупателя 3'");
	////КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	//КомандаПечати.ЗаголовокФормы 	= НСтр("ru = 'Заказ покупателя 3'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 	= "Документ.ЗаказПокупателя";
	КомандаПечати.Идентификатор 	= "ЗаказПокупателяДляПокупателя";
	КомандаПечати.Представление 	= НСтр("ru = 'Заказ покупателя для покупателя'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы 	= НСтр("ru = 'Заказ покупателя для покупателя'"); 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 	= "Документ.ЗаказПокупателя";
	КомандаПечати.Идентификатор 	= "ЗаказПокупателяДляПокупателяСФото";
	КомандаПечати.Представление 	= НСтр("ru = 'Заказ покупателя для покупателя с фото'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы 	= НСтр("ru = 'Заказ покупателя для покупателя с фото'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 	= "Документ.ЗаказПокупателя";
	КомандаПечати.Идентификатор 	= "ЗаказПокупателяДляСклада";
	КомандаПечати.Представление 	= НСтр("ru = 'Заказ покупателя для склада'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы 	= НСтр("ru = 'Заказ покупателя для склада'");
КонецПроцедуры

&После("Печать")
Процедура НВД_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПокупателя2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЗаказПокупателя2",
		НСтр("ru = 'Заказ покупателя 2'"),
		НВД_ПечатьЗаказПокупателя2(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя2");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПокупателя3") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЗаказПокупателя3",
		НСтр("ru = 'Заказ покупателя 3'"),
		НВД_ПечатьЗаказПокупателя3(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя2");
	КонецЕсли;  
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПокупателяДляПокупателя") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЗаказПокупателяДляПокупателя",
		НСтр("ru = 'Заказ покупателя для покупателя'"),
		НВД_ПечатьЗаказПокупателяДляПокупателя(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателяДляПокупателя");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПокупателяДляПокупателяСФото") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЗаказПокупателяДляПокупателяСФото",
		НСтр("ru = 'Заказ покупателя для покупателя с фото'"),
		НВД_ПечатьЗаказПокупателяДляПокупателяСФото(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателяДляПокупателяСФото");
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПокупателяДляСклада") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЗаказПокупателяДляСклада",
		НСтр("ru = 'Заказ покупателя для склада'"),
		НВД_ПечатьЗаказПокупателяДляСклада(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЗаказПокупателя.НВД_ПФ_MXL_ЗаказПокупателяДляСклада");
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьМассивРеквизитовПоСкидке3Процента() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыДеревоДобавитьСкидку3Процента"); 
	МассивИменЭлементов.Добавить("ТоварыДобавитьСкидку3Процента");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

Функция ПолучитьЗаявкуНаДоставку(ЗаказПокупателя)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявкаНаДоставкуОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставкуОснования
	|ГДЕ
	|	ЗаявкаНаДоставкуОснования.Основание = &Основание
	|	И НЕ ЗаявкаНаДоставкуОснования.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаДоставкуОснования.Ссылка.Дата";
	Запрос.УстановитьПараметр("Основание", ЗаказПокупателя);
	
	ТЗЗаявокНаДоставку = Запрос.Выполнить().Выгрузить();
	Если ТЗЗаявокНаДоставку.Количество() > 0 Тогда
		Возврат ТЗЗаявокНаДоставку[0].Ссылка.ПолучитьОбъект();	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСоответствияПотолокГарпун(ТаблицаМатериалов = Неопределено)
	 
	СоответствиеПотолокГарпун = Новый Соответствие;
	
	Если ТаблицаМатериалов = Неопределено Тогда
		Возврат СоответствиеПотолокГарпун;
	КонецЕсли; 
	
	ТЗПотолки = ТаблицаМатериалов.Скопировать(,"Потолок");
	ТЗПотолки.Свернуть("Потолок");
	
	ТЗМатериалы = ТаблицаМатериалов.Скопировать(,"Номенклатура, Потолок");
	
	Для Каждого СтрокаПотолок Из ТЗПотолки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаПотолок.Потолок) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТЗМатериалы.НайтиСтроки(Новый Структура("Потолок", СтрокаПотолок.Потолок));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПринадлежитГруппеГарпун(НайденнаяСтрока.Номенклатура) Тогда
				СоответствиеПотолокГарпун.Вставить(СтрокаПотолок.Потолок, НайденнаяСтрока.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СоответствиеПотолокГарпун;
	
КонецФункции 

Функция ПринадлежитГруппеГарпун(Номенклатура)
	
	 Возврат Номенклатура.ПринадлежитЭлементу(Справочники.Номенклатура.НайтиПоКоду("000000009"));
		
КонецФункции
