
&Вместо("ПередЗаписью")
Процедура НВД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//// #5185, т.к. отловить событие установки пометки удаления в форме никак нельзя, будем запоминать необходимость обновления данных для Заказ-договора в модуле объекта
	// Пока убрали этот код
	//Если ЭтоЗаказОтРозницы И НЕ Ссылка.ПометкаУдаления И ПометкаУдаления Тогда	
	//	УстановитьПривилегированныйРежим(Истина);
	//	ХранилищеОбщихНастроек.Сохранить("УстановленаПометкаУдаленияНаЗаказПокупателя",, Истина,, Строка(ПараметрыСеанса.ТекущийПользователь));
	//	УстановитьПривилегированныйРежим(Ложь);
	//КонецЕсли;	
	
	Если НЕ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Отменен
		И НЕ ПометкаУдаления Тогда
		//если заказ покупателя не помечен на удаление и не имеет статус "Отменен", проверяем, что указанные в нем потолки отсутствут в других неотмененных заказах покупателей
		
		//СписокПотолков = Новый СписокЗначений;
		//Для Каждого ТекущаяСтрока Из Товары Цикл
		//	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
		//		СписокПотолков.Добавить(ТекущаяСтрока.Номенклатура);
		//	КонецЕсли;
		//КонецЦикла;
		СписокВидов=Новый СписокЗначений;
		СписокВидов.Добавить(Справочники.ВидыНоменклатуры.Потолок);
		СписокВидов.Добавить(Справочники.ВидыНоменклатуры.Отрез);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка
		|	И ЗаказПокупателяТовары.Номенклатура.ВидНоменклатуры В(&ВидыНоменклатуры)";
		Запрос.УстановитьПараметр("ВидыНоменклатуры",СписокВидов);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		СписокПотолков=Запрос.Выполнить().Выгрузить();
		
		
		
		Если ЗначениеЗаполнено(СписокПотолков) тогда
			УстановитьПривилегированныйРежим(Истина);
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗаказПокупателяТовары.Ссылка КАК Ссылка,
			|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура
			|ИЗ
			|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
			|ГДЕ
			|	НЕ ЗаказПокупателяТовары.Ссылка.ПометкаУдаления
			|	И НЕ ЗаказПокупателяТовары.Ссылка.ТекущийСтатус = &Отменен
			|	И НЕ ЗаказПокупателяТовары.Ссылка = &Ссылка
			|	И ЗаказПокупателяТовары.Номенклатура В(&Номенклатура)
			|	И ЗаказПокупателяТовары.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК";
			Запрос.УстановитьПараметр("ДатаН",КонецДня(ТекущаяДата())-60*60*24*30);
			Запрос.УстановитьПараметр("ДатаК",КонецДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("Отменен",Справочники.СтатусыЗаказовПокупателей.Отменен);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Запрос.УстановитьПараметр("Номенклатура",СписокПотолков);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Отказ = Истина;
				Сообщить("По потолку " + Выборка.Номенклатура + " имеется другой оформленный заказ - " + Выборка.Ссылка);
			КонецЦикла;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт Тогда	
		Если ДатаЗакрытия = Дата(1,1,1) Тогда
			ДатаЗакрытия = ТекущаяДатаСеанса();
		КонецЕсли;
		//#9777
		Если ДатаВыполнения = Дата(1,1,1) Тогда
			ДатаВыполнения = ДатаЗакрытия; //ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	//#9777
	Если Ссылка.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт
		И НЕ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт 
		И НЕ ДатаЗакрытия = Дата(1,1,1) Тогда
		ДатаЗакрытия = Дата(1,1,1);
	КонецЕсли;
	//#9777
	Если Ссылка.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен
		И НЕ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен 
		И НЕ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт
		И НЕ ДатаВыполнения = Дата(1,1,1) Тогда
		ДатаВыполнения = Дата(1,1,1);
	КонецЕсли;
	//#9777
	Если Ссылка.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт
		И НЕ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен 
		И НЕ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт
		И НЕ ДатаВыполнения = Дата(1,1,1) Тогда
		ДатаВыполнения = Дата(1,1,1);
	КонецЕсли;
	
	
	//НАЧАЛО: Переход на 2.0
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если (ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен
			ИЛИ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт) Тогда
			
			СтруктураВозврата = Документы.ЗаказПокупателя.ВсеТоварыПоЗаказуОтгружены(Ссылка, Товары);
			Если НЕ СтруктураВозврата.Результат Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураВозврата.Описание,,,,Отказ);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СозданПриИспользованииСтатусаЗакрыт // №1083 переделано, раньше было ПолучитьФункциональнуюОпцию("ИспользоватьСтатусЗакрытВЗаказеПокупателя")
			И ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт Тогда
			
			Если ПолучитьФункциональнуюОпцию("ЗапретитьПереводЗаказаВСтатусЗакрытПриНеполнойОплате") Тогда			
				Результат = РегистрыНакопления.РасчетыПоЗаказам.ЗаказОплаченПолностью(Ссылка);
				Если НЕ Результат Тогда
					ТекстОшибки = "Заказ оплачен не полностью. Настройками программы запрещен перевод в статус ""Закрыт""";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Отменен Тогда		
			Если НЕ Документы.ЗаказПокупателя.ВозможенПереводВСтатусОтменен(Ссылка) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Действие отменено.",,,,Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//++ №9324
		Если НЕ СозданПриИспользованииСтатусаЗакрыт И ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт Тогда
			
			Сообщить("Запрещено переводить заказ в статус ""Закрыт"", т.к. документ создан без использования статуса ""Закрыт"".");
			Отказ = Истина;
			
		КонецЕсли;
		//-- №9324
		
		//++ №9385 установим время выполнения
		Если ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен И НЕ Ссылка.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен 
			И ДатаВыполнения = Дата(1,1,1) Тогда
			ДатаВыполнения = ТекущаяДатаСеанса();
		КонецЕсли;
		//-- №9385
		
	ИначеЕсли (РежимЗаписи = РежимЗаписиДокумента.Запись И ПометкаУдаления) 
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		//проверяем отсутствие отгрузок по данному заказу
		Если Документы.ЗаказПокупателя.ЕстьРеализацииПоЗаказу(Ссылка) Тогда
			Сообщить("Действие отменено.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		//проверяем отсутствие выпусков по данному заказу
		Если Документы.ЗаказПокупателя.ЕстьВыпускиПродукцииПоПотолкамЗаказа(Ссылка) Тогда
			Если НЕ ПараметрыСеанса.ТекущийПользователь.РазрешеноПереводитьЗаказыПокупателейВСтатусОтмененПриНаличииВыпускаПотолков Тогда
				Сообщить("Действие отменено.");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;			
		
	КонецЕсли;
	//КОНЕЦ: Переход на 2.0
	
	Если НЕ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Отменен Тогда
		Документы.ЗаказДоговор.ПроверитьКомнатыПоЗаказу(ЭтотОбъект, Отказ, РежимЗаписи);
	КонецЕсли;
	
	// Проверяем остатки по резервам, их быть не должно
	Если Константы.ИспользоватьРезервирование.Получить()
		И РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И (ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Выполнен
		ИЛИ ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Закрыт) Тогда			
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
		|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры,
		|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры,
		|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Количество
		|ИЗ
		|   РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ДокументРезерва) КАК ТоварыВРезервеНаСкладахОстатки";
		Запрос.УстановитьПараметр("ДокументРезерва", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Сообщить("Имеются остатки по резервам:");
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл				
				Сообщить(Строка(Выборка.Номенклатура)+ ?(Выборка.ХарактеристикаНоменклатуры.Пустая(), "", ", Характеристика: " + Строка(Выборка.ХарактеристикаНоменклатуры)) + ?(Выборка.СерияНоменклатуры.Пустая(), "", ", Серия: " + Строка(Выборка.СерияНоменклатуры)) + " в количестве = " + Строка(Выборка.Количество), СтатусСообщения.Важное);
			КонецЦикла;
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//nva+++
	Если НЕ ЭтоНовый() И ТекущийСтатус <> Справочники.СтатусыЗаказовПокупателей.Новый Тогда
		Если Документы.ЗаказПокупателя.ЕстьЗаказныеПозицииИСозданЗаказПоставщику(Ссылка, Товары) Тогда
			Сообщить("Действие отменено.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//nva--- 
	
	//#9194
	//ДополнительныеСвойства.Вставить("ПредыдущийСтатус", Ссылка.ТекущийСтатус);
	Если НЕ ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ПредыдущийСтатус", Ссылка.ТекущийСтатус);
		ДополнительныеСвойства.Вставить("ПредыдущийСборщик", Ссылка.Сборщик);
		ДополнительныеСвойства.Вставить("ПредыдущийСтатусСборки", Ссылка.СтатусСборки);
	КонецЕсли;
	//
	
	//Выгрузка на FTP
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
	//	СформироватьИОтправитьJSON();
	//КонецЕсли;
	
	Попытка 
		// Доработка Мальцев
		Если НЕ Отказ Тогда
			Если Не ЗначениеЗаполнено(Номер) Тогда
				УстановитьНовыйНомер();
			КонецЕсли;
			Если ШтрихКод = "" Тогда
				СформироватьШтрихКод();
			КонецЕсли;
		КонецЕсли;	
	Исключение 
	КонецПопытки;
	
	//ОбработатьСделкуБитрикс24(); 
	
	//nva+++
	Если НЕ Отказ Тогда
		//Отправляем сообщение в обсуждения, если Контрагент = Контрагент косяков
		ПользователиПоКонтрагенту = ПолучитьПользователейПоКонтрагенту(Контрагент);
	
		Если ПользователиПоКонтрагенту.Количество() Тогда
			//отправляем сообщение пользователю в обсуждениях
			Для Каждого лПользователь Из ПользователиПоКонтрагенту Цикл
				ОтправитьСообщениеВОбсуждения(лПользователь, Ссылка);
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	//nva---
	
КонецПроцедуры

&После("ПриКопировании")
Процедура НВД_ПриКопировании(ОбъектКопирования)
	Штрихкод = "";
КонецПроцедуры


// Доработка Мальцев
Процедура СформироватьИОтправитьJSON()
	
	ФайлJSON = "E:\ТестовыеДанныеJSON\"+Номер+".json";
	
	
	ЗаписьJSON = Новый ЗаписьJSON;                               
	ЗаписьJSON.ОткрытьФайл(ФайлJSON);	
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("ID", Номер);
	СтруктураJSON.Вставить("Worker",УДАЛИТЬ_Ответственный.Наименование);
	СтруктураJSON.Вставить("WorkerID",Строка(УДАЛИТЬ_Ответственный.УникальныйИдентификатор()));
	СтруктураJSON.Вставить("ClientName",Контрагент.Наименование);
	СтруктураJSON.Вставить("ClientID",Контрагент.Код);
	СтруктураJSON.Вставить("Ammount",СуммаДокумента);
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
	ЗаписьJSON.Закрыть();
	
	
КонецПроцедуры

Процедура СформироватьШтрихКод()
	
	ТекДата = Дата;
	
	ШК = "" + Прав(Номер,4) + ГОД(ТекДата) + ?(СтрДлина(Месяц(ТекДата)) = 1, "0" + Месяц(ТекДата), Месяц(ТекДата))  + ?(СтрДлина(День(ТекДата)) = 1, "0" +День(ТекДата),День(ТекДата));
	ШК = СтрЗаменить(ШК,Символы.НПП,"");
	//А = Сред(ШК,2,1) + Сред(ШК,4,1) + Сред(ШК,6,1) + Сред(ШК,8,1) + Сред(ШК,10,1)+ Сред(ШК,12,1);
	//А = А*3;
	//В = Сред(ШК,1,1)+ Сред(ШК,3,1)+ Сред(ШК,5,1)+ Сред(ШК,7,1)+ Сред(ШК,9,1)+ Сред(ШК,11,1);
	//С = А + В;
	КонтрСимвол = ОбщийМодульВызовСервера.КонтрольныйСимволEAN(ШК,13);
	ШтрихКод = ШК + КонтрСимвол;
КонецПроцедуры	

Процедура ОбработатьСделкуБитрикс24()
	
	Если Ссылка.Пустая() Тогда
		
		ОбработатьСделкуБитриксНаСервере();
		
	Иначе
		
		Если ЕстьИзмененияВЗаказе() Тогда 
			ОбработатьСделкуБитриксНаСервереИзменение();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСделкуБитриксНаСервере()
	
	IDПользователя = РегистрыСведений.Б24_СопоставлениеДанных.ПолучитьДанныеПоСсылке(ПредопределенноеЗначение("Перечисление.Б24_СущностиБитрикс24.user"),Автор);
	IDКонтрагента = РегистрыСведений.Б24_СопоставлениеДанных.ПолучитьДанныеПоСсылке(ПредопределенноеЗначение("Перечисление.Б24_СущностиБитрикс24.crm_company"),Контрагент);
	
	Если IDКонтрагента = Неопределено Тогда
		IDКонтрагента =  РегистрыСведений.Б24_СопоставлениеДанных.ПолучитьДанныеПоСсылке(ПредопределенноеЗначение("Перечисление.Б24_СущностиБитрикс24.crm_contact"),Контрагент);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	НазваниеСделки = "Заказ покупателя №"+Номер+" от " + Дата;
	
	
	Соединение = Новый HTTPСоединение("optceiling.bitrix24.ru", , "33", "ucw4beeptcaxdmst",,, Новый ЗащищенноеСоединениеOpenSSL);
	HTTPЗапрос = Новый HTTPЗапрос("/rest/"+"33"+"/ucw4beeptcaxdmst/crm.deal.add.json/");
	HTTPЗапрос.УстановитьТелоИзСтроки("?fields[TITLE]="+НазваниеСделки+"&fields[ASSIGNED_BY_ID]="+Строка(IDПользователя)+"&fields[COMPANY_ID]="+Строка(IDКонтрагента)+"&fields[CONTACT_ID]="+Строка(IDКонтрагента)+"&fields[OPPORTUNITY]="+СтрЗаменить(Строка(СуммаДокумента),Символы.НПП,"")+"&params[REGISTER_SONET_EVENT]=N");
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);   
	СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
	СтруктураОтвета = фПрочитатьJSON(СтрокаJSON);
	
	Если СтруктураОтвета.Свойство("result") Тогда
		
		ID_СделкиВБитрикс = СтруктураОтвета.result;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработатьСделкуБитриксНаСервереИзменение()
	
		
    IDПользователя = РегистрыСведений.Б24_СопоставлениеДанных.ПолучитьДанныеПоСсылке(ПредопределенноеЗначение("Перечисление.Б24_СущностиБитрикс24.user"),УДАЛИТЬ_Ответственный);
	IDКонтрагента = РегистрыСведений.Б24_СопоставлениеДанных.ПолучитьДанныеПоСсылке(ПредопределенноеЗначение("Перечисление.Б24_СущностиБитрикс24.crm_company"),Контрагент);
	
	Если IDКонтрагента = Неопределено Тогда
		IDКонтрагента =  РегистрыСведений.Б24_СопоставлениеДанных.ПолучитьДанныеПоСсылке(ПредопределенноеЗначение("Перечисление.Б24_СущностиБитрикс24.crm_contact"),УДАЛИТЬ_Ответственный);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	НазваниеСделки = "Заказ покупателя №"+Номер+" от " + Дата;
	
	
	Соединение = Новый HTTPСоединение("optceiling.bitrix24.ru", , "33", "ucw4beeptcaxdmst",,, Новый ЗащищенноеСоединениеOpenSSL);
	АйДиСделкиБезПробела = СтрЗаменить(Строка(ID_СделкиВБитрикс),Символы.НПП,"");
//upadgtd3gnmlvxx5
	HTTPЗапрос = Новый HTTPЗапрос("/rest/"+"33"+"/ucw4beeptcaxdmst/crm.deal.update.json/?id="+АйДиСделкиБезПробела);

	СтрокаЗапроса = СтрЗаменить(СокрЛП("&fields[OPPORTUNITY]="+СтрЗаменить(Строка(СуммаДокумента),Символы.НПП,"")),Символы.НПП,"");
    HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);

    HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);   
	СтрокаJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
	СтруктураОтвета = фПрочитатьJSON(СтрокаJSON);
	
КонецПроцедуры

Функция СтруктураВJson(СтруктураПолей, ПараметрыПреобразования = Неопределено) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(
		ЗаписьJSON, 
		СтруктураПолей);
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Функция фПрочитатьJSON(ТекстJSON) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Структура = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
	Чтение.Закрыть();
	Возврат Структура;
КонецФункции

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	Результат = Новый Структура;
	
	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			Возврат Результат;
			ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции 

Функция ЗаполнитьМассивИзОтветаJSON(Знач Чтение)
	Результат = Новый Массив;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта Тогда 
			Результат.Добавить(ЗаполнитьСтруктуруИзОтветаJSON(Чтение));
		ИначеЕсли Тип = ТипЗначенияJSON.КонецМассива Тогда 
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции

Функция ЕстьИзмененияВЗаказе()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить().Выбрать();
	
	ЕстьИзменения = Ложь;
	
	Если Результат.Следующий() Тогда
		
		Если СуммаДокумента <> Результат.СуммаДокумента Тогда 
			ЕстьИзменения = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьИзменения;
	
КонецФункции

Функция ПолучитьПользователейПоКонтрагенту(КонтрагентПользователя)
	
	ПользователиКонтрагента = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.КонтрагентПользователя = &КонтрагентПользователя";
	
	Запрос.УстановитьПараметр("КонтрагентПользователя", КонтрагентПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПользователиКонтрагента.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат ПользователиКонтрагента;

КонецФункции	

Функция ОтправитьСообщениеВОбсуждения(лПользователь, Ссылка) 
	УстановитьПривилегированныйРежим(Истина);
	Отбор = Новый ОтборОбсужденийСистемыВзаимодействия;
	Отбор.Ключ = "Ошибки";
	Обсуждения = СистемаВзаимодействия.ПолучитьОбсуждения(Отбор);
	
	Если Обсуждения.Количество() > 0 Тогда
		Обсуждение = Обсуждения[0];
	Иначе
		Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение(); 
		Обсуждение.Отображаемое = Истина;
		Обсуждение.Заголовок = "Ошибки";
		Обсуждение.Ключ = "Ошибки";
		Обсуждение.Участники.Добавить(СистемаВзаимодействия.СтандартныеПользователи.ВсеПользователиПриложения);
		Обсуждение.Записать();             
	КонецЕсли;	                     
	
	ИдПользователяСВ = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(лПользователь.ИдентификаторПользователяИБ);
	
	ТекстСообщения = "Пользователь " + Ссылка.Автор + " создал " + Ссылка + " на Контрагента " +  Ссылка.Контрагент + "
	|Ссылка: 
	|" + ПолучитьНавигационнуюСсылку(Ссылка);
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор); 
	Сообщение.Текст = ТекстСообщения; 
	Сообщение.Получатели.Добавить(ИдПользователяСВ);
	Сообщение.Записать();
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Истина;
	
КонецФункции	




