
Процедура ВыполнитьЗагрузку() Экспорт
	 СоздатьПлатежныеДокументыПоБанку(ПолучитьВыпискуДляЗагрузкиПП());
КонецПроцедуры

#Область Блок_получения_и_обновления_токена_Банка_Точка

Функция ПолучитьНаборКлючейДляСБП() Экспорт 
	
	НаборКлючей = Новый Структура();
	НаборКлючей.Вставить("sbp_accesstoken_hybrid", Константы.НВД_sbp_accesstoken_hybrid.Получить()); 
	НаборКлючей.Вставить("sbp_accesstoken_client", Константы.НВД_sbp_accesstoken_client.Получить());
	НаборКлючей.Вставить("sbp_refreshtoken_hybrid", Константы.НВД_sbp_refreshtoken_hybrid.Получить());
	НаборКлючей.Вставить("sbp_client_id", Константы.НВД_sbp_client_id.Получить());
	НаборКлючей.Вставить("sbp_client_secret", Константы.НВД_sbp_client_secret.Получить());
	БанкДляСБПТочкаБанк = Константы.НВД_ОсновнойБанковскийСчетДляСБП.Получить();
	sbp_account_code = "" + БанкДляСБПТочкаБанк.НомерСчета + "/" + БанкДляСБПТочкаБанк.БИК; 
	НаборКлючей.Вставить("sbp_account_code", sbp_account_code);
	НаборКлючей.Вставить("sbp_merchant_id", Константы.НВД_sbp_merchant_id.Получить());
	НаборКлючей.Вставить("sbp_legalId", Константы.НВД_sbp_legalId.Получить());
	НаборКлючей.Вставить("sbp_customerCode", Константы.НВД_sbp_customerCode.Получить());
	НаборКлючей.Вставить("sbp_callback", Константы.НВД_sbp_callback.Получить());
	НаборКлючей.Вставить("sbp_url_service", Константы.НВД_sbp_url_service.Получить());
	НаборКлючей.Вставить("sbp_port_service", Константы.НВД_sbp_port_service.Получить());	
	НаборКлючей.Вставить("sbp_type_service", Константы.НВД_sbp_type_service.Получить()); 
	
	Возврат НаборКлючей;
	
КонецФункции

Процедура ЗаписатьНовыйНаборКлючейСБП(НаборКлючей) Экспорт 
	
	Константы.НВД_sbp_accesstoken_hybrid.Установить(НаборКлючей.sbp_accesstoken_hybrid);
	Константы.НВД_sbp_accesstoken_client.Установить(НаборКлючей.sbp_accesstoken_client);
	Константы.НВД_sbp_refreshtoken_hybrid.Установить(НаборКлючей.sbp_refreshtoken_hybrid);
	Константы.НВД_sbp_client_id.Установить(НаборКлючей.sbp_client_id);
	Константы.НВД_sbp_client_secret.Установить(НаборКлючей.sbp_client_secret);
	Константы.НВД_sbp_account_code.Установить(НаборКлючей.sbp_account_code);
	Константы.НВД_sbp_merchant_id.Установить(НаборКлючей.sbp_merchant_id);
	Константы.НВД_sbp_legalId.Установить(НаборКлючей.sbp_legalId);
	Константы.НВД_sbp_customerCode.Установить(НаборКлючей.sbp_customerCode);
	
КонецПроцедуры

Функция ОбновитьТокенAPIБанкТочка(НаборКлючей) Экспорт
	
	СтрокаЗапроса = "/connect/token";
	
	СтрокаBodyParametrs = "client_id=" + НаборКлючей.client_id + "&client_secret=" + НаборКлючей.client_secret + "&grant_type=refresh_token&refresh_token=" + НаборКлючей.refreshtoken_hybrid;
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовокHTTP.Вставить("accept", "application/json");
	ЗаголовокHTTP.Вставить("type", "POST");
	ЗаголовокHTTP.Вставить("dataType", "json");
	
	Попытка
		Соединение = Новый HTTPСоединение("enter.tochka.com", 443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса, ЗаголовокHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаBodyParametrs, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		ОтветСервера = Соединение.ОтправитьДляОбработки(HTTPЗапрос); 
		ОтветСтрокой = ОтветСервера.ПолучитьТелоКакСтроку("UTF-8");
	
		Текст = НаборКлючей.account_code + "Запрос Точка банк. Обновить Токены. Код состояния: " + ОтветСервера.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";	
		Ответ = ОпределитьОтвет(ОтветСервера, Текст, ОтветСтрокой);
		НаборКлючей.refreshtoken_hybrid = Ответ.refresh_token;
		НаборКлючей.accesstoken_hybrid = Ответ.access_token;
	Исключение
		ТекстОшибки = "Связь с сервером не установлена " + ОписаниеОшибки() + "";
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
	

	
	Возврат НаборКлючей;
	
	
КонецФункции	

Функция ПолучитьТокенБанкТочка(НаборКлючей) Экспорт
	
	Токен = НаборКлючей.accesstoken_hybrid; //время жизни токена может уже истекло, поэтому проверяем на работоспособность
	
	СтрокаЗапроса = "/connect/introspect";	
	//СтрокаBodyParametrs = "client_id=" + client_id + "&client_secret=" + client_secret + "&grant_type=refresh_token&refresh_token=" + refresh_token;
	СтрокаBodyParametrs = "access_token=" + НаборКлючей.accesstoken_hybrid;
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовокHTTP.Вставить("accept", "application/json");
	ЗаголовокHTTP.Вставить("type", "POST");
	ЗаголовокHTTP.Вставить("dataType", "json");
	ЗаголовокHTTP.Вставить("Authorization", "Bearer " + НаборКлючей.accesstoken_client);
	
	Попытка
		Соединение = Новый HTTPСоединение("enter.tochka.com", 443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса, ЗаголовокHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаBodyParametrs, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		ОтветСервера = Соединение.ОтправитьДляОбработки(HTTPЗапрос); 
	Исключение
		ТекстОшибки = "Связь с сервером не установлена " + ОписаниеОшибки() + "";
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
	
	ОтветСтрокой = ОтветСервера.ПолучитьТелоКакСтроку("UTF-8");
	
	Текст = "Запрос Точка банк. Получение выписки. Код состояния: " + ОтветСервера.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
	
	//JWT_DecodeAtServer(СтрЗаменить(ОтветСтрокой, """",""), Токен);
	
	Если СтрНайти(ОтветСтрокой,"Token not found") > 0 Тогда //токен не рабочий, обновляем его
		НаборКлючей = ОбновитьТокенAPIБанкТочка(НаборКлючей);
	КонецЕсли;	
	Возврат НаборКлючей;
	
КонецФункции	

#КонецОбласти

#Область Инициализация_Таблиц

Функция ИнициализацияТаблицыВедомостиНаВыплатуЗарплаты() Экспорт
	
	ТаблицаПлатежейВедомостиНаВыплатуЗарплаты = Новый ТаблицаЗначений;
	ТаблицаПлатежейВедомостиНаВыплатуЗарплаты.Колонки.Добавить("Ведомость", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(10)));
	ТаблицаПлатежейВедомостиНаВыплатуЗарплаты.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПлатежейВедомостиНаВыплатуЗарплаты.Колонки.Добавить("IDВедомостиНаВыплатуЗарплаты", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(40)));
	
	Возврат ТаблицаПлатежейВедомостиНаВыплатуЗарплаты;
КонецФункции

Функция ИнициализацияТаблицыРасшифровкаПлатежа() Экспорт
	
	ТаблицаПлатежейРасшифровкаПлатежа = Новый ТаблицаЗначений;
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("СтатьяДвиженияДенежныхСредств", Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	
	СписокТиповАналитикаАктивовПассивов = Новый Массив;
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Номенклатура");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Организации");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.СтруктураПредприятия");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.БанковскиеСчетаОрганизаций");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Контрагенты");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Партнеры");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.ПрочиеАктивыПассивы");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.ФизическиеЛица");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Склады");
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("ОснованиеПлатежа", Новый ОписаниеТипов(СтрСоединить(СписокТиповАналитикаАктивовПассивов,",")));
	
	СписокТипов = Новый Массив;
	//СписокТипов.Добавить("ДокументСсылка");
	СписокТипов.Добавить("ДокументСсылка.ВозвратТоваровОтКлиента");
	СписокТипов.Добавить("ДокументСсылка.ПоступлениеТоваровУслуг");
	СписокТипов.Добавить("ДокументСсылка.ТаможеннаяДекларацияИмпорт");
	СписокТипов.Добавить("ДокументСсылка.ОтчетКомиссионера");
	СписокТипов.Добавить("ДокументСсылка.ЗаказПоставщику");
	СписокТипов.Добавить("ДокументСсылка.ВозвратТоваровПоставщику");
	СписокТипов.Добавить("СправочникСсылка.ДоговорыКонтрагентов");
	СписокТипов.Добавить("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями");
	СписокТипов.Добавить("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента");
	СписокТипов.Добавить("ДокументСсылка.ОтчетКомитенту");
	СписокТипов.Добавить("ДокументСсылка.РеализацияУслугПрочихАктивов");
	СписокТипов.Добавить("ДокументСсылка.РеализацияТоваровУслуг");
	СписокТипов.Добавить("ДокументСсылка.ОтчетКомитентуОСписании");
	СписокТипов.Добавить("ДокументСсылка.ВыкупВозвратнойТарыКлиентом");
	СписокТипов.Добавить("ДокументСсылка.ПоступлениеУслугПрочихАктивов");
	СписокТипов.Добавить("ДокументСсылка.АктВыполненныхРабот");
	СписокТипов.Добавить("ДокументСсылка.ПередачаТоваровМеждуОрганизациями");
	СписокТипов.Добавить("ДокументСсылка.ВыкупВозвратнойТарыУПоставщика");
	СписокТипов.Добавить("ДокументСсылка.ЗаказКлиента");
	СписокТипов.Добавить("ДокументСсылка.CRM_Событие");
	
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("Заказ", Новый ОписаниеТипов(СтрСоединить(СписокТипов,",")));
	
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("ВалютаВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("СуммаВзаиморасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("СтатьяДоходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиДоходов"));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	
	СписокТиповАналитикаДоходов = Новый Массив;
	СписокТиповАналитикаДоходов.Добавить("ДокументСсылка.ЗаказПоставщику");
	СписокТиповАналитикаДоходов.Добавить("ПеречислениеСсылка.АналитикаКурсовыхРазниц");
	СписокТиповАналитикаДоходов.Добавить("СправочникСсылка.Организации");
	СписокТиповАналитикаДоходов.Добавить("СправочникСсылка.СтруктураПредприятия");
	СписокТиповАналитикаДоходов.Добавить("СправочникСсылка.ДоговорыКредитовИДепозитов");
	СписокТиповАналитикаДоходов.Добавить("СправочникСсылка.Партнеры");
	СписокТиповАналитикаДоходов.Добавить("СправочникСсылка.НаправленияДеятельности");
	
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("АналитикаДоходов", Новый ОписаниеТипов(СтрСоединить(СписокТиповАналитикаДоходов,",")));
	
	СписокТиповАналитикаРасходов = Новый Массив;
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.МаркетинговыеМероприятия");
	СписокТиповАналитикаРасходов.Добавить("ДокументСсылка.ПоступлениеТоваровУслуг");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.Номенклатура");
	СписокТиповАналитикаРасходов.Добавить("ДокументСсылка.ЗаказПоставщику");
	СписокТиповАналитикаРасходов.Добавить("ПеречислениеСсылка.АналитикаКурсовыхРазниц");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.Организации");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.СтруктураПредприятия");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.ДоговорыКредитовИДепозитов");
	СписокТиповАналитикаРасходов.Добавить("ДокументСсылка.ПеремещениеТоваров");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.Партнеры");
	СписокТиповАналитикаРасходов.Добавить("ДокументСсылка.ЗаказНаПеремещение");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.ДоговорыЭквайринга");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.СделкиСКлиентами");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.НаправленияДеятельности");
	СписокТиповАналитикаРасходов.Добавить("ДокументСсылка.ПередачаТоваровМеждуОрганизациями");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.ФизическиеЛица");
	СписокТиповАналитикаРасходов.Добавить("ДокументСсылка.ЗаказКлиента");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.Проекты");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.Склады");
	СписокТиповАналитикаРасходов.Добавить("СправочникСсылка.ПрочиеРасходы");
	
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("АналитикаРасходов", Новый ОписаниеТипов(СтрСоединить(СписокТиповАналитикаРасходов,",")));
	
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("ПериодВозникновенияРасхода", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("ДоговорКредитаДепозита", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКредитовИДепозитов"));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(36)));
	ТаблицаПлатежейРасшифровкаПлатежа.Колонки.Добавить("IDРасшифровкаПлатежа",         Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(40)));
	
	Возврат ТаблицаПлатежейРасшифровкаПлатежа;
КонецФункции	

Функция ИнициализацияТаблицыПлатежей() Экспорт
	
	ТаблицаПлатежей = Новый ТаблицаЗначений; 
	ТаблицаПлатежей.Колонки.Добавить("КредитДебитИндикатор", Новый ОписаниеТипов("Строка"));
	ТаблицаПлатежей.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаПлатежей.Колонки.Добавить("БанковскийСчет", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций"));
	ТаблицаПлатежей.Колонки.Добавить("ТипПлатежногоДокумента", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыПлатежныхДокументов"));
	ТаблицаПлатежей.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
	ТаблицаПлатежей.Колонки.Добавить("СуммаДокумента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПлатежей.Колонки.Добавить("Контрагент",  Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаПлатежей.Колонки.Добавить("БанковскийСчетКонтрагента", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаКонтрагентов"));
	ТаблицаПлатежей.Колонки.Добавить("БанковскийСчетПолучатель", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций"));
	ТаблицаПлатежей.Колонки.Добавить("ПодотчетноеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаПлатежей.Колонки.Добавить("ЗаявкаНаРасходованиеДенежныхСредств", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств"));
	ТаблицаПлатежей.Колонки.Добавить("РаспоряжениеНаПеремещениеДенежныхСредств", Новый ОписаниеТипов("ДокументСсылка.РаспоряжениеНаПеремещениеДенежныхСредств"));
	ТаблицаПлатежей.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(210)));
	ТаблицаПлатежей.Колонки.Добавить("АвансовыйОтчет", Новый ОписаниеТипов("ДокументСсылка.АвансовыйОтчет"));
	ТаблицаПлатежей.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаПлатежей.Колонки.Добавить("ВидПлатежа", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(15)));
	ТаблицаПлатежей.Колонки.Добавить("ОчередностьПлатежа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПлатежей.Колонки.Добавить("ПеречислениеВБюджет", Новый ОписаниеТипов("Булево"));
	ТаблицаПлатежей.Колонки.Добавить("ВидПеречисленияВБюджет", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПеречисленийВБюджет"));
	ТаблицаПлатежей.Колонки.Добавить("СтатусСоставителя", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(2)));
	ТаблицаПлатежей.Колонки.Добавить("КодБК", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(20)));
	ТаблицаПлатежей.Колонки.Добавить("КодОКАТО", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(11)));
	ТаблицаПлатежей.Колонки.Добавить("ПоказательОснования", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(2)));
	ТаблицаПлатежей.Колонки.Добавить("ПоказательПериода", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(10)));
	ТаблицаПлатежей.Колонки.Добавить("ПоказательНомера", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(18)));
	ТаблицаПлатежей.Колонки.Добавить("ПоказательДаты", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(10)));
	ТаблицаПлатежей.Колонки.Добавить("ПоказательТипа", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(2)));
	ТаблицаПлатежей.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(300)));
	ТаблицаПлатежей.Колонки.Добавить("ДатаВходящегоДокумента", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаПлатежей.Колонки.Добавить("НомерВходящегоДокумента", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(11)));
	ТаблицаПлатежей.Колонки.Добавить("СтатьяДвиженияДенежныхСредств", Новый ОписаниеТипов("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	ТаблицаПлатежей.Колонки.Добавить("СписаниеБезналичныхДенежныхСредств", Новый ОписаниеТипов("ДокументСсылка.СписаниеБезналичныхДенежныхСредств"));
	ТаблицаПлатежей.Колонки.Добавить("ВалютаКонвертации", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаПлатежей.Колонки.Добавить("КурсКонвертации", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 4, ДопустимыйЗнак.Любой)));
	ТаблицаПлатежей.Колонки.Добавить("СуммаПослеКонвертации", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПлатежей.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТаблицаПлатежей.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(11)));
	ТаблицаПлатежей.Колонки.Добавить("ДатаВедомостиНаВыплатуЗарплаты", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаПлатежей.Колонки.Добавить("СтатьяАктивовПассивов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
	
	СписокТиповАналитикаАктивовПассивов = Новый Массив;
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Номенклатура");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Организации");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.СтруктураПредприятия");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.БанковскиеСчетаОрганизаций");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Контрагенты");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Партнеры");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.ПрочиеАктивыПассивы");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.ФизическиеЛица");
	СписокТиповАналитикаАктивовПассивов.Добавить("СправочникСсылка.Склады");
	
	ТаблицаПлатежей.Колонки.Добавить("АналитикаАктивовПассивов", Новый ОписаниеТипов(СтрСоединить(СписокТиповАналитикаАктивовПассивов,",")));
	
	СписокТипов = Новый Массив;
	СписокТипов.Добавить("ДокументСсылка.ВозвратТоваровПоставщику");
	СписокТипов.Добавить("ДокументСсылка.РеализацияУслугПрочихАктивов");
	СписокТипов.Добавить("ДокументСсылка.РеализацияТоваровУслуг");
	СписокТипов.Добавить("ДокументСсылка.АвансовыйОтчет");
	СписокТипов.Добавить("ДокументСсылка.СчетНаОплатуКлиенту");
	СписокТипов.Добавить("ДокументСсылка.ВыкупВозвратнойТарыКлиентом");
	СписокТипов.Добавить("ДокументСсылка.АктВыполненныхРабот");
	СписокТипов.Добавить("ДокументСсылка.ОжидаемоеПоступлениеДенежныхСредств");
	СписокТипов.Добавить("ДокументСсылка.ЗаказКлиента");
	СписокТипов.Добавить("ДокументСсылка.CRM_Событие");
	СписокТипов.Добавить("ДокументСсылка.ВыемкаДенежныхСредствИзКассыККМ");
	ТаблицаПлатежей.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(СтрСоединить(СписокТипов,",")));
	
	ТаблицаПлатежей.Колонки.Добавить("IDРасшифровкаПлатежа",         Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(40)));
	ТаблицаПлатежей.Колонки.Добавить("IDВедомостиНаВыплатуЗарплаты", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(40)));
	
	Возврат ТаблицаПлатежей;
КонецФункции

#КонецОбласти

//Процедура ЗаполнитьТаблицуПоРасчетамСПартнерами(Организация, 
//	Валюта, 
//	Контрагент, 
//	Партнер, 
//	ХозяйственнаяОперация, 
//	ДатаДокумента, 
//	ТаблицаОстатковРасчетов, 
//	СуммаДокумента) Экспорт
//	
//	МассивРасчетыСПоставщиками = Новый Массив;
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика);
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеТаможне);
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику);
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности);
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности);
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию);
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.АвансовыйОтчет);
//	МассивРасчетыСПоставщиками.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями);
//	ЕстьРасчетыСПоставщиками = МассивРасчетыСПоставщиками.Найти(ХозяйственнаяОперация) <> Неопределено;
//	
//	МассивРасчетыСКлиентами = Новый Массив;
//	МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
//	МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
//	МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента);
//	МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя);
//	МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности);
//	МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности);
//	МассивРасчетыСКлиентами.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию);
//	ЕстьРасчетыСКлиентами = МассивРасчетыСКлиентами.Найти(ХозяйственнаяОперация) <> Неопределено;
//	
//	Если ЕстьРасчетыСКлиентами ИЛИ ЕстьРасчетыСПоставщиками Тогда
//		Реквизиты = Новый Структура("Дата, Организация, СуммаДокумента, Валюта, Контрагент, Партнер, ХозяйственнаяОперация",
//		ДатаДокумента,
//		Организация,
//		СуммаДокумента,
//		Валюта,
//		Контрагент,
//		Партнер,
//		ХозяйственнаяОперация);
//		
//		АдресПлатежейВХранилище = "";
//		
//		ВзаиморасчетыСервер.ЗаполнитьТаблицуОстатковРасчетов(Реквизиты, АдресПлатежейВХранилище, ТаблицаОстатковРасчетов);
//	Иначе	
//		ТаблицаОстатковРасчетов = Новый ТаблицаЗначений;
//		ТаблицаОстатковРасчетов.Колонки.Добавить("Заказ", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
//		ТаблицаОстатковРасчетов.Колонки.Добавить("ВалютаВзаиморасчетов", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//		ТаблицаОстатковРасчетов.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
//		
//	КонецЕсли;
//	
//КонецПроцедуры

Функция ПолучитьТипПлатежногоДокумента(TypeCode="") Экспорт
	
	ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение; //значение по умолчанию
	Если TypeCode = "" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	ИначеЕсли TypeCode = "Неопределенное значение" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	ИначеЕсли TypeCode = "Платежное поручение" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;	
	ИначеЕсли TypeCode = "Платежное требование" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование;	
	ИначеЕсли TypeCode = "Денежный чек, РКО" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер;
	ИначеЕсли TypeCode = "Объявление на взнос наличными, ПКО" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер;
	ИначеЕсли TypeCode = "Требование-поручение" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеТребование;
	ИначеЕсли TypeCode = "Инкассовое поручение" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ИнкассовоеПоручение;
	ИначеЕсли TypeCode = "Расчетный чеке" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер;
	ИначеЕсли TypeCode = "Аккредитив" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.Аккредитив;
	ИначеЕсли TypeCode = "Мемориальный ордер" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер;
	ИначеЕсли TypeCode = "Погашение кредита" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер;
	ИначеЕсли TypeCode = "Выдача кредита" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер;
	ИначеЕсли TypeCode = "Авизо" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер;
	ИначеЕсли TypeCode = "Банковские карты" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер;
	ИначеЕсли TypeCode = "Платежный ордер" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер;
	ИначеЕсли TypeCode = "Банковский ордер" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер;	
	ИначеЕсли TypeCode = "Ордер по передаче ценностей" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер;
	ИначеЕсли TypeCode = "Программный ордер" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер;
	ИначеЕсли TypeCode = "Импортированная запись" Тогда
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер;
	Иначе
		ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	КонецЕсли;
	
	Возврат ТипПлатежногоДокумента;
КонецФункции	

Функция ПолучитьХозяйственнуюОперацию(КредитДебитИндикатор, НазначениеПлатежа) Экспорт
	НазначениеПлатежа = ВРег(НазначениеПлатежа);
	Если КредитДебитИндикатор = "Debit" Тогда
		Если (СтрНайти(НазначениеПлатежа, ВРег("Возврат ДС покупателю")) > 0) Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
		ИначеЕсли (СтрНайти(НазначениеПлатежа, ВРег("Заработная плата по трудовому договору")) > 0) И (СтрНайти(НазначениеПлатежа, ВРег("согласно реестру зачислений"))) Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыПоВедомостям;
		ИначеЕсли СтрНайти(НазначениеПлатежа, ВРег("Заработная плата по трудовому договору")) > 0 Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета;
		ИначеЕсли СтрНайти(НазначениеПлатежа, ВРег("другой счет")) > 0 Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет;
		ИначеЕсли (СтрНайти(НазначениеПлатежа, ВРег("Налог")) > 0) ИЛИ (СтрНайти(НазначениеПлатежа, ВРег("Страховые взносы")) > 0) 
			ИЛИ (СтрНайти(НазначениеПлатежа, ВРег("Взносы в ФСС")) > 0) 
			ИЛИ (СтрНайти(НазначениеПлатежа, ВРег("НДФЛ")) > 0) Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;
		ИначеЕсли СтрНайти(НазначениеПлатежа, ВРег("Подотчет")) > 0 Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику;
		ИначеЕсли СтрНайти(НазначениеПлатежа, ВРег("")) > 0 Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
		Иначе 
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств;
		КонецЕсли;	
	ИначеЕсли КредитДебитИндикатор = "Credit" Тогда
		Если (СтрНайти(НазначениеПлатежа, ВРег("Возврат")) > 0) ИЛИ (СтрНайти(НазначениеПлатежа, ВРег("Возврат ДС покупателю")) > 0) Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика;
		ИначеЕсли (СтрНайти(НазначениеПлатежа, ВРег("Подотчет")) > 0) Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника;
		ИначеЕсли (СтрНайти(НазначениеПлатежа, ВРег("Оплата по счету")) > 0)
			или (СтрНайти(НазначениеПлатежа, ВРег("Счет на оплату")) > 0) 
			или (СтрНайти(НазначениеПлатежа, ВРег("согласно сч.")) > 0) 
			или (СтрНайти(НазначениеПлатежа, ВРег("Оплата Заказа")) > 0)
			или (СтрНайти(НазначениеПлатежа, ВРег("Предоплата")) > 0)
			или (СтрНайти(НазначениеПлатежа, ВРег("Предоплата")) > 0) 
			или (СтрНайти(НазначениеПлатежа, ВРег("по счету")) > 0)
			или (СтрНайти(НазначениеПлатежа, ВРег("заказ")) > 0)
			или (СтрНайти(НазначениеПлатежа, ВРег("ОПЛАТА ПО СЧ")) > 0)
			или (СтрНайти(НазначениеПлатежа, ВРег("ПО QR КОДУ ID")) > 0)
			Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
		Иначе 
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочееПоступлениеДенежныхСредств;
		Конецесли;
	КонецЕсли;
	Возврат ХозяйственнаяОперация; 
КонецФункции

Функция ПолучитьКонтрагента(Заказ="", ИНН="", КППКонтрагента="", НаименованиеКонтрагента="") Экспорт
	
	Если Не ЗначениеЗаполнено(Заказ) Тогда  //ищем контрагента по инн
		Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СОКРЛП(ИНН));
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда //Создаем контрагента
			НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйКонтрагент.ИНН = ИНН;
			НовыйКонтрагент.КПП = КППКонтрагента;
			НовыйКонтрагент.НаименованиеПолное = НаименованиеКонтрагента;
			Если СтрДлина(НовыйКонтрагент.ИНН) > 10 Тогда
				НовыйКонтрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
				Если (СтрНайти(ВРег(НовыйКонтрагент.НаименованиеПолное), "ИП") > 0) ИЛИ (СтрНайти(ВРег(НовыйКонтрагент.НаименованиеПолное), "ИНДИВИДУАЛЬНЫЙ ПРЕДПРИНИМАТЕЛЬ") > 0) Тогда
					НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;
				Иначе
					НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
				КонецЕсли;	
			Иначе
				НовыйКонтрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
				НовыйКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			Конецесли;
			Попытка
				НовыйКонтрагент.Записать(); 
				Контрагент = НовыйКонтрагент.Ссылка;
			Исключение
				ТекстОшибки = "Ошибка при записи нового контрагента " + ОписаниеОшибки() + "";
				Сообщить(ТекстОшибки, СтатусСообщения.Важное);
				ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
				Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			КонецПопытки;
		КонецЕсли;
		

	Иначе // ищем контрагента по заказу
		Контрагент = ПолучитьКонтрагентаВладельца(Заказ.Партнер);
	КонецЕсли;
	
	Возврат Контрагент;
КонецФункции

Функция ПолучитьСтатьюДДС(Документ) Экспорт
	
	СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	
	Если Документ.КредитДебитИндикатор = "Debit" Тогда
		//Списание
		Если Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
			НайденнаяСтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Налог");
			Если НЕ НайденнаяСтатьяДДС = Неопределено Тогда
				СтатьяДДС = НайденнаяСтатьяДДС;
			Конецесли;
		ИначеЕсли Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
			СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВозвратОплатыКлиенту;
		ИначеЕсли Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику Тогда
			Если СтрНайти(ВРег(Документ.НазначениеПлатежа),"КОМИССИЯ ЗА ЗАЧИСЛЕНИЕ ПЕРЕВОДА ПО СБП") > 0 Тогда 
				НайденнаяСтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Услуги банка");
				Если НЕ НайденнаяСтатьяДДС = Неопределено Тогда
					СтатьяДДС = НайденнаяСтатьяДДС;
				Конецесли;
			Иначе
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику;	
			КонецЕсли;	
		ИначеЕсли Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику Тогда
			НайденнаяСтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Выдача ДС подотчетнику");
			Если НЕ НайденнаяСтатьяДДС = Неопределено Тогда
				СтатьяДДС = НайденнаяСтатьяДДС;
			Конецесли;
		ИначеЕсли Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет Тогда
			СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ПеречислениеДенежныхСредствНаДругойСчет;
		ИначеЕсли Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыПоВедомостям Тогда
			СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты;
		ИначеЕсли Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗаработнойПлатыРаботнику Тогда
			СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты;
		Иначе
			СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		КонецЕсли;	
	Иначе
		//приход
		Если Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника Тогда
			НайденнаяСтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Оплата товаров");
			Если НЕ НайденнаяСтатьяДДС = Неопределено Тогда
				СтатьяДДС = НайденнаяСтатьяДДС;
			Конецесли;
		ИначеЕсли Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
			СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		ИначеЕсли Документ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика Тогда
			СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствОтПоставщика;
		Иначе
			Если СтрНайти(ВРег(Документ.НазначениеПлатежа), "ПЛАТЕЖНЫХ КАРТ ПО ТЕРМИНАЛУ") > 0 Тогда
				НайденнаяСтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Эквайринг");
				Если НЕ НайденнаяСтатьяДДС = Неопределено Тогда
					СтатьяДДС = НайденнаяСтатьяДДС;
				КонецЕсли;
			ИначеЕсли СтрНайти(ВРег(Документ.НазначениеПлатежа), "ПО QR КОДУ ID") > 0 Тогда
				СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
			Конецесли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат СтатьяДДС;
КонецФункции

Функция ПолучитьВыпискуПоСчетуV3(Данные)
	
	ДатаНач = НачалоДня(ТекущаяДата()-60*60*24*3); //берем 10 дней, на тот случай если были выходные и если какая то из транзакций долго находится в статусе "в процессе"	 
	
	ДатаКон = КонецДня(ТекущаяДата());
	
	//ДатаНач = НачалоДня(Дата(2021,09,20));	 
	//
	//ДатаКон = КонецДня(Дата(2021,09,20));
	
	ТекстС = "Запуск API Точка банк. Запрос выписки по " + Данные.НаборКлючей.account_code;
	Сообщить(ТекстС);
	ЗаписьЖурналаРегистрации(ТекстС, УровеньЖурналаРегистрации.Информация);
	СтрокаЗапроса = "uapi/open-banking/v1.0/statements";	 //https://enter.tochka.com/uapi/open-banking/{apiVersion}/statements
	
	
	СтруктураСтр = Новый Структура; 
	СтруктураСтр.Вставить("accountId", Данные.НаборКлючей.account_code); //Номер счета	
	СтруктураСтр.Вставить("startDateTime", Формат(ДатаНач, "ДФ=yyyy-MM-dd"));         //"Дата окончания срока выписки, формат даты ГГГГ-ММ-ДД"
	СтруктураСтр.Вставить("endDateTime", Формат(КонецДня(ДатаКон), "ДФ=yyyy-MM-dd")); //"Дата начала срока выписки, формат даты ГГГГ-ММ-ДД"
	
	СтруктураStatement = Новый Структура;
	СтруктураStatement.Вставить("Statement", СтруктураСтр);
	
	СтруктураData = Новый Структура;
	СтруктураData.Вставить("Data", СтруктураStatement);
	
	СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(СтруктураData);
	
	HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса,СтрокаJSON, , Данные.НаборКлючей.accesstoken_hybrid, Данные.НаборКлючей.account_code);
	
	ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	Текст = "Запрос Точка банк. Получение выписки. Для организации " + Данные.Организация + ". Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
	
	Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
	
	Если СтрНайти(ОтветСтрокой,"token is missing") > 0 Тогда //токен не рабочий, обновляем его
		
		Данные.НаборКлючей = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ОбновитьТокенAPIБанкТочка(Данные.НаборКлючей)));
		HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса,СтрокаJSON, , Данные.НаборКлючей.accesstoken_hybrid, Данные.НаборКлючей.account_code);
		
		ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
		Текст = "Запрос Точка банк. Получение выписки. Для организации " + Данные.Организация + ". Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
		
		Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
		
	КонецЕсли;
	
	Попытка
		request_id = Ответ.Data.Statement.statementId;
	Исключение
		Возврат ложь;
	КонецПопытки;	
	//Сообщить(request_id);          
	
	ОтветГотов = Ложь;
	ТекДата = ТекущаяДата();
	Инд = 2;
	Пока Истина Цикл
		
		Если ТекущаяДата() > (ТекДата + 20) ИЛИ ОтветГотов Тогда 
			
			Прервать;
			
		ИначеЕсли ТекущаяДата() = ТекДата+Инд Тогда 
			
			ТекстС = "Запуск API Точка банк. Статус запроса выписки";
			Сообщить(ТекстС);
			ЗаписьЖурналаРегистрации(ТекстС, УровеньЖурналаРегистрации.Информация);
			СтрокаЗапроса = "uapi/open-banking/v1.0/accounts/" + Данные.НаборКлючей.account_code + "/statements/"+request_id+"";	//https://enter.tochka.com/uapi/open-banking/{apiVersion}/accounts/{accountId}/statements/{statementId}
			
			СтруктураСтр = Новый Структура;
			СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(СтруктураСтр);
			
			HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса,СтрокаJSON, "GET", Данные.НаборКлючей.accesstoken_hybrid, Данные.НаборКлючей.account_code);
			
			ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
			Текст = "Запрос Точка банк. Получение статуса выписки. Для организации " + Данные.Организация + ". Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
			
			Если HTTPОтвет.КодСостояния = 200 Тогда
				
				Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
				СтатусВыписки = Ответ.Data.Statement[0].status;
			
				ОтветГотов = СтатусВыписки = "Ready";
			Иначе
				ОтветГотов = Ложь;
				ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Информация);
			КонецЕсли;
			
			Инд = Инд + 2;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Чеки = Новый Массив;
	Если ОтветГотов Тогда
		
		Чеки = Ответ.Data.Statement[0].Transaction;
		
	КонецЕсли;	
	
	Для Каждого Документ Из Чеки Цикл
		
		ТекЗаказ = ПолучитьЗаказПоНомеру(ВРег(Документ.description));
		Если Не ЗначениеЗаполнено(ТекЗаказ) Тогда
			ТекЗаказ = Документы.CRM_Событие.ПустаяСсылка();
			Сообщить(Документ.description);
		КонецЕсли;
		
		
		Если Документ.status = "Pending" Тогда //платежка не подписана
			Продолжить;
		КонецЕсли;	
		НазначениеПлатежаДокумента=НРег(Документ.description);
		КредитДебитИндикатор = Документ.creditDebitIndicator;
		ТипПлатежногоДокумента = ПолучитьТипПлатежногоДокумента(Документ.transactionTypeCode);
		
		Если КредитДебитИндикатор = "Debit" Тогда
			
			ИмяДокумента = "Списание безналичных денежных средств";
			
			Если Документ.CreditorParty.Свойство("inn") Тогда 
				ИННКонтрагента = Документ.CreditorParty.inn;
				Если Документ.CreditorParty.Свойство("kpp") Тогда
					КППКонтрагента = Документ.CreditorParty.kpp;
				Иначе
					КППКонтрагента = "";
				КонецЕсли;
				НаименованиеКонтрагента = Документ.CreditorParty.name;
			Иначе
				ИННКонтрагента = "";
				КППКонтрагента = "";
				НаименованиеКонтрагента = "";
			КонецЕсли;
			
			Если СтрНайти(НазначениеПлатежаДокумента,"возврат")>0 Тогда  
				Контрагент = ПолучитьКонтрагента(ТекЗаказ, ИННКонтрагента, КППКонтрагента, НаименованиеКонтрагента);
			Иначе
				Контрагент = ПолучитьКонтрагента("", ИННКонтрагента, КППКонтрагента, НаименованиеКонтрагента);	
			КонецЕсли;
			
			БСКонтрагентаСтрока = Документ.CreditorAccount.identification;
			БикБанка = Документ.CreditorAgent.identification;
			НаименованиеБанка = Документ.CreditorAgent.name;
		Иначе
			ИмяДокумента = "Поступление безналичных денежных средств";
			Если Документ.DebtorParty.Свойство("inn") Тогда 
				ИННКонтрагента = Документ.DebtorParty.inn;
				Если Документ.DebtorParty.Свойство("kpp") Тогда
					КППКонтрагента = Документ.DebtorParty.kpp;
				Иначе
					КППКонтрагента = "";
				КонецЕсли;	
				НаименованиеКонтрагента = Документ.DebtorParty.name;
			Иначе
				ИННКонтрагента = "";
				КППКонтрагента = "";
				НаименованиеКонтрагента = "";
			КонецЕсли;
			Контрагент = ПолучитьКонтрагента(ТекЗаказ, ИННКонтрагента, КППКонтрагента, НаименованиеКонтрагента);
			БСКонтрагентаСтрока = Документ.DebtorAccount.identification;
			БикБанка = Документ.DebtorAgent.identification;
			НаименованиеБанка = Документ.DebtorAgent.name;
		КонецЕсли;
			
		ТаблицаБанковскихСчетовОрганизаций = ПолучитьСписокБанковскихСчетов();
		НайденныеСчета = ТаблицаБанковскихСчетовОрганизаций.НайтиСтроки(Новый Структура("БИКБанка, НомерСчета", Прав(Данные.НаборКлючей.account_code, СтрДлина(Данные.НаборКлючей.account_code)-СтрНайти(Данные.НаборКлючей.account_code, "/")),Лев(Данные.НаборКлючей.account_code,СтрНайти(Данные.НаборКлючей.account_code, "/")-1)));
		
		//Счет с такими БИКом и НомеромСчета должен быть только один
		Если НайденныеСчета.Количество() > 0 Тогда
			БанковскийСчетОрганизации = НайденныеСчета[0].БанковскийСчет;
		Иначе 
			БанковскийСчетОрганизации = Неопределено;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(БанковскийСчетОрганизации) ТОгда
			БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета", Лев(Данные.НаборКлючей.account_code,СтрНайти(Данные.НаборКлючей.account_code, "/")-1)); 
		КонецЕсли;
		
		Организация = БанковскийСчетОрганизации.Владелец;
		
		БСКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.НайтиПоРеквизиту("НомерСчета", СокрЛП(БСКонтрагентаСтрока));
		
		Если БСКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка() Тогда
			//Создаем счет
			Если НЕ Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				БанковскийСчет = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
				БанковскийСчет.Владелец = Контрагент;
				БанковскийСчет.НомерСчета = СокрЛП(БСКонтрагентаСтрока);
				БанковскийСчет.БИКБанка = БикБанка;
				БанковскийСчет.НаименованиеБанка = НаименованиеБанка;
				БанковскийСчет.ВалютаДенежныхСредств = БанковскийСчетОрганизации.ВалютаДенежныхСредств; //Валюты банковских счетов организации и контрагента должны совпадать
				ЗаписьОБанке = "";
				РаботаСБанками.ПолучитьДанныеКлассификатораРФ(БикБанка,,ЗаписьОБанке);
				Если НЕ ПустаяСтрока(ЗаписьОБанке) Тогда
					БанковскийСчет.БИКБанка			  = ЗаписьОБанке.Код;
					БанковскийСчет.КоррСчетБанка	  = ЗаписьОБанке.КоррСчет;
					БанковскийСчет.НаименованиеБанка  = ЗаписьОБанке.Наименование;
					БанковскийСчет.ГородБанка		  = ЗаписьОБанке.Город;
					БанковскийСчет.АдресБанка		  = ЗаписьОБанке.Адрес;
					БанковскийСчет.Банк				  = ЗаписьОБанке;
				КонецЕсли;
				СтрокаНаименования = Прав(СокрЛП(БанковскийСчет.НомерСчета), 4) 
				+ ?(ЗначениеЗаполнено(БанковскийСчет.Банк), " в " + Строка(БанковскийСчет.Банк), "")
				+ " (" + Строка(БанковскийСчет.ВалютаДенежныхСредств) + ")";
				
				БанковскийСчет.Наименование = Лев(СтрокаНаименования, 150);
				БанковскийСчет.Записать();
				БСКонтрагента = БанковскийСчет.Ссылка;
			КонецЕсли;
		КонецЕсли;	 
		
		СуммаДокумента = Число(Документ.Amount.amount);
		
		дд = Документ.documentProcessDate;
		ДатаВходящегоДокумента = Дата(Лев(дд, 4), Сред(дд,6,2), Прав(дд,2));  //"ДФ=dd.MM.yyyy"
		НазначениеПлатежа = Документ.description;
		ддд = Документ.documentProcessDate;
		ДатаПроведенияПлатежа = Дата(Лев(ддд, 4), Сред(ддд,6,2), Прав(ддд,2));  //"ДФ=dd.MM.yyyy" 
		IDПлатёжногоДокумента = Документ.transactionId;
		НомерПлатежа = Документ.documentNumber;	
		СтрПлатежа = Данные.ТаблицыПлатежей.ТаблицаПлатежей.Добавить();
		СтрПлатежа.КредитДебитИндикатор = КредитДебитИндикатор;
		СтрПлатежа.Организация = Организация;
		СтрПлатежа.БанковскийСчет = БанковскийСчетОрганизации;  
		СтрПлатежа.ТипПлатежногоДокумента = ТипПлатежногоДокумента;
		
		СтрПлатежа.СуммаДокумента = СуммаДокумента;
		СтрПлатежа.Контрагент = Контрагент;
		СтрПлатежа.БанковскийСчетКонтрагента = БСКонтрагента;
		СтрПлатежа.НазначениеПлатежа = Документ.description;
		СтрПлатежа.Валюта = БанковскийСчетОрганизации.ВалютаДенежныхСредств;
		СтрПлатежа.ВидПлатежа = "Электронно";  
		СтрПлатежа.ОчередностьПлатежа = 5;
		
		Если Документ.Свойство("TaxFields") Тогда
			СтрПлатежа.ПеречислениеВБюджет = Документ.TaxFields.Свойство("originatorStatus");		
		Иначе
			СтрПлатежа.ПеречислениеВБюджет = Ложь;
		КонецЕсли;	
		Если СтрПлатежа.ПеречислениеВБюджет Тогда
			СтрПлатежа.СтатусСоставителя = Документ.TaxFields.originatorStatus;
			
			Если СтрПлатежа.СтатусСоставителя = "08" Тогда
				
				СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств;
				
				СтрПлатежа.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж; 			
			ИначеЕсли СтрПлатежа.СтатусСоставителя = "06"
				ИЛИ СтрПлатежа.СтатусСоставителя = "16"
				ИЛИ СтрПлатежа.СтатусСоставителя = "17"
				ИЛИ СтрПлатежа.СтатусСоставителя = "18"
				ИЛИ СтрПлатежа.СтатусСоставителя = "19"
				ИЛИ СтрПлатежа.СтатусСоставителя = "20" Тогда			  
				СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне;			
				СтрПлатежа.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ТаможенныйПлатеж;			
			Иначе			
				СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет;			
				СтрПлатежа.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж;			
			КонецЕсли;	
			СтрПлатежа.КодБК = Документ.TaxFields.kbk;
			СтрПлатежа.КодОКАТО = Документ.TaxFields.oktmo;
			СтрПлатежа.ПоказательОснования = Документ.TaxFields.base;
			СтрПлатежа.ПоказательПериода = Документ.TaxFields.documentDate;
			СтрПлатежа.ПоказательНомера = Документ.TaxFields.documentNumber;
			СтрПлатежа.ПоказательДаты = Документ.TaxFields.field107;
			Если Документ.TaxFields.Свойство("type") Тогда
				СтрПлатежа.ПоказательТипа = Документ.TaxFields.type;
			Иначе
				СтрПлатежа.ПоказательТипа = "0";
			КонецЕсли;	
		Иначе
			СтрПлатежа.ХозяйственнаяОперация = ПолучитьХозяйственнуюОперацию(КредитДебитИндикатор, СтрПлатежа.НазначениеПлатежа);
		КонецЕсли;
		СтрПлатежа.Комментарий = "Загружен из банка Точка";
		
		Если ЗначениеЗаполнено(ТекЗаказ) Тогда
			СтрПлатежа.ДокументОснование = ТекЗаказ;
		КонецЕсли;
		СтрПлатежа.НомерВходящегоДокумента = НомерПлатежа;
		СтрПлатежа.ДатаВходящегоДокумента = ДатаВходящегоДокумента;
		//СтрПлатежа.IDПлатёжногоДокумента = IDПлатёжногоДокумента;
		
		
		СтрПлатежа.СтатьяДвиженияДенежныхСредств = ""; //
		
		
		Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
		
		СтрПлатежа.IDРасшифровкаПлатежа = Новый УникальныйИдентификатор();
		СтрПлатежа.IDВедомостиНаВыплатуЗарплаты = Новый УникальныйИдентификатор();
		Если КредитДебитИндикатор = "Debit" Тогда
			Если НЕ СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет Тогда
				
				СтрРасшифровкаПлатежа = Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа.Добавить();;
				СтрРасшифровкаПлатежа.IDРасшифровкаПлатежа = СтрПлатежа.IDРасшифровкаПлатежа;
				
				ОднаСтрокаВРасшифровкеПлатежа = Истина;
				
				ОснованиеПлатежаВРасшифровкеПлатежаНеЗаполнено = ПустаяСтрока(СтрРасшифровкаПлатежа.Заказ);
				
				//СчетчикСтрок=0;
				//
				//Если ОднаСтрокаВРасшифровкеПлатежа И ОснованиеПлатежаВРасшифровкеПлатежаНеЗаполнено Тогда
				//	
				//	Если СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
				//		ИЛИ СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию	
				//		ИЛИ СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств Тогда
				//		
				//		СтрРасшифровкаПлатежа = Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа.Добавить(); //присоединяем таблицу по идентификатору, так как в запрос ТЗ с вложенной ТЗ не отправить
				//		СтрРасшифровкаПлатежа.IDРасшифровкаПлатежа = СтрПлатежа.IDРасшифровкаПлатежа;
				//		СтрРасшифровкаПлатежа.Сумма = СтрПлатежа.СуммаДокумента;
				//		
				//	Иначе
				//		
				//		ОрганизацияРасчетов = СтрПлатежа.Организация;
				//		ВалютаДенежныхСредствРасчетов = БанковскийСчетОрганизации.ВалютаДенежныхСредств;
				//		КонтрагентРасчетов = СтрПлатежа.Контрагент;
				//		ПартнерРасчетов = СтрПлатежа.Контрагент.Партнер;
				//		ВидОперацииРасчетов = СтрПлатежа.ХозяйственнаяОперация;
				//		ДатаРасчетов = ДатаПроведенияПлатежа;
				//		
				//		ТаблицаОстатковРасчетов = Неопределено;
				//		
				//		ЗаполнитьТаблицуПоРасчетамСПартнерами(ОрганизацияРасчетов, 
				//		ВалютаДенежныхСредствРасчетов, 
				//		КонтрагентРасчетов, 
				//		ПартнерРасчетов, 
				//		ВидОперацииРасчетов, 
				//		ДатаРасчетов, 
				//		ТаблицаОстатковРасчетов, 0);
				//		
				//		ТаблицаОстатковРасчетов.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
				//		
				//		РаспределяемаяСумма = СтрПлатежа.СуммаДокумента;
				//		
				//		Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
				//			Если НЕ ПустаяСтрока(СтрокаТаблицы.Заказ) Тогда
				//				Если СтрокаТаблицы.Обработано Тогда
				//					Продолжить;
				//				КонецЕсли;	
				//				
				//				Если СчетчикСтрок > 0 Тогда
				//					СтрРасшифровкаПлатежа = Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа.Добавить(); //присоединяем таблицу по идентификатору, так как в запрос ТЗ с вложенной ТЗ не отправить
				//					СтрРасшифровкаПлатежа.IDРасшифровкаПлатежа = СтрПлатежа.IDРасшифровкаПлатежа;
				//				КонецЕсли;	
				//				
				//				СчетчикСтрок = СчетчикСтрок + 1;
				//				
				//				СуммаСтроки = Мин(РаспределяемаяСумма, СтрокаТаблицы.Сумма);
				//				РаспределяемаяСумма = РаспределяемаяСумма - СтрокаТаблицы.Сумма;
				//				
				//				СтрРасшифровкаПлатежа.Партнер             = СтрПлатежа.Контрагент.Партнер;
				//				СтрРасшифровкаПлатежа.Подразделение       = Подразделение;
				//				СтрРасшифровкаПлатежа.Сумма               = СуммаСтроки;
				//				СтрРасшифровкаПлатежа.СуммаВзаиморасчетов = 0;
				//				
				//				СтрРасшифровкаПлатежа.Заказ               = СтрокаТаблицы.Заказ;				
				//				
				//				Если СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы
				//					ИЛИ СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
				//					СтрПлатежа.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
				//				КонецЕсли;
				//				
				//				СтрокаТаблицы.Обработано = Истина;
				//				
				//				Если РаспределяемаяСумма <= 0 Тогда
				//					Прервать;
				//				КонецЕсли;	
				//				
				//			КонецЕсли;	
				//		КонецЦикла;
				//		
				//		Если РаспределяемаяСумма > 0 Тогда
				//			
				//			Если СчетчикСтрок > 0 Тогда
				//				СтрРасшифровкаПлатежа = Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа.Добавить(); //присоединяем таблицу по идентификатору, так как в запрос ТЗ с вложенной ТЗ не отправить
				//				СтрРасшифровкаПлатежа.IDРасшифровкаПлатежа = СтрПлатежа.IDРасшифровкаПлатежа;
				//			КонецЕсли;	
				//			
				//			СтрРасшифровкаПлатежа.Партнер             = СтрПлатежа.Контрагент.Партнер;
				//			СтрРасшифровкаПлатежа.Подразделение       = Подразделение;
				//			СтрРасшифровкаПлатежа.Сумма               = РаспределяемаяСумма;
				//			СтрРасшифровкаПлатежа.СуммаВзаиморасчетов = 0;
				//			
				//			Если СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы
				//				ИЛИ СтрПлатежа.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет Тогда
				//				СтрРасшифровкаПлатежа.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
				//			КонецЕсли;
				//			
				//		КонецЕсли;
				//		
				//	КонецЕсли;
				//	
				//КонецЕсли;
				
			КонецЕсли;
		Иначе
					
			СтрРасшифровкаПлатежа = Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа.Добавить();;
			СтрРасшифровкаПлатежа.IDРасшифровкаПлатежа = СтрПлатежа.IDРасшифровкаПлатежа;
			
			ОднаСтрокаВРасшифровкеПлатежа = Истина;
			
			ОснованиеПлатежаВРасшифровкеПлатежаНеЗаполнено = ПустаяСтрока(СтрРасшифровкаПлатежа.ОснованиеПлатежа);
			
			//СчетчикСтрок=0;
			//
			//
			//Если ОднаСтрокаВРасшифровкеПлатежа И ОснованиеПлатежаВРасшифровкеПлатежаНеЗаполнено Тогда
			//	
			//	УстановитьПривилегированныйРежим(Истина);
			//	
			//	ОрганизацияРасчетов = СтрПлатежа.Организация;
			//	ВалютаДенежныхСредствРасчетов = БанковскийСчетОрганизации.ВалютаДенежныхСредств;
			//	КонтрагентРасчетов = СтрПлатежа.Контрагент;
			//	ПартнерРасчетов = СтрПлатежа.Контрагент.Партнер;
			//	ВидОперацииРасчетов = СтрПлатежа.ХозяйственнаяОперация;
			//	ДатаРасчетов = ДатаПроведенияПлатежа;
			//	
			//	ТаблицаОстатковРасчетов = Неопределено;
			//	
			//	ЗаполнитьТаблицуПоРасчетамСПартнерами(ОрганизацияРасчетов, 
			//	ВалютаДенежныхСредствРасчетов, 
			//	КонтрагентРасчетов, 
			//	ПартнерРасчетов, 
			//	ВидОперацииРасчетов, 
			//	ДатаРасчетов, 
			//	ТаблицаОстатковРасчетов, 0);
			//	
			//	
			//	Если  ВидОперацииРасчетов = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента")
			//		ИЛИ  ВидОперацииРасчетов = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту") Тогда
			//		ЭтоРасчетыСКлиентами = Истина;
			//	Иначе
			//		ЭтоРасчетыСКлиентами = Ложь;
			//	КонецЕсли;
			//	
			//	Если ЭтоРасчетыСКлиентами Тогда
			//		ТекстЗапроса = ВзаиморасчетыСервер.ПолучитьТекстЗапросаДокументыРасчетовСКлиентами(Истина,, Истина);
			//	Иначе
			//		ТекстЗапроса = ВзаиморасчетыСервер.ПолучитьТекстЗапросаДокументыРасчетовСПоставщиками( ,Истина);
			//	КонецЕсли;
			//	
			//	ЗапросДокументов = Новый Запрос;
			//	ЗапросДокументов.Текст = ТекстЗапроса;
			//	ЗапросДокументов.УстановитьПараметр("Дата", ДатаРасчетов);
			//	ЗапросДокументов.УстановитьПараметр("Организация", ОрганизацияРасчетов);
			//	ЗапросДокументов.УстановитьПараметр("Контрагент", КонтрагентРасчетов);
			//	ЗапросДокументов.УстановитьПараметр("Партнер", ПартнерРасчетов);
			//	ЗапросДокументов.УстановитьПараметр("ВыборОснованияПлатежа", Истина);
			//	
			//	ТаблицаДокументов = ЗапросДокументов.Выполнить().Выгрузить();
			//	
			//	ТаблицаОстатковРасчетов.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
			//	ТаблицаОстатковРасчетов.Колонки.Добавить("ОснованиеПлатежа");
			//	
			//	РаспределяемаяСумма = СтрПлатежа.СуммаДокумента;
			//	
			//	Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
			//		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СтрокаТаблицы.Заказ)) Тогда
			//			
			//			СтрокаТаблицыДокументов = ТаблицаДокументов.Найти(СтрокаТаблицы.Заказ, "Ссылка");
			//			
			//			Если НЕ СтрокаТаблицыДокументов = Неопределено Тогда
			//				СтрокаТаблицы.ОснованиеПлатежа = СтрокаТаблицыДокументов.ОбъектРасчетов;
			//			КонецЕсли;
			//			
			//			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СтрокаТаблицы.Заказ)) 
			//				и НЕ (СтрокаТаблицы.ОснованиеПлатежа = Неопределено) Тогда
			//				
			//				НомерДокументаРасчетов 
			//				= ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(СтрокаТаблицы.ОснованиеПлатежа.Номер, Истина, Истина);
			//				Если СтрЧислоВхождений(НазначениеПлатежа, НомерДокументаРасчетов)>0 Тогда
			//					
			//					Если СчетчикСтрок > 0 Тогда
			//						СтрРасшифровкаПлатежа = Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа.Добавить(); //присоединяем таблицу по идентификатору, так как в запрос ТЗ с вложенной ТЗ не отправить
			//						СтрРасшифровкаПлатежа.IDРасшифровкаПлатежа = СтрПлатежа.IDРасшифровкаПлатежа;
			//						
			//					КонецЕсли;	
			//					
			//					СчетчикСтрок = СчетчикСтрок + 1;
			//					
			//					СуммаСтроки = Мин(РаспределяемаяСумма, СтрокаТаблицы.Сумма);
			//					РаспределяемаяСумма = РаспределяемаяСумма - СтрокаТаблицы.Сумма;
			//					
			//					СтрРасшифровкаПлатежа.Партнер             = СтрПлатежа.Контрагент.Партнер;
			//					СтрРасшифровкаПлатежа.Подразделение       = Подразделение;
			//					СтрРасшифровкаПлатежа.Сумма               = СуммаСтроки;
			//					СтрРасшифровкаПлатежа.СуммаВзаиморасчетов = 0;
			//					СтрРасшифровкаПлатежа.ОснованиеПлатежа    = СтрокаТаблицы.ОснованиеПлатежа;		
			//					СтрРасшифровкаПлатежа.Заказ               = СтрокаТаблицы.Заказ;
			//					СтрРасшифровкаПлатежа.СтатьяДоходов       = ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка();
			//					
			//					СтрокаТаблицы.Обработано = Истина;
			//					
			//					Если РаспределяемаяСумма <= 0 Тогда
			//						Прервать;
			//					КонецЕсли;	
			//				КонецЕсли;	
			//			КонецЕсли;	
			//		КонецЕсли;
			//	КонецЦикла;
			//	
			//	Если РаспределяемаяСумма > 0 Тогда
			//		
			//		Для Каждого СтрокаТаблицы Из ТаблицаОстатковРасчетов Цикл
			//			Если НЕ ПустаяСтрока(СтрокаТаблицы.Заказ) Тогда
			//				Если СтрокаТаблицы.Обработано Тогда
			//					Продолжить;
			//				КонецЕсли;	
			//				
			//				Если СчетчикСтрок > 0 Тогда
			//					СтрРасшифровкаПлатежа = Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа.Добавить(); //присоединяем таблицу по идентификатору, так как в запрос ТЗ с вложенной ТЗ не отправить
			//					СтрРасшифровкаПлатежа.IDРасшифровкаПлатежа = СтрПлатежа.IDРасшифровкаПлатежа;
			//				КонецЕсли;	
			//				
			//				СчетчикСтрок = СчетчикСтрок + 1;
			//				
			//				СуммаСтроки = Мин(РаспределяемаяСумма, СтрокаТаблицы.Сумма);
			//				РаспределяемаяСумма = РаспределяемаяСумма - СтрокаТаблицы.Сумма;
			//				
			//				СтрРасшифровкаПлатежа.Партнер             = СтрПлатежа.Контрагент.Партнер;
			//				СтрРасшифровкаПлатежа.Подразделение       = Подразделение;
			//				СтрРасшифровкаПлатежа.Сумма               = СуммаСтроки;
			//				СтрРасшифровкаПлатежа.СуммаВзаиморасчетов = 0;
			//				СтрРасшифровкаПлатежа.ОснованиеПлатежа    = СтрокаТаблицы.ОснованиеПлатежа;		
			//				СтрРасшифровкаПлатежа.Заказ               = СтрокаТаблицы.Заказ;
			//				СтрРасшифровкаПлатежа.СтатьяДоходов       = ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка();
			//				
			//				СтрокаТаблицы.Обработано = Истина;
			//				
			//				Если РаспределяемаяСумма <= 0 Тогда
			//					Прервать;
			//				КонецЕсли;	
			//				
			//			КонецЕсли;	
			//		КонецЦикла;
			//	КонецЕсли;
			//	
			//	Если РаспределяемаяСумма > 0 Тогда
			//		
			//		Если СчетчикСтрок > 0 Тогда
			//			СтрРасшифровкаПлатежа = Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа.Добавить(); //присоединяем таблицу по идентификатору, так как в запрос ТЗ с вложенной ТЗ не отправить
			//			СтрРасшифровкаПлатежа.IDРасшифровкаПлатежа = СтрПлатежа.IDРасшифровкаПлатежа;
			//		КонецЕсли;	
			//		
			//		СтрРасшифровкаПлатежа.Партнер             = СтрПлатежа.Контрагент.Партнер;
			//		СтрРасшифровкаПлатежа.Подразделение       = Подразделение;
			//		СтрРасшифровкаПлатежа.Сумма               = РаспределяемаяСумма;
			//		СтрРасшифровкаПлатежа.СуммаВзаиморасчетов = 0;
			//		СтрРасшифровкаПлатежа.СтатьяДоходов       = ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка();
			//		
			//	КонецЕсли;
			//	
			//	УстановитьПривилегированныйРежим(Ложь);
			//	
			//КонецЕсли;
			
		КонецЕслИ;
		
		//СтрВедомостиНаВыплатуЗарплаты = Данные.ТаблицыПлатежей.ТаблицаВедомостиНаВыплатуЗарплаты.Добавить();   //не обрабатываем, так как нет данных
		//СтрВедомостиНаВыплатуЗарплаты.IDВедомостиНаВыплатуЗарплаты = СтрПлатежа.IDВедомостиНаВыплатуЗарплаты;
		СтрПлатежа.СтатьяДвиженияДенежныхСредств = ПолучитьСтатьюДДС(СтрПлатежа);
	КонецЦикла;
	
	Возврат Данные;

КонецФункции		

Функция ПолучитьВыпискуДляЗагрузкиПП() Экспорт
	
	ТаблицаПлатежей = ИнициализацияТаблицыПлатежей();
	ТаблицаРасшифровкаПлатежа = ИнициализацияТаблицыРасшифровкаПлатежа();
	ТаблицаВедомостиНаВыплатуЗарплаты = ИнициализацияТаблицыВедомостиНаВыплатуЗарплаты();
	
	УстановитьПривилегированныйРежим(Истина);
	НаборКлючей = ПолучитьНаборКлючейДляСБП();
	УстановитьПривилегированныйРежим(Ложь);
	
	
	ТаблицыПлатежей = Новый Структура("ТаблицаПлатежей, ТаблицаРасшифровкаПлатежа, ТаблицаВедомостиНаВыплатуЗарплаты", ТаблицаПлатежей, ТаблицаРасшифровкаПлатежа, ТаблицаВедомостиНаВыплатуЗарплаты);
	
	Данные = новый Структура("НаборКлючей, ТаблицыПлатежей, Организация", НаборКлючей, ТаблицыПлатежей, Константы.НВД_ОсновнаяОрганизацияДляСБП.Получить());
	
	СтарыйНаборКлючей = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(НаборКлючей)); //запомним набор ключей, чтобы потом проверить на изменения
	
	Выписка = ПолучитьВыпискуПоСчетуV3(Данные);
	Если Выписка = Ложь Тогда
		Возврат Новый Структура("ТаблицаПлатежей,ТаблицаРасшифровкаПлатежа,ТаблицаВедомостиНаВыплатуЗарплаты");//из-за косяка на стороне банка, данные могут быть не получены
	КонецЕсли;	
	
	Данные = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(Выписка))));	
	
	//проверим набор ключей на изменение
	КлючиИзменены = Ложь;
	Если СтарыйНаборКлючей.accesstoken_hybrid <> Данные.НаборКлючей.accesstoken_hybrid Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.accesstoken_client <> Данные.НаборКлючей.accesstoken_client Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.refreshtoken_hybrid <> Данные.НаборКлючей.refreshtoken_hybrid Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.client_id <> Данные.НаборКлючей.client_id Тогда
		КлючиИзменены = Истина;	
	ИначеЕсли СтарыйНаборКлючей.client_secret <> Данные.НаборКлючей.client_secret Тогда
		КлючиИзменены = Истина;	
	ИначеЕсли СтарыйНаборКлючей.account_code <> Данные.НаборКлючей.account_code Тогда
		КлючиИзменены = Истина;
	КонецЕсли;
	
	Если КлючиИзменены Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗаписатьНовыйНаборКлючейСБП(Данные.НаборКлючей);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Новый Структура("ТаблицаПлатежей,ТаблицаРасшифровкаПлатежа,ТаблицаВедомостиНаВыплатуЗарплаты",Данные.ТаблицыПлатежей.ТаблицаПлатежей, Данные.ТаблицыПлатежей.ТаблицаРасшифровкаПлатежа, Данные.ТаблицыПлатежей.ТаблицаВедомостиНаВыплатуЗарплаты);
КонецФункции	

Процедура СоздатьПлатежныеДокументыПоБанку(Данные) Экспорт
	
	ТаблицаПП = Данные.ТаблицаПлатежей;
	ТаблицаРасшифровкаПлатежа = Данные.ТаблицаРасшифровкаПлатежа;
	ТаблицаВедомостиНаВыплатуЗарплаты = Данные.ТаблицаВедомостиНаВыплатуЗарплаты;
	
	ТаблицаПП.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.СписаниеБезналичныхДенежныхСредств, ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
	
	ДатаНач = НачалоДня(ТекущаяДата()-60*60*24*5);	 
	
	ДатаКон = КонецДня(ТекущаяДата());
	
	//ДатаНач = НачалоДня(Дата(2021,10,06));	 
	//
	//ДатаКон = КонецДня(Дата(2021,10,06));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПлатежей.КредитДебитИндикатор КАК ТП_КредитДебитИндикатор,
	|	ТаблицаПлатежей.Организация КАК ТП_Организация,
	|	ТаблицаПлатежей.БанковскийСчет КАК ТП_БанковскийСчет,
	|	ТаблицаПлатежей.ТипПлатежногоДокумента КАК ТП_ТипПлатежногоДокумента,
	|	ТаблицаПлатежей.ХозяйственнаяОперация КАК ТП_ХозяйственнаяОперация,
	|	ТаблицаПлатежей.СуммаДокумента КАК ТП_СуммаДокумента,
	|	ТаблицаПлатежей.Контрагент КАК ТП_Контрагент,
	|	ТаблицаПлатежей.БанковскийСчетКонтрагента КАК ТП_БанковскийСчетКонтрагента,
	|	ТаблицаПлатежей.БанковскийСчетПолучатель КАК ТП_БанковскийСчетПолучатель,
	|	ТаблицаПлатежей.ПодотчетноеЛицо КАК ТП_ПодотчетноеЛицо,
	|	ТаблицаПлатежей.ЗаявкаНаРасходованиеДенежныхСредств КАК ТП_ЗаявкаНаРасходованиеДенежныхСредств,
	|	ТаблицаПлатежей.РаспоряжениеНаПеремещениеДенежныхСредств КАК ТП_РаспоряжениеНаПеремещениеДенежныхСредств,
	|	ТаблицаПлатежей.НазначениеПлатежа КАК ТП_НазначениеПлатежа,
	|	ТаблицаПлатежей.АвансовыйОтчет КАК ТП_АвансовыйОтчет,
	|	ТаблицаПлатежей.Валюта КАК ТП_Валюта,
	|	ТаблицаПлатежей.ВидПлатежа КАК ТП_ВидПлатежа,
	|	ТаблицаПлатежей.ОчередностьПлатежа КАК ТП_ОчередностьПлатежа,
	|	ТаблицаПлатежей.ПеречислениеВБюджет КАК ТП_ПеречислениеВБюджет,
	|	ТаблицаПлатежей.ВидПеречисленияВБюджет КАК ТП_ВидПеречисленияВБюджет,
	|	ТаблицаПлатежей.СтатусСоставителя КАК ТП_СтатусСоставителя,
	|	ТаблицаПлатежей.КодБК КАК ТП_КодБК,
	|	ТаблицаПлатежей.КодОКАТО КАК ТП_КодОКАТО,
	|	ТаблицаПлатежей.ПоказательОснования КАК ТП_ПоказательОснования,
	|	ТаблицаПлатежей.ПоказательПериода КАК ТП_ПоказательПериода,
	|	ТаблицаПлатежей.ПоказательНомера КАК ТП_ПоказательНомера,
	|	ТаблицаПлатежей.ПоказательДаты КАК ТП_ПоказательДаты,
	|	ТаблицаПлатежей.ПоказательТипа КАК ТП_ПоказательТипа,
	|	ТаблицаПлатежей.Комментарий КАК ТП_Комментарий,
	|	ТаблицаПлатежей.ДатаВходящегоДокумента КАК ТП_ДатаВходящегоДокумента,
	|	ТаблицаПлатежей.НомерВходящегоДокумента КАК ТП_НомерВходящегоДокумента,
	|	ТаблицаПлатежей.СтатьяДвиженияДенежныхСредств КАК ТП_СтатьяДвиженияДенежныхСредств,
	|	ТаблицаПлатежей.СписаниеБезналичныхДенежныхСредств КАК ТП_СписаниеБезналичныхДенежныхСредств,
	|	ТаблицаПлатежей.ВалютаКонвертации КАК ТП_ВалютаКонвертации,
	|	ТаблицаПлатежей.КурсКонвертации КАК ТП_КурсКонвертации,
	|	ТаблицаПлатежей.СуммаПослеКонвертации КАК ТП_СуммаПослеКонвертации,
	|	ТаблицаПлатежей.Подразделение КАК ТП_Подразделение,
	|	ТаблицаПлатежей.НомерВедомостиНаВыплатуЗарплаты КАК ТП_НомерВедомостиНаВыплатуЗарплаты,
	|	ТаблицаПлатежей.ДатаВедомостиНаВыплатуЗарплаты КАК ТП_ДатаВедомостиНаВыплатуЗарплаты,
	|	ТаблицаПлатежей.СтатьяАктивовПассивов КАК ТП_СтатьяАктивовПассивов,
	|	ТаблицаПлатежей.АналитикаАктивовПассивов КАК ТП_АналитикаАктивовПассивов,
	|	ТаблицаПлатежей.ДокументОснование КАК ТП_ДокументОснование,
	|	ТаблицаПлатежей.IDРасшифровкаПлатежа КАК ТП_IDРасшифровкаПлатежа,
	|	ТаблицаПлатежей.IDВедомостиНаВыплатуЗарплаты КАК ТП_IDВедомостиНаВыплатуЗарплаты
	|ПОМЕСТИТЬ ВТ_ТаблицаПлатежей
	|ИЗ
	|	&ТаблицаПлатежей КАК ТаблицаПлатежей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПлатежей.ТП_КредитДебитИндикатор КАК ТП_КредитДебитИндикатор,
	|	ТаблицаПлатежей.ТП_Организация КАК ТП_Организация,
	|	ТаблицаПлатежей.ТП_БанковскийСчет КАК ТП_БанковскийСчет,
	|	ТаблицаПлатежей.ТП_ТипПлатежногоДокумента КАК ТП_ТипПлатежногоДокумента,
	|	ТаблицаПлатежей.ТП_ХозяйственнаяОперация КАК ТП_ХозяйственнаяОперация,
	|	ТаблицаПлатежей.ТП_СуммаДокумента КАК ТП_СуммаДокумента,
	|	ТаблицаПлатежей.ТП_Контрагент КАК ТП_Контрагент,
	|	ТаблицаПлатежей.ТП_БанковскийСчетКонтрагента КАК ТП_БанковскийСчетКонтрагента,
	|	ТаблицаПлатежей.ТП_БанковскийСчетПолучатель КАК ТП_БанковскийСчетПолучатель,
	|	ТаблицаПлатежей.ТП_ПодотчетноеЛицо КАК ТП_ПодотчетноеЛицо,
	|	ТаблицаПлатежей.ТП_ЗаявкаНаРасходованиеДенежныхСредств КАК ТП_ЗаявкаНаРасходованиеДенежныхСредств,
	|	ТаблицаПлатежей.ТП_РаспоряжениеНаПеремещениеДенежныхСредств КАК ТП_РаспоряжениеНаПеремещениеДенежныхСредств,
	|	ТаблицаПлатежей.ТП_НазначениеПлатежа КАК ТП_НазначениеПлатежа,
	|	ТаблицаПлатежей.ТП_АвансовыйОтчет КАК ТП_АвансовыйОтчет,
	|	ТаблицаПлатежей.ТП_Валюта КАК ТП_Валюта,
	|	ТаблицаПлатежей.ТП_ВидПлатежа КАК ТП_ВидПлатежа,
	|	ТаблицаПлатежей.ТП_ОчередностьПлатежа КАК ТП_ОчередностьПлатежа,
	|	ТаблицаПлатежей.ТП_ПеречислениеВБюджет КАК ТП_ПеречислениеВБюджет,
	|	ТаблицаПлатежей.ТП_ВидПеречисленияВБюджет КАК ТП_ВидПеречисленияВБюджет,
	|	ТаблицаПлатежей.ТП_СтатусСоставителя КАК ТП_СтатусСоставителя,
	|	ТаблицаПлатежей.ТП_КодБК КАК ТП_КодБК,
	|	ТаблицаПлатежей.ТП_КодОКАТО КАК ТП_КодОКАТО,
	|	ТаблицаПлатежей.ТП_ПоказательОснования КАК ТП_ПоказательОснования,
	|	ТаблицаПлатежей.ТП_ПоказательПериода КАК ТП_ПоказательПериода,
	|	ТаблицаПлатежей.ТП_ПоказательНомера КАК ТП_ПоказательНомера,
	|	ТаблицаПлатежей.ТП_ПоказательДаты КАК ТП_ПоказательДаты,
	|	ТаблицаПлатежей.ТП_ПоказательТипа КАК ТП_ПоказательТипа,
	|	ТаблицаПлатежей.ТП_Комментарий КАК ТП_Комментарий,
	|	ТаблицаПлатежей.ТП_ДатаВходящегоДокумента КАК ТП_ДатаВходящегоДокумента,
	|	ТаблицаПлатежей.ТП_НомерВходящегоДокумента КАК ТП_НомерВходящегоДокумента,
	|	ТаблицаПлатежей.ТП_СтатьяДвиженияДенежныхСредств КАК ТП_СтатьяДвиженияДенежныхСредств,
	|	ТаблицаПлатежей.ТП_СписаниеБезналичныхДенежныхСредств КАК ТП_СписаниеБезналичныхДенежныхСредств,
	|	ТаблицаПлатежей.ТП_ВалютаКонвертации КАК ТП_ВалютаКонвертации,
	|	ТаблицаПлатежей.ТП_КурсКонвертации КАК ТП_КурсКонвертации,
	|	ТаблицаПлатежей.ТП_СуммаПослеКонвертации КАК ТП_СуммаПослеКонвертации,
	|	ТаблицаПлатежей.ТП_Подразделение КАК ТП_Подразделение,
	|	ТаблицаПлатежей.ТП_НомерВедомостиНаВыплатуЗарплаты КАК ТП_НомерВедомостиНаВыплатуЗарплаты,
	|	ТаблицаПлатежей.ТП_ДатаВедомостиНаВыплатуЗарплаты КАК ТП_ДатаВедомостиНаВыплатуЗарплаты,
	|	ТаблицаПлатежей.ТП_СтатьяАктивовПассивов КАК ТП_СтатьяАктивовПассивов,
	|	ТаблицаПлатежей.ТП_АналитикаАктивовПассивов КАК ТП_АналитикаАктивовПассивов,
	|	ТаблицаПлатежей.ТП_ДокументОснование КАК ТП_ДокументОснование,
	|	ТаблицаПлатежей.ТП_IDРасшифровкаПлатежа КАК ТП_IDРасшифровкаПлатежа,
	|	ТаблицаПлатежей.ТП_IDВедомостиНаВыплатуЗарплаты КАК ТП_IDВедомостиНаВыплатуЗарплаты,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ТаблицаПлатежей КАК ТаблицаПлатежей
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СписаниеБезналичныхДенежныхСредств.Ссылка КАК Ссылка,
	|			СписаниеБезналичныхДенежныхСредств.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|			СписаниеБезналичныхДенежныхСредств.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|			СписаниеБезналичныхДенежныхСредств.СуммаДокумента КАК СуммаДокумента
	|		ИЗ
	|			Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	|		ГДЕ
	|			СписаниеБезналичныхДенежныхСредств.ПометкаУдаления = ЛОЖЬ
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ПоступлениеБезналичныхДенежныхСредств.Ссылка,
	|			ПоступлениеБезналичныхДенежныхСредств.ДатаВходящегоДокумента,
	|			ПоступлениеБезналичныхДенежныхСредств.НомерВходящегоДокумента,
	|			ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента
	|		ИЗ
	|			Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ГДЕ
	|			ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|		ПО ТаблицаПлатежей.ТП_ДатаВходящегоДокумента = ВложенныйЗапрос.ДатаВходящегоДокумента
	|			И ТаблицаПлатежей.ТП_НомерВходящегоДокумента = ВложенныйЗапрос.НомерВходящегоДокумента
	|			И ТаблицаПлатежей.ТП_СуммаДокумента = ВложенныйЗапрос.СуммаДокумента";
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.УстановитьПараметр("ТаблицаПлатежей", ТаблицаПП);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
			Продолжить;
		КонецЕсли;
		//создаем платежки, которых нет
		Если ВыборкаДетальныеЗаписи.ТП_КредитДебитИндикатор = "Credit" Тогда  //поступление денег
			Платежка = Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент(); 
			Платежка.СписаниеБезналичныхДенежныхСредств = ВыборкаДетальныеЗаписи.ТП_СписаниеБезналичныхДенежныхСредств;
			Если ВыборкаДетальныеЗаписи.ТП_ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.БанковскийОрдер тогда //косяк в банковской выписке, должен быть платежный ордер
				Платежка.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежныйОрдер;
			Иначе
				Платежка.ТипПлатежногоДокумента = ВыборкаДетальныеЗаписи.ТП_ТипПлатежногоДокумента;
			КонецЕсли;	
		Иначе //расход
			Платежка = Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент();
			Платежка.АвансовыйОтчет                           = ВыборкаДетальныеЗаписи.ТП_АвансовыйОтчет;  
			Платежка.БанковскийСчетПолучатель                 = ВыборкаДетальныеЗаписи.ТП_БанковскийСчетПолучатель;
			Платежка.ЗаявкаНаРасходованиеДенежныхСредств      = ВыборкаДетальныеЗаписи.ТП_ЗаявкаНаРасходованиеДенежныхСредств;     
			Платежка.РаспоряжениеНаПеремещениеДенежныхСредств = ВыборкаДетальныеЗаписи.ТП_РаспоряжениеНаПеремещениеДенежныхСредств;    
			Платежка.ВидПлатежа                               = ВыборкаДетальныеЗаписи.ТП_ВидПлатежа;  
			Платежка.ТипПлатежногоДокумента                   = ВыборкаДетальныеЗаписи.ТП_ТипПлатежногоДокумента;
			Платежка.ОчередностьПлатежа                       = ВыборкаДетальныеЗаписи.ТП_ОчередностьПлатежа;             
			Платежка.ПеречислениеВБюджет                      = ВыборкаДетальныеЗаписи.ТП_ПеречислениеВБюджет;           
			Платежка.ВидПеречисленияВБюджет                   = ВыборкаДетальныеЗаписи.ТП_ВидПеречисленияВБюджет;       
			Платежка.СтатусСоставителя                        = ВыборкаДетальныеЗаписи.ТП_СтатусСоставителя;           
			Платежка.КодБК                                    = ВыборкаДетальныеЗаписи.ТП_КодБК;                
			Платежка.КодОКАТО                                 = ВыборкаДетальныеЗаписи.ТП_КодОКАТО;               
			Платежка.ПоказательОснования                      = ВыборкаДетальныеЗаписи.ТП_ПоказательОснования;     
			Платежка.ПоказательПериода                        = ВыборкаДетальныеЗаписи.ТП_ПоказательПериода;           
			Платежка.ПоказательНомера                         = ВыборкаДетальныеЗаписи.ТП_ПоказательНомера;         
			Платежка.ПоказательДаты                           = ВыборкаДетальныеЗаписи.ТП_ПоказательДаты;          
			Платежка.ПоказательТипа                           = ВыборкаДетальныеЗаписи.ТП_ПоказательТипа;   
			Платежка.НеКонтролироватьЗаполнениеЗаявки         = Истина;   
			Платежка.НомерВедомостиНаВыплатуЗарплаты          = ВыборкаДетальныеЗаписи.ТП_НомерВедомостиНаВыплатуЗарплаты;    
			Платежка.ДатаВедомостиНаВыплатуЗарплаты           = ВыборкаДетальныеЗаписи.ТП_ДатаВедомостиНаВыплатуЗарплаты;  
			Платежка.СуммаПослеКонвертации                    = ВыборкаДетальныеЗаписи.ТП_СуммаПослеКонвертации;
		КонецЕсли;
		Платежка.Дата                          = КонецДня(ВыборкаДетальныеЗаписи.ТП_ДатаВходящегоДокумента);
		Платежка.Организация                   = ВыборкаДетальныеЗаписи.ТП_Организация;
		Платежка.БанковскийСчет                = ВыборкаДетальныеЗаписи.ТП_БанковскийСчет; 
		Платежка.ХозяйственнаяОперация         = ВыборкаДетальныеЗаписи.ТП_ХозяйственнаяОперация;
		Платежка.СуммаДокумента                = ВыборкаДетальныеЗаписи.ТП_СуммаДокумента;
		Платежка.Контрагент                    = ВыборкаДетальныеЗаписи.ТП_Контрагент;
		Платежка.БанковскийСчетКонтрагента     = ВыборкаДетальныеЗаписи.ТП_БанковскийСчетКонтрагента;
		Платежка.ДатаВходящегоДокумента        = ВыборкаДетальныеЗаписи.ТП_ДатаВходящегоДокумента;
		Платежка.НомерВходящегоДокумента       = ВыборкаДетальныеЗаписи.ТП_НомерВходящегоДокумента;
		Платежка.НазначениеПлатежа             = ВыборкаДетальныеЗаписи.ТП_НазначениеПлатежа; 
		Платежка.Валюта                        = ВыборкаДетальныеЗаписи.ТП_Валюта;
		Платежка.Комментарий                   = ВыборкаДетальныеЗаписи.ТП_Комментарий;	
		Платежка.СтатьяДвиженияДенежныхСредств = ВыборкаДетальныеЗаписи.ТП_СтатьяДвиженияДенежныхСредств; 
		Платежка.ВалютаКонвертации             = ВыборкаДетальныеЗаписи.ТП_ВалютаКонвертации;
		Платежка.КурсКонвертации               = ВыборкаДетальныеЗаписи.ТП_КурсКонвертации; 		
		Платежка.ПодотчетноеЛицо               = ВыборкаДетальныеЗаписи.ТП_ПодотчетноеЛицо;
		Платежка.Подразделение                 = ВыборкаДетальныеЗаписи.ТП_Подразделение;
		Платежка.СтатьяАктивовПассивов         = ВыборкаДетальныеЗаписи.ТП_СтатьяАктивовПассивов;
		Платежка.АналитикаАктивовПассивов      = ВыборкаДетальныеЗаписи.ТП_АналитикаАктивовПассивов;
		Платежка.ДокументОснование             = ВыборкаДетальныеЗаписи.ТП_ДокументОснование;
		
		//заполнение табличных частей 
		Если ВыборкаДетальныеЗаписи.ТП_КредитДебитИндикатор = "Credit" Тогда  //поступление денег
			Отбор = Новый Структура("IDРасшифровкаПлатежа", ВыборкаДетальныеЗаписи.ТП_IDРасшифровкаПлатежа);
			СтрокиРасшифровкиПлатежа = ТаблицаРасшифровкаПлатежа.НайтиСтроки(Отбор);
			Если СтрокиРасшифровкиПлатежа.Количество() > 0 Тогда
				Для Каждого СтрокаРасшифровкиПлатежа Из СтрокиРасшифровкиПлатежа Цикл
					ПлатежкаСтрокаРасшифровкиПлатежа = Платежка.РасшифровкаПлатежа.Добавить();
					ПлатежкаСтрокаРасшифровкиПлатежа.Партнер = СтрокаРасшифровкиПлатежа.Партнер; 
					ПлатежкаСтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств = СтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств;
					ПлатежкаСтрокаРасшифровкиПлатежа.ОснованиеПлатежа              = СтрокаРасшифровкиПлатежа.ОснованиеПлатежа;
					ПлатежкаСтрокаРасшифровкиПлатежа.Заказ                         = СтрокаРасшифровкиПлатежа.Заказ;
					ПлатежкаСтрокаРасшифровкиПлатежа.Сумма                         = СтрокаРасшифровкиПлатежа.Сумма;
					ПлатежкаСтрокаРасшифровкиПлатежа.ВалютаВзаиморасчетов          = СтрокаРасшифровкиПлатежа.ВалютаВзаиморасчетов;
					ПлатежкаСтрокаРасшифровкиПлатежа.СуммаВзаиморасчетов           = СтрокаРасшифровкиПлатежа.СуммаВзаиморасчетов;
					ПлатежкаСтрокаРасшифровкиПлатежа.СтатьяДоходов                 = СтрокаРасшифровкиПлатежа.СтатьяДоходов;
					ПлатежкаСтрокаРасшифровкиПлатежа.АналитикаДоходов              = СтрокаРасшифровкиПлатежа.АналитикаДоходов;
					ПлатежкаСтрокаРасшифровкиПлатежа.Подразделение                 = СтрокаРасшифровкиПлатежа.Подразделение;
					ПлатежкаСтрокаРасшифровкиПлатежа.ДоговорКредитаДепозита        = СтрокаРасшифровкиПлатежа.ДоговорКредитаДепозита;
					ПлатежкаСтрокаРасшифровкиПлатежа.ИдентификаторСтроки           = СтрокаРасшифровкиПлатежа.ИдентификаторСтроки;
				КонецЦикла;
			КонецЕсли;
		Иначе //расход
			Отбор = Новый Структура("IDРасшифровкаПлатежа", ВыборкаДетальныеЗаписи.ТП_IDРасшифровкаПлатежа);
			СтрокиРасшифровкиПлатежа = ТаблицаРасшифровкаПлатежа.НайтиСтроки(Отбор);
			Если СтрокиРасшифровкиПлатежа.Количество() > 0 Тогда
				Для Каждого СтрокаРасшифровкиПлатежа Из СтрокиРасшифровкиПлатежа Цикл
					ПлатежкаСтрокаРасшифровкиПлатежа = Платежка.РасшифровкаПлатежа.Добавить();
					ПлатежкаСтрокаРасшифровкиПлатежа.Партнер = СтрокаРасшифровкиПлатежа.Партнер; 
					ПлатежкаСтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств = СтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств;
					ПлатежкаСтрокаРасшифровкиПлатежа.ПериодВозникновенияРасхода    = СтрокаРасшифровкиПлатежа.ПериодВозникновенияРасхода;
					ПлатежкаСтрокаРасшифровкиПлатежа.Заказ                         = СтрокаРасшифровкиПлатежа.Заказ;
					ПлатежкаСтрокаРасшифровкиПлатежа.Сумма                         = СтрокаРасшифровкиПлатежа.Сумма;
					ПлатежкаСтрокаРасшифровкиПлатежа.ВалютаВзаиморасчетов          = СтрокаРасшифровкиПлатежа.ВалютаВзаиморасчетов;
					ПлатежкаСтрокаРасшифровкиПлатежа.СуммаВзаиморасчетов           = СтрокаРасшифровкиПлатежа.СуммаВзаиморасчетов;
					ПлатежкаСтрокаРасшифровкиПлатежа.СтатьяРасходов                = СтрокаРасшифровкиПлатежа.СтатьяРасходов;
					ПлатежкаСтрокаРасшифровкиПлатежа.АналитикаРасходов             = СтрокаРасшифровкиПлатежа.АналитикаРасходов;
					ПлатежкаСтрокаРасшифровкиПлатежа.Подразделение                 = СтрокаРасшифровкиПлатежа.Подразделение;
					ПлатежкаСтрокаРасшифровкиПлатежа.ДоговорКредитаДепозита        = СтрокаРасшифровкиПлатежа.ДоговорКредитаДепозита;
					ПлатежкаСтрокаРасшифровкиПлатежа.ИдентификаторСтроки           = СтрокаРасшифровкиПлатежа.ИдентификаторСтроки;
				КонецЦикла;
			КонецЕсли;
			Отбор = Новый Структура("IDВедомостиНаВыплатуЗарплаты", ВыборкаДетальныеЗаписи.ТП_IDВедомостиНаВыплатуЗарплаты);
			СтрокиВедомостиНаВыплатуЗарплаты = ТаблицаВедомостиНаВыплатуЗарплаты.НайтиСтроки(Отбор);
			Если СтрокиВедомостиНаВыплатуЗарплаты.Количество() > 0 Тогда
				Для Каждого СтрокаВедомостиНаВыплатуЗарплаты Из СтрокиВедомостиНаВыплатуЗарплаты Цикл
					ПлатежкаСтрокаВедомостиНаВыплатуЗарплаты = Платежка.ВедомостиНаВыплатуЗарплаты.Добавить();
					ПлатежкаСтрокаВедомостиНаВыплатуЗарплаты.Ведомость = СтрокаВедомостиНаВыплатуЗарплаты.Ведомость; 
					ПлатежкаСтрокаВедомостиНаВыплатуЗарплаты.Сумма     = СтрокаВедомостиНаВыплатуЗарплаты.Сумма;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	
		Попытка
			Платежка.Записать();
			Если ЗначениеЗаполнено(Платежка.СтатьяДвиженияДенежныхСредств) Тогда
				Платежка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;	
		Исключение
			ТекстОшибки = "Ошибка при записи нового Документа списания/поступление ДС " + ОписаниеОшибки() + "";
			Сообщить(ТекстОшибки, СтатусСообщения.Важное);
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);	
		КонецПопытки;
		//Сообщим менеджеру что по его заказу прошел платеж
			//ТекстСообщенияМассив = Новый Массив;
			//Если ТипЗнч(Платежка.Ссылка) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
			//	ТекстСообщенияМассив.Добавить("(penguinkiss) ");             
			//	ТекстСообщенияМассив.Добавить("Платеж от клиента: ");
			//Иначе
			//	ТекстСообщенияМассив.Добавить("(porgsurprised) ");
			//	ТекстСообщенияМассив.Добавить("Оплата поставщику: ");
			//КонецЕсли;
			//ТекстСообщенияМассив.Добавить(Платежка.Контрагент);  	
			//ТекстСообщенияМассив.Добавить(Символы.ПС);
			//ТекстСообщенияМассив.Добавить("По заказу:");
			//ТекстСообщенияМассив.Добавить(Платежка.ДокументОснование);
			//ТекстСообщенияМассив.Добавить(Символы.ПС);
			//ТекстСообщенияМассив.Добавить("Организация: ");
			//ТекстСообщенияМассив.Добавить(Платежка.Организация);
			//ТекстСообщенияМассив.Добавить(Символы.ПС);
			//ТекстСообщенияМассив.Добавить("Сумма: ");
			//ТекстСообщенияМассив.Добавить(Платежка.СуммаДокумента);
			//ТекстСообщенияМассив.Добавить(Символы.ПС);
			//ТекстСообщенияМассив.Добавить("Дата платежа: ");
			//ТекстСообщенияМассив.Добавить(Платежка.Дата);
			//ТекстСообщенияМассив.Добавить(Символы.ПС);
			//ТекстСообщенияМассив.Добавить("Назначение платежа: ");
			//ТекстСообщенияМассив.Добавить(Платежка.НазначениеПлатежа);
			//Если (ТипЗнч(Платежка.ДокументОснование) = Тип("ДокументСсылка.CRM_Событие")) И (НЕ Платежка.ДокументОснование = Документы.CRM_Событие.ПустаяСсылка()) тогда
			//	ЛогинSkype = Платежка.ДокументОснование.Ответственный.Skype;
			//	
			//	RVD_СкайпБот.ОтправитьСообщениеВСкайп(ЛогинSkype, СтрСоединить(ТекстСообщенияМассив));
			//	RVD_СкайпБот.ОтправитьСообщениеВСкайп("valeriknikif", СтрСоединить(ТекстСообщенияМассив));
			//Иначе //отправить тем кому надо
			//	RVD_СкайпБот.ОтправитьСообщениеВСкайп("valeriknikif", СтрСоединить(ТекстСообщенияМассив));
			//КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

#Область Запросы_POST_и_GET_к_http

Функция ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой)
	
	//Мас = Новый Массив;
	Отказ = Ложь;
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда 
		Сообщить(Текст, СтатусСообщения.Важное);
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);
		Отказ = Истина;
	КонецЕсли;
	
	Структ = Новый Структура;
	
	Если Не Отказ Тогда
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON; 	
			ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
			Структ = ПрочитатьJSON(ЧтениеJSON);
			Для Каждого ЭлСтр Из Структ Цикл
				Если ЗначениеЗаполнено(ЭлСтр.Значение) Тогда
					Сообщить("" + ЭлСтр.Ключ + " " + ЭлСтр.Значение + "");
				КонецЕсли;
			КонецЦикла;
			ЧтениеJSON.Закрыть();
		Исключение
			Текст = "Ошибка выгрузки API Точка Банк: " + ОписаниеОшибки() + "";
			Сообщить(Текст, СтатусСообщения.Важное);
			ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);
			Отказ = Истина;	
		КонецПопытки; 		
		
	КонецЕсли;
	
	Если Отказ = Истина Тогда			
		//Мас = Новый Массив;
		Сообщить(ОтветСтрокой);
	ИначеЕсли Найти(ОтветСтрокой, """error"":null") > 0 Или Найти(ОтветСтрокой, """errors"":null") > 0 Тогда
		//все ок	
	ИначеЕсли Найти(ОтветСтрокой, "errors") > 0 или Найти(ОтветСтрокой, "error") > 0 Тогда 
		//Мас = Новый Массив;
		Сообщить(ОтветСтрокой);
	КонецЕсли;
	
	Возврат Структ;
	
КонецФункции

Функция СформироватьСтрокуJSONИзСтруктуры(Объект)
	
	СтрокаJSON = "{";
	
	Для каждого Элемент Из Объект Цикл
		
		Если Элемент.Значение = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + """" + Элемент.Ключ + """" + ":";
		
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
			СтрокаJSON = СтрокаJSON + """" + Элемент.Значение + """";
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
			СтрокаJSON = СтрокаJSON + СтрЗаменить(СтрЗаменить(Строка(Элемент.Значение), Символы.НПП, ""), ",", ".");
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Булево") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение, "БЛ=false; БИ=true");
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
			// преобразование в unixtime
			СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение - Дата(1970,1,1,1,0,0), "ЧГ=0");
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
			
		Иначе
			//СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент.Значение)) + """";
			СтрокаJSON = СтрокаJSON + """" + Строка(Элемент.Значение) + """";
			
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + ",";
		
	КонецЦикла;
	
	Если Прав(СтрокаJSON, 1) = "," Тогда
		СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
	КонецЕсли;
	
	Возврат СтрокаJSON + "}";
	
КонецФункции

Функция ПреобразоватьвСистему(Число10,система) Экспорт
	
	Если система > 36 или система < 2 тогда
		Сообщить("Выбранная система исчисления не поддерживается");
		Возврат -1;
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	Пока Число10 > 0 цикл
		РезДеления = Число10/система;
		ЧислоСистема = цел(РезДеления);
		остатокОтДеления = Число10 - система*(ЧислоСистема);
		СтрокаСистема = сред(СтрокаЗначений,остатокОтДеления+1,1)+ СтрокаСистема;
		Число10 = ?(ЧислоСистема=0,0,РезДеления); 
	КонецЦикла;
	
	Нечётное = стрДлина(СтрокаСистема) - цел(стрДлина(СтрокаСистема)/2)*2;
	Если Нечётное тогда
		СтрокаСистема = "0"+СтрокаСистема;
	КонецЕсли;
	
	Возврат СтрокаСистема;
	
КонецФункции

Функция URLEncode(стр) Экспорт  
	
	Длина=СтрДлина(Стр);
	Итог="";
	Для Н=1 По Длина Цикл
		Знак=Сред(Стр,Н,1);
		Код=КодСимвола(Знак);
		
		если ((Знак>="a")и(Знак<="z")) или
			((Знак>="A")и(Знак<="Z")) или
			((Знак>="0")и(Знак<="9")) тогда
			Итог=Итог+Знак;
		Иначе
			Если (Код>=КодСимвола("А"))И(Код<=КодСимвола("п")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(144+Код-КодСимвола("А"),16);
			ИначеЕсли (Код>=КодСимвола("р"))И(Код<=КодСимвола("я")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(128+Код-КодСимвола("р"),16);
			ИначеЕсли (Знак="ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(145,16);
			ИначеЕсли (Знак="Ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(129,16);
			Иначе
				Итог=Итог+"%"+ПреобразоватьвСистему(Код,16);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;
	
КонецФункции

Функция СформироватьСтрокуJSONИзМассива(Объект)
	
	СтрокаJSON = "[";
	
	Для каждого Элемент Из Объект Цикл
		
		Если ТипЗнч(Элемент) = Тип("Строка") Тогда
			СтрокаJSON = СтрокаJSON + """" + Элемент + """";
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Число") Тогда
			СтрокаJSON = СтрокаJSON + СтрЗаменить(СтрЗаменить(Строка(Элемент), Символы.НПП, ""), ",", ".");
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Булево") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент, "БЛ=false; БИ=true");
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Дата") Тогда
			// преобразование в unixtime
			СтрокаJSON = СтрокаJSON + Формат(Элемент - Дата(1970,1,1,1,0,0), "ЧГ=0");
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаЗначений") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
			
		Иначе
			//СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент)) + """";
			СтрокаJSON = СтрокаJSON + """" + Строка(Элемент) + """";
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + ",";
	КонецЦикла;
	
	Если Прав(СтрокаJSON, 1) = "," Тогда
		СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
	КонецЕсли;
	
	Возврат СтрокаJSON + "]";
	
КонецФункции

Функция СформироватьСтрокуJSON(Объект) Экспорт
	
	СтрокаJSON = "";
	
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		СтрокаJSON = СформироватьСтрокуJSONИзМассива(Объект);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
		СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(Объект);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ТаблицаЗначений") Тогда
		// преобразуем таблицу значений в массив структур - работает дольше, но кода меньше
		// если нужна скорость, то нужно отдельно обработать таблицу значений
		
		СоставСтруктуры = "";
		Для каждого Колонка Из Объект.Колонки Цикл
			СоставСтруктуры = СоставСтруктуры + ?(ЗначениеЗаполнено(СоставСтруктуры), ",", "") + Колонка.Имя;
		КонецЦикла;
		
		МассивСтрок = Новый Массив;
		Для каждого Строка Из Объект Цикл
			СтруктураКолонок = Новый Структура(СоставСтруктуры);
			ЗаполнитьЗначенияСвойств(СтруктураКолонок, Строка);
			МассивСтрок.Добавить(СтруктураКолонок);
		КонецЦикла;
		
		СтрокаJSON = СформироватьСтрокуJSONИзМассива(МассивСтрок);
		
	КонецЕсли;
	
	Возврат СтрокаJSON;
	
КонецФункции  

Функция УдалениеНечитаемыхСимволов( Знач Стр, ОграничитьДлину = 100)
	
	Стр = СокрЛП( Стр);
	
	Стр = СтрЗаменить( Стр, Символ(34), "");
	Стр = СтрЗаменить( Стр, "'", "");
	Стр = СтрЗаменить( Стр, ",", ".");
	
	СоответствиеНайден = Новый Соответствие;
	
	Для НомерСимвола = 1 по СтрДлина( Стр) Цикл
		
		ТекСимвол = Сред( Стр, НомерСимвола, 1);
		
		Если КодСимвола( ТекСимвол) < 32 И КодСимвола( ТекСимвол) <> 10 Тогда
			СоответствиеНайден.Вставить( ТекСимвол, "");
		КонецЕсли;
		
	КонецЦикла; // НомерСимвола = 1 по СтрДлина( Стр)
	
	Если СоответствиеНайден.Количество() > 0 Тогда
		Для Каждого ТекСимвол из СоответствиеНайден Цикл
			Стр = СтрЗаменить( Стр, ТекСимвол.Ключ, "");
		КонецЦикла;
	КонецЕсли; // ФлагНайден > 0
	
	Если СтрДлина( Стр) > ОграничитьДлину Тогда
		Стр = Лев( Стр, ОграничитьДлину);
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции

Функция ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, СтрокаJSON, ТипЗапроса = "POST", access_token, account_code)
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("accept", "application/json");
	ЗаголовокHTTP.Вставить("type", ТипЗапроса);
	ЗаголовокHTTP.Вставить("dataType", "json");
	ЗаголовокHTTP.Вставить("Authorization", "Bearer " + access_token);
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL(
                Новый СертификатКлиентаWindows(),
                Новый СертификатыУдостоверяющихЦентровWindows());
	
	Попытка
		
		Если ТипЗапроса = "POST" Тогда
			Соединение = Новый HTTPСоединение("enter.tochka.com", 443,,,,,SSL);
			HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса, ЗаголовокHTTP);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			ОтветСервера = Соединение.ОтправитьДляОбработки(HTTPЗапрос); 
		Иначе
			Соединение = Новый HTTPСоединение("enter.tochka.com", 443,,,,,SSL);
			HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса, ЗаголовокHTTP);
//			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			ОтветСервера = Соединение.Получить(HTTPЗапрос);
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = "Связь с сервером не установлена " + ОписаниеОшибки() + "";
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
		
	КонецПопытки;
	
	Возврат ОтветСервера;
	
КонецФункции

#КонецОбласти 

#Область Загрузка_Оплат

Функция ПолучитьЗаказПоНомеру(лТекстПлатежа) Экспорт
	
	
	ТекстПлатежа = лТекстПлатежа;
	
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "№", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "СЧ.", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "#", " ");      
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "НОМЕР", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "No", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "NО", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "NO", " ");      
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "NO", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, ",", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, ";", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "ОТ", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "N", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P300-",  "Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "РЗ00-",  "Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р-300-", "Р300-");     
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р 300-", "Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P 300-", "Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, " 300-",  " Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р600-",  "Р600-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P600-",  "Р600-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р-600-", "Р600-");     
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р 600-", "Р600-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P 600-", "Р600-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, " 600-",  " Р600-"); 
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P600-",  "Р600-");
	
	//Если СтрНайти(ТекстПлатежа, "300-") > 0 И СтрНайти(ТекстПлатежа, "Р") = 0 Тогда 
	//	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "300-",  " Р300-");	
	//КонецЕсли;	
	
	НомерЗаказа = "";
	
	Если СтрЧислоВхождений(ТекстПлатежа, "@") = 2 Тогда  //Сначала ищем заказ между собачками
		
		МасСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПлатежа, "@");  		
		
		Если МасСлов.Количество() = 3 Тогда
			НомерЗаказа = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(МасСлов[1], 11, "0");	
		КонецЕсли;
		
	КонецЕсли;  
	
	СсылкаНаСчет = "";
	лСчет = "";
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда //ищем счет
		
		МасСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПлатежа, " ", Истина);
		
		Для Каждого Эл Из МасСлов Цикл
			
			ЭлОбр = СтрЗаменить(Эл, "@", "");
			Если СтрЧислоВхождений(ЭлОбр, ".") = 1 Тогда //даты становятся номерами документов
				ЭлОбр = СтрЗаменить(ЭлОбр, ".", "");  		
			КонецЕсли;
			Если СтрДлина(ЭлОбр) = 11 Тогда
				лСчет = Документы.СчетНаОплатуКлиенту.НайтиПоНомеру(ЭлОбр, ТекущаяДата());
			КонецЕсли;
			
			Если ЗначениеЗаполнено(лСчет) Тогда
				СсылкаНаСчет = лСчет;	
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерЗаказа)
		И Не ЗначениеЗаполнено(СсылкаНаСчет) Тогда //  Потом ищем по первому номеру в тексте, который подходит под условия
		
		МасСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПлатежа, " ", Истина); 
		Для Каждого Эл Из МасСлов Цикл
			
			//ЭлОбр = СтрЗаменить(Эл, "@", "");
			//Если СтрЧислоВхождений(ЭлОбр, ".") = 1 Тогда //даты становятся номерами документов
			//	ЭлОбр = СтрЗаменить(ЭлОбр, ".", "");  		
			//КонецЕсли;
			Если СтрДлина(Эл) >= 5 И СтрДлина(Эл) <= 6 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Эл, Истина, Ложь) Тогда
				НомерЗаказа = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Эл, 11, "0");
				Если ЗначениеЗаполнено(НомерЗаказа) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СсылкаНаЗаказ = Неопределено;
	
	Если Не ЗначениеЗаполнено(НомерЗаказа)
		И Не ЗначениеЗаполнено(СсылкаНаСчет) Тогда //возможно это платеж через СБП, ищем его
		НомерВхождения = СтрНайти(ВРег(СокрЛП(лТекстПлатежа)),"QR КОДУ ID");
		IDQR = "";
		Если НомерВхождения > 0 Тогда
			
			//находим ID QR кода
			IDQR = Сред(лТекстПлатежа,НомерВхождения + 11, 32);
			
		КонецЕсли;
		Если IDQR <> "" И СтрДлина(IDQR) = 32 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СБП_QRКоды.qrcId КАК qrcId,
			|	СБП_QRКоды.Заказ КАК Заказ
			|ИЗ
			|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
			|ГДЕ
			|	СБП_QRКоды.qrcId = &qrcId";
			
			Запрос.УстановитьПараметр("qrcId", IDQR);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				
				 СсылкаНаЗаказ = ВыборкаДетальныеЗаписи.Заказ;
				
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда
		СсылкаНаЗаказ = Документы.CRM_Событие.НайтиПоНомеру(НомерЗаказа);
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаСчет) Тогда
		СсылкаНаЗаказ = СсылкаНаСчет.ДокументОснование;		
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаЗаказ) Тогда
		// уже нашли заказ, ничего не делаем
	Иначе	
		СсылкаНаЗаказ = Документы.CRM_Событие.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат СсылкаНаЗаказ;
	
КонецФункции

Функция ПолучитьДатуИзСтроки(ДатаСтр)
	
	ДатаДокумента = Дата(Лев(ДатаСтр, 4), Сред(ДатаСтр, 6, 2), Сред(ДатаСтр, 9, 2), Сред(ДатаСтр, 12, 2), Сред(ДатаСтр, 15, 2), Сред(ДатаСтр, 18, 2));	
	
	Возврат ДатаДокумента;
	
КонецФункции

Функция ПолучитьКонтрагентаВладельца(лПартнер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Партнер = &Партнер
	|	И Контрагенты.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)";	
	Запрос.УстановитьПараметр("Партнер", лПартнер);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Ссылка;
	Иначе	
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Создание_банковских_Выписок

Функция ПолучитьСписокБанковскихСчетов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскиеСчетаОрганизаций.Ссылка КАК БанковскийСчет,
	|	БанковскиеСчетаОрганизаций.НомерСчета КАК НомерСчета,
	|	БанковскиеСчетаОрганизаций.Банк.Код КАК БИКБанка
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|ГДЕ
	|	БанковскиеСчетаОрганизаций.ПометкаУдаления = ЛОЖЬ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

Функция ПолучитьМассивДатДляФормированияВыписки(Банковскийсчет)

	ТаблицаДата = Новый ТаблицаЗначений;
	ТаблицаДата.Колонки.Добавить("Дата");
	ТаблицаДата.Колонки.Добавить("СоздаватьВыписку");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпискаПоРасчетномуСчету.Дата КАК Дата
		|ИЗ
		|	Документ.ВыпискаПоРасчетномуСчету КАК ВыпискаПоРасчетномуСчету
		|ГДЕ
		|	ВыпискаПоРасчетномуСчету.БанковскийСчет = &БанковскийСчет
		|	И ВыпискаПоРасчетномуСчету.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата() - 2*86400));
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата() - 14*86400));
	
	ТаблицаВыписок = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицыВыписок ИЗ ТаблицаВыписок Цикл
		СтрокаТаблицыВыписок.Дата = НачалоДня(СтрокаТаблицыВыписок.Дата);
	КонецЦикла;	
		
	//Таблица может содержать только 12 строк
    ПроверяемаяДата = НачалоДня(ТекущаяДата() - 14*86400);
	Пока ПроверяемаяДата <= КонецДня((ТекущаяДата() - 2*86400)) Цикл   
		Если ТаблицаВыписок.Найти(ПроверяемаяДата, "Дата") = Неопределено Тогда
			СтрокаТаблицыДат = ТаблицаДата.Добавить();
			СтрокаТаблицыДат.Дата = ПроверяемаяДата;
		КонецЕсли;	
		ПроверяемаяДата = ПроверяемаяДата + 24*60*60; //прибавляем день
	КонецЦикла;
	
	//Теперь проверяем даты по которым надо создавать выписки на наличие платежных поручений, если их нет, то и выписку не создаем
	Для Каждого СтрокаТаблицыДат Из ТаблицаДата Цикл
		ПроверяемаяДата = СтрокаТаблицыДат.Дата;
		ВыборкаДокументовСписания = Документы.СписаниеБезналичныхДенежныхСредств.Выбрать(НачалоДня(ПроверяемаяДата), КонецДня(ПроверяемаяДата));
		Если ВыборкаДокументовСписания.Следующий() Тогда
			ЕстьДокументыСписания = Истина;
		Иначе
			ЕстьДокументыСписания = Ложь;
		КонецЕсли;
		
		ВыборкаДокументовПоступления = Документы.ПоступлениеБезналичныхДенежныхСредств.Выбрать(НачалоДня(ПроверяемаяДата), КонецДня(ПроверяемаяДата));
		Если ВыборкаДокументовСписания.Следующий() Тогда
			ЕстьДокументыПоступления = Истина;
		Иначе
			ЕстьДокументыПоступления = Ложь;
		КонецЕсли;
		
		Если ЕстьДокументыСписания ИЛИ ЕстьДокументыПоступления Тогда
			СтрокаТаблицыДат.СоздаватьВыписку = Истина;
		Иначе
			СтрокаТаблицыДат.СоздаватьВыписку = Ложь;
		КонецЕсли;
	КонецЦикла;	
	
	// теперь надо удалить строки по которым не надо формировать выписки
	Отбор = Новый Структура("СоздаватьВыписку", Истина);
	МассивСтрокСДатами = ТаблицаДата.НайтиСтроки(Отбор);
	
	//проверим по каждой дате, по которой надо сделать выписку, есть ли не проведенные документы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеБезналичныхДенежныхСредств.Дата КАК Дата,
		|	СписаниеБезналичныхДенежныхСредств.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
		|ГДЕ
		|	СписаниеБезналичныхДенежныхСредств.ПометкаУдаления = ЛОЖЬ
		|	И СписаниеБезналичныхДенежныхСредств.Проведен = ЛОЖЬ
		|	И СписаниеБезналичныхДенежныхСредств.Дата В(&МассивДат)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеБезналичныхДенежныхСредств.Дата,
		|	ПоступлениеБезналичныхДенежныхСредств.Ссылка
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления = ЛОЖЬ
		|	И ПоступлениеБезналичныхДенежныхСредств.Проведен = ЛОЖЬ
		|	И ПоступлениеБезналичныхДенежныхСредств.Дата В(&МассивДат)";
	
	Запрос.УстановитьПараметр("МассивДат", МассивСтрокСДатами);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Индекс = МассивСтрокСДатами.Найти(ВыборкаДетальныеЗаписи.Дата);
		Если Индекс <> Неопределено Тогда
			//удаляем дату, так как сначала надо либо провести документ, либо пометить на удаление
			Сообщить("За дату: " + ВыборкаДетальныеЗаписи.Дата + " есть не проведенные банковские документы, их надо либо провести, либо пометить на удаление!");
			МассивСтрокСДатами.Удалить(Индекс);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МассивСтрокСДатами;
КонецФункции	

Процедура СоздатьБанковскуюВыписку(ДатаДокумента, БанковскийСчет)
	
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат;
	КонецЕсли;
	
	НоваяБанковскаяВыписка = Документы.ВыпискаПоРасчетномуСчету.СоздатьДокумент();
	НоваяБанковскаяВыписка.БанковскийСчет = БанковскийСчет;
	НоваяБанковскаяВыписка.Дата = ДатаДокумента;
	НоваяБанковскаяВыписка.Организация = БанковскийСчет.Владелец;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеБезналичныхДенежныхСредств.Ссылка КАК Ссылка,
		|	ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредств.Дата МЕЖДУ &НачалоДняДатаДокумента И &КонецДняДатаДокумента
		|	И ПоступлениеБезналичныхДенежныхСредств.БанковскийСчет = &БанковскийСчет";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("НачалоДняДатаДокумента", НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("КонецДняДатаДокумента", КонецДня(ДатаДокумента));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СуммаПоступленияВсего = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаБВПриход = НоваяБанковскаяВыписка.ВходящиеПлатежи.Добавить();
		СтрокаБВПриход.ПлатежныйДокумент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаБВПриход.Сумма = ВыборкаДетальныеЗаписи.СуммаДокумента;
		СуммаПоступленияВсего = СуммаПоступленияВсего + ВыборкаДетальныеЗаписи.СуммаДокумента;
	КонецЦикла;
	НоваяБанковскаяВыписка.СуммаПоступленияВсего = СуммаПоступленияВсего;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеБезналичныхДенежныхСредств.Ссылка КАК Ссылка,
		|	СписаниеБезналичныхДенежныхСредств.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
		|ГДЕ
		|	СписаниеБезналичныхДенежныхСредств.Дата МЕЖДУ &НачалоДняДатаДокумента И &КонецДняДатаДокумента
		|	И СписаниеБезналичныхДенежныхСредств.БанковскийСчет = &БанковскийСчет";
	
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	Запрос.УстановитьПараметр("НачалоДняДатаДокумента", НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("КонецДняДатаДокумента", КонецДня(ДатаДокумента));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СуммаСписанияВсего = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаБВРасход = НоваяБанковскаяВыписка.ИсходящиеПлатежи.Добавить();
		СтрокаБВРасход.ПлатежныйДокумент = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаБВРасход.Сумма = ВыборкаДетальныеЗаписи.СуммаДокумента;
		СуммаСписанияВсего = СуммаСписанияВсего + ВыборкаДетальныеЗаписи.СуммаДокумента;
	КонецЦикла;
	НоваяБанковскаяВыписка.СуммаСписанияВсего = СуммаСписанияВсего;
	
	Если НоваяБанковскаяВыписка.ИсходящиеПлатежи.Количество() > 0 ИЛИ НоваяБанковскаяВыписка.ВходящиеПлатежи.Количество() > 0 Тогда
		Попытка
			НоваяБанковскаяВыписка.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НоваяБанковскаяВыписка.Записать(РежимЗаписиДокумента.Запись);
			ТекстОшибки = "Ошибка при проведении Банковской выписки " + ОписаниеОшибки() + "";
			Сообщить(ТекстОшибки, СтатусСообщения.Важное);
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
		КонецПопытки;	
	КонецЕсли;
КонецПроцедуры	

Процедура СоздатьВыписки() Экспорт
	
	//Получаем список банковских счетов
	
	ТаблицаБанковскихСчетов = ПолучитьСписокБанковскихСчетов();
	
	Если ТаблицаБанковскихСчетов.Количество() = 0 Тогда
		Возврат; //нет счетов - нет выписок
	КонецЕсли;	
	
	//По каждому счету будет отдельная выписка, за каждый день
	
	Для каждого СтрокаТаблицыБС Из ТаблицаБанковскихСчетов Цикл
		
		//получим даты по которым выписки еще не созданы, 
		//смотрим за последние 2 недели, и до текущей дату минус 2 дня
		//на случай, если банк какие то платежки провел с запозданием
		//формируем массив дат по контретому счету
		МассивДат = ПолучитьМассивДатДляФормированияВыписки(СтрокаТаблицыБС.БанковскийСчет);
		
		Для Каждого лДата из МассивДат Цикл
			СоздатьБанковскуюВыписку(лДата.Дата, СтрокаТаблицыБС.БанковскийСчет);
		КонецЦикла;	
		
	КонецЦикла;	
		
	
КонецПроцедуры

#КонецОбласти
