
&После("УстановкаПараметровСеанса")
Процедура НВД_УстановкаПараметровСеанса(ИменаПараметровСеанса) 
	ТаблицаПравилРегистрацииОбъектов = ОбменДаннымиСервер.ПолучитьПравилаРегистрацииОбъектов();
	ПараметрыСеанса.ПравилаРегистрацииОбъектов = Новый ХранилищеЗначения(ТаблицаПравилРегистрацииОбъектов);
	
	Пользователь = Справочники.Пользователи.ПустаяСсылка();
	Попытка
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
		ПараметрыСеанса.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Исключение
		ПараметрыСеанса.Пользователь = АвторизацияПользователя();
		Если НЕ ПараметрыСеанса.Пользователь = Ложь Тогда
			Пользователь = ПараметрыСеанса.Пользователь;
			ПараметрыСеанса.ТекущийПользователь = Пользователь;
		КонецЕсли;
	КонецПопытки;
	ПараметрыСеанса.ОграничиватьВидимостьСтатейДоходовИРасходов = Пользователь.ОграничиватьВидимостьСтатейДоходовИРасходов;
КонецПроцедуры
