
&НаСервере
Процедура СделатьНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ПолучитьQRКодПоЗаказу(Объект.Заказ);
КонецПроцедуры
&НаСервере
Процедура ОбновитьСтатусыНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ОбновитьСтатусыQRКодов();
КонецПроцедуры

&НаКлиенте
Процедура Сделать(Команда)
	СделатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Заказ = Документы.CRM_Событие.НайтиПоНомеру("00000032524");
	Объект.Сумма = Объект.Заказ.СуммаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	ОбновитьСтатусыНаСервере();
КонецПроцедуры

&НаСервере
Функция ПоказатьQRКодНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СБП_QRКоды.imageParams_content КАК imageParams_content,
	|	СБП_QRКоды.Заказ КАК Заказ,
	|	СБП_QRКоды.qrcId КАК qrcId
	|ИЗ
	|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Данные = ВыборкаДетальныеЗаписи.imageParams_content.Получить();
		
		ДД = Base64Значение(Данные);
		Картинка = Новый Картинка(ДД, Ложь);
		СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
		//Отбор = Новый Структура;
		//Отбор.Вставить("БанковскийСчет", ВыборкаДетальныеЗаписи.БанковскийСчет);
		//Отбор.Вставить("qrcId", ВыборкаДетальныеЗаписи.qrcId);
		//КлючЗаписи = РегистрыСведений.СБП_QRКоды.СоздатьКлючЗаписи(Отбор);
		//СсылкаНаКартинку = ДД; //ПолучитьНавигационнуюСсылку(КлючЗаписи, "imageParams_content");
	КонецЕсли;
	Возврат ДД;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции

&НаКлиенте
Процедура ПоказатьQRКод(Команда)
	ПоказатьQRКодНаСервере();
КонецПроцедуры
