
&НаКлиенте
&Вместо("ОбработатьШтрихкоды")
Процедура НВД_ОбработатьШтрихкоды(Данные)
	
	ШК = Данные.Штрихкод; // Штрихкод[0].Штрихкод;
	
	Если ПустаяСтрока(ШК) Тогда
		//ПоказатьПредупреждение(,"Штрих-код не распознан");
		ОткрытьФорму("ОбщаяФорма.ФормаПредупреждения", Новый Структура("ЗаголовокИнформации, ТекстИнформации, Состояние", "Ошибка", "Штрих-код не распознан", "Ошибка"));			
		Возврат;
	КонецЕсли;
	
	//Если ЗаказНаПроизводство.Пустая() Тогда
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница Тогда
		//Отсканировали ШК заказа	
		
		СсылкаНаЗаказНаПроизводство = ПолучитьЗаказНаПроизводство(ШК);
		Если НЕ СсылкаНаЗаказНаПроизводство.Пустая() Тогда			
			ВыборДокументаФрагмент(СсылкаНаЗаказНаПроизводство);
		Иначе			
			//Сообщить("Не найден заказ на производство в статусе ""В производстве"" с номером расчета " + ШК);
			//ДобавитьВИсторию("Не найден заказ на производство в статусе ""В производстве"" с номером расчета " + ШК);
			ТекстСообщения = "Не найдена уникальная продукция с номером " + ШК + " с заказом на производство в статусе ""В ПРОИЗВОДСТВЕ""";
			//ПоказатьПредупреждение(,ТекстСообщения);
			ОткрытьФорму("ОбщаяФорма.ФормаПредупреждения", Новый Структура("ЗаголовокИнформации, ТекстИнформации, Состояние", "Ошибка", ТекстСообщения, "Ошибка"));
		КонецЕсли;		
		
	Иначе

		//#14336
		Если Лев(ШК, 12) = "000000000000" Тогда
			Отмена(Неопределено);
			Возврат;
		ИначеЕсли Лев(ШК, 12) = "000000000001" Тогда
			ОК(Неопределено);
			Возврат;
		ИначеЕсли Лев(ШК, 12) = "000000000003" Тогда
			Выполнен(Неопределено);
			Возврат;
		ИначеЕсли Лев(ШК, 12) = "000000000004" Тогда
			ИзОстатков(ЭтаФорма.Команды.Найти("ИзОстатков"));
			Возврат;
		ИначеЕсли Лев(ШК, 12) = "000000000005" Тогда
			ИзМатериалаЗаказчика(ЭтаФорма.Команды.Найти("ИзМатериалаЗаказчика"));
			Возврат;
		ИначеЕсли Лев(ШК, 12) = "000000000006" Тогда
			ЗаменитьМатериал(ЭтаФорма.Команды.Найти("ЗаменитьМатериал"));
			Возврат;
		ИначеЕсли Лев(ШК, 12) = "000000000007" Тогда
			ИзменитьКоличество(ЭтаФорма.Команды.Найти("ИзменитьКоличество"));
			Возврат;	
		КонецЕсли;
		
		ШК_ИД = Лев(ШК, 2);
		// #13536 изменена процедура: раньше ШК всегда начиналась с 88, сейчас с 86/87/88
		ДанныеПоШК = ШтрихкодированиеПотолкиКлиент.ОбработатьШтрихкод(ШК);
		Если ДанныеПоШК = Неопределено Тогда
			Возврат;
		КонецЕсли;
	
		Если ШК_ИД = "87" Тогда //ПоПроизводственнымОперациям И ПроизводственнаяОперация.Пустая() И НЕ ШКСотрудникаСодержитКодОперации Тогда
			//Отсканировали ШК операции
			
			//ШКОперации = Сред(ШК, 3, 5);	
			//Результат = ПолучитьПроизводственнуюОперацию(Строка("0000" + ШКОперации));
			//Если ТипЗнч(Результат) = тип("Строка") Тогда
			//	ПоказатьПредупреждение(,Результат);
			//Иначе
			//	ПроизводственнаяОперация = Результат;
			//КонецЕсли;
			
			ПроизводственнаяОперация = ДанныеПоШК.Операция;
			
		ИначеЕсли ШК_ИД = "88" Тогда //ПоПроизводственнымОперациям И ПроизводственнаяОперация.Пустая() И ШКСотрудникаСодержитКодОперации Тогда	
			//Отсканировали ШК операции+сотрудника (единый)
			
			//ШКОперации = Сред(ШК, 3, 5);		
			//Результат = ПолучитьПроизводственнуюОперацию(Строка("0000" + ШКОперации));
			//Если ТипЗнч(Результат) = тип("Строка") Тогда
			//	ПоказатьПредупреждение(,Результат);
			//	Возврат;
			//Иначе
			//	ПроизводственнаяОперация = Результат;
			//КонецЕсли;
			//
			//ШКСотрудника = Сред(ШК, 8, 5);		
			//Результат = ПолучитьСотрудника(Строка("0000" + ШКСотрудника));
			//Если ТипЗнч(Результат) = тип("Строка") Тогда
			//	ПоказатьПредупреждение(,Результат);
			//Иначе
			//	Сотрудник = Результат;
			//КонецЕсли;
			
			ПроизводственнаяОперация = ДанныеПоШК.Операция;
			Сотрудник = ДанныеПоШК.Сотрудник;
			
			//#13729
			Если НЕ ЭтоРаботникПроизводства(Сотрудник) Тогда
				ПроизводственнаяОперация = ПредопределенноеЗначение("Справочник.ПроизводственныеОперации.ПустаяСсылка");
				Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
				Возврат;
			КонецЕсли;
				
			Результат = ДобавитьИсполнителяВСхемеПоОперациям();
			Если Не ПустаяСтрока(Результат) Тогда
				ПоказатьПредупреждение(,Результат);
			КонецЕсли;
			
		ИначеЕсли ШК_ИД = "86" Тогда //Сотрудник.Пустая() Тогда	
			//Отсканировали ШК сотрудника
			
			//ШКСотрудника = Сред(ШК, 8, 5);		
			//Результат = ПолучитьСотрудника(Строка("0000" + ШКСотрудника));
			//Если ТипЗнч(Результат) = тип("Строка") Тогда
			//	ПоказатьПредупреждение(, Результат);
			//	Возврат;
			//Иначе
			//	Сотрудник = Результат;
			//КонецЕсли;
			
			Сотрудник = ДанныеПоШК.Сотрудник;
			
			//#13729
			Если НЕ ЭтоРаботникПроизводства(Сотрудник) Тогда
				Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
				Возврат;
			КонецЕсли;

			Если ПоПроизводственнымОперациям Тогда
				Результат = ДобавитьИсполнителяВСхемеПоОперациям();
			Иначе
				Результат = ДобавитьИсполнителяВБригаднойСхеме();
			КонецЕсли;
			Если Не ПустаяСтрока(Результат) Тогда
				ПоказатьПредупреждение(, Результат);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;		

КонецПроцедуры

&НаСервере
Процедура НВД_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	//++17110
	Если Метаданные.Версия < "3.3.0" И ТекущийПользователь.УДАЛИТЬ_РазрешеноРедактироватьМатериалыЗаказаНаПроизводство Тогда
		// Взводим нужный флаг
		ОбъектПользователь = ТекущийПользователь.ПолучитьОбъект();
		ОбъектПользователь.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства = Истина;
		ОбъектПользователь.УДАЛИТЬ_РазрешеноРедактироватьМатериалыЗаказаНаПроизводство = Ложь;
		ОбъектПользователь.ОбменДанными.Загрузка = Истина;
		ОбъектПользователь.Записать();
	КонецЕсли;
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП, 
																	|РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства", ТекущийПользователь);
		
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();
	ШКСотрудникаСодержитКодОперации = Истина; //Константы.ШтрихкодСотрудникаСодержитКодОперации.Получить();  // #13536
	ПоПроизводственнымОперациям = Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить();
	
	//++ №14141 количество колонок по производственным операциям
	МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию = Константы.МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию.Получить();
	
	Для Сч = 1 По 4 Цикл
		Элементы["ИсполнителиПоОперациямСотрудник" + Сч].Видимость = (Сч <= МаксимальноеКоличествоСотрудниковВВыпускеНаОперацию);
	КонецЦикла;
	//-- №14141
	
	//++ #15805
	Элементы.ГруппаЗаказы.Видимость = Константы.ВыводитьСписокЗаказовНаПроизводствоВРМСотрудникаПроизводства.Получить();
	//nva+++
	Элементы.ГруппаОтчет.Видимость = Константы.НВД_ВыводитьОтчетПоВыполненнымЗаказамНаПроизводствоВРМСотрудникаПроизводства.Получить();
	ВыработкаЗаТекущийДень.Параметры.УстановитьЗначениеПараметра("ТекДатаНачалоДня", НачалоДня(ТекущаяДата()));
	ВыработкаЗаТекущийДень.Параметры.УстановитьЗначениеПараметра("ТекДатаКонецДня", КонецДня(ТекущаяДата()));
	ВыработкаЗаТекущийДень2.Параметры.УстановитьЗначениеПараметра("ТекДатаНачалоДня", НачалоДня(ТекущаяДата()));
	ВыработкаЗаТекущийДень2.Параметры.УстановитьЗначениеПараметра("ТекДатаКонецДня", КонецДня(ТекущаяДата()));
	//nva---
	Если ПолучитьФункциональнуюОпцию("НесколькоТочекПроизводства") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Цехи.Ссылка КАК Ссылка,
		|	Цехи.Код КАК Код1,
		|	Цехи.Наименование КАК Наименование,
		|	Цехи.КраткоеПредставление КАК КраткоеПредставление,
		|	Цехи.Код КАК Код
		|ИЗ
		|	Справочник.Цехи КАК Цехи
		|ГДЕ
		|	НЕ Цехи.Архивный
		|	И НЕ Цехи.ПометкаУдаления";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДобавитьКомандуИКнопкуОтбораПоЦеху(Выборка.Ссылка, Выборка.Код, Выборка.Наименование, Выборка.КраткоеПредставление);	
		КонецЦикла;
			
	КонецЕсли;
	
	ВосстановитьНастройкиФормы();	
	УстановитьОтборЗаказов();
	//-- #15805
	
	//#16317
	Элементы.ЗаменитьМатериал.Видимость     = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ИзменитьКоличество.Видимость   = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ЗаменитьМатериал1.Видимость    = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ИзменитьКоличество1.Видимость  = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ИзОстатков.Видимость 			= РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
	Элементы.ИзМатериалаЗаказчика.Видимость = РеквизитыПользователя.РазрешитьИзменениеМатериаловИИхКоличестваВЗнПвРМСП ИЛИ РеквизитыПользователя.РазрешитьИзменениеКоличестваПриВыпускеВРМСотрудникаПроизводства;
		
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНачальнаяСтраница;
	ТекущийЭлемент = Элементы.ИмитацияШК;
	
КонецПроцедуры

