#Область Доставка

Функция ПолучитьМассивСсылокНаДоставки(ЗаказКлиента) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьДоставкуТовара") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявкаНаДоставкуОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставкуОснования
	|ГДЕ
	|	ЗаявкаНаДоставкуОснования.Основание = &Основание
	|	И НЕ ЗаявкаНаДоставкуОснования.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаДоставкуОснования.Ссылка.Дата";
	Запрос.УстановитьПараметр("Основание", ЗаказКлиента);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
КонецФункции

#КонецОбласти

#Область КонтактнаяИнформация

Функция ПолучитьТелефонКонтактногоЛица(КонтактноеЛицо) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	               |ИЗ
	               |	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	               |ГДЕ
	               |	КонтактныеЛицаКонтактнаяИнформация.Тип = &Тип
	               |	И КонтактныеЛицаКонтактнаяИнформация.Вид = &Вид
				   |	И КонтактныеЛицаКонтактнаяИнформация.Ссылка = &КонтактноеЛицо";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);
	
	Результатзапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерТелефона;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТелефонКонтрагента(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Тип = &Тип
	               |	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
				   |	И КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент";
	
	Запрос.УстановитьПараметр("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	Запрос.УстановитьПараметр("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента"));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результатзапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерТелефона;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции  

Функция ПолучитьEmailКонтрагента(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Тип = &Тип
	               |	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
				   |	И КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент";
	
	Запрос.УстановитьПараметр("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	Запрос.УстановитьПараметр("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailКонтрагента"));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результатзапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АдресЭП;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#Область ПолучениеРеквизитовСправочниковИДокументов

Функция ПолучитьЦветМеткиКонтрагента(Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент.Метка) Тогда
		Если ЗначениеЗаполнено(Контрагент.Метка.НастройкаЦвета) Тогда	
			Возврат СериализаторXDTO.XMLЗначение(Тип("Цвет"), Контрагент.Метка.НастройкаЦвета);
		Иначе
			Возврат "";
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

#КонецОбласти 

#Область УсловноеОформление

// Функция - Добавить условное оформление
//  https://infostart.ru/1c/articles/1335442/
//
// Параметры:
//  ФормаОбъекта         - ФормаПриложения                 - управляемая форма
//  ПараметрыОформления     - Структура                     - параметры оформления
//  Отборы                 - Массив, Структура             - возможен массив структур
//              * Ключи -
//              ** ТЧ - Строка - имя таблицы
//              ** Поле
//              ** ПолеДляОтбора - Строка - имя поля
//              ** Значение - Произвольный - устанавливаемое значение
//              ** ВидСравнения - ВидСравненияКомпоновкиДанных - необязательное
//  ВидГруппы             - ТипГруппыЭлементовОтбораКомпоновкиДанных     - необязательное, по умолчанию "ГруппаИ"
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//  - Элемент - количество элементов
//  - Отбор - количество отборов
// 
//ЭлементОформления = СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
//	Элемент = ЭлементОформления.Оформление.Элементы.Найти("ЦветФона");
//	Элемент.Значение = WebЦвета.СеребристоСерый;
//	Элемент.Использование = Истина;
//	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ЭлементОтбора.Использование = Истина;
//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.дор_МинМаксЗаполнено");
//	ЭлементОтбора.ПравоеЗначение = Ложь;
//	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
//	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Наименование");
//	ПолеОформления.Использование = Истина;
Функция ДобавитьУсловноеОформление(ФормаОбъекта, ПараметрыОформления, Отборы, ВидГруппы = Неопределено) экспорт
    
    Если Не ТипЗнч(Отборы) = Тип("Массив") Тогда
        Отборы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отборы);
    КонецЕсли;
    Отбор = Отборы[0];
    ПолеОформления = СтрЗаменить(Отбор.ТЧ,"Объект.","");
    //Если ТипЗнч(             
	//ФормаОбъекта.Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
    НовыйЭлемент = ФормаОбъекта[Отбор.ТЧ].КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить(); 
    Для Каждого Элемент Из ПараметрыОформления Цикл
        
        Если Элемент.Ключ="Поле" Тогда
            ПолеОформления = Элемент.Значение;
        Иначе
            НовыйЭлемент.Оформление.УстановитьЗначениеПараметра(Элемент.Ключ, Элемент.Значение);
        КонецЕсли;
        
    КонецЦикла;
    НовыйЭлемент.Использование = Истина;
    
    ОформляемыеПоля = НовыйЭлемент.Поля.Элементы.Добавить();
    ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления);
    
    Если Отборы.Количество()>1 Тогда
        ГруппаОтбора = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
        Если ЗначениеЗаполнено(ВидГруппы) Тогда
            ГруппаОтбора.ТипГруппы = ВидГруппы;
        Иначе
            ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
        КонецЕсли;
        ГруппаОтбора.Использование = Истина;
    Иначе
        ГруппаОтбора = Неопределено;
    КонецЕсли;
    
    Для Каждого Отбор Из Отборы Цикл
        
        Если ГруппаОтбора = Неопределено Тогда
            ЭлементОтбор = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        Иначе
            ЭлементОтбор = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        КонецЕсли;
        
        //ЭлементОтбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(Отбор.ТЧ+"."+Отбор.Поле); 
		ЭлементОтбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(Отбор.Поле);
        
        Если Отбор.Свойство("ВидСравнения") Тогда
            ЭлементОтбор.ВидСравнения    = Отбор.ВидСравнения;
        Иначе    
            ЭлементОтбор.ВидСравнения    = ВидСравненияКомпоновкиДанных.Равно;
        КонецЕсли;
        
        ЭлементОтбор.ПравоеЗначение = Отбор.Значение;
    КонецЦикла;
    
    Возврат Новый Структура("Элемент, Отбор", ФормаОбъекта[Отбор.ТЧ].КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Количество()-1, НовыйЭлемент.Отбор.Элементы.Количество()-1);
    
КонецФункции

Процедура УстановитьОформлениеКолонкиКонтрагентДинамическогоСпискаВСоответствииСМеткой(ФормаОбъекта, ИмяДинамическогоСписка) Экспорт
	
	Метка = Справочники.МеткиКонтрагентов.Выбрать();
	Пока Метка.Следующий() Цикл
		
		Если Метка.НастройкаЦвета = "" ИЛИ Метка.ПометкаУдаления ИЛИ Метка.ЭтоГруппа Тогда 
			Продолжить;
		КонецЕсли;
		
		ЦветТекста = СериализаторXDTO.XMLЗначение(Тип("Цвет"), Метка.НастройкаЦвета);
		ОтборУсловногоОформления = Новый Структура("ТЧ, Поле, Значение, ВидСравнения", ИмяДинамическогоСписка, "Контрагент.Метка", Метка.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
		
		ПараметрыОформления = Новый Структура; 
		ПараметрыОформления.Вставить("Поле", "Контрагент");
		ПараметрыОформления.Вставить("ЦветТекста", ЦветТекста); 
		
		ДобавитьУсловноеОформление(ФормаОбъекта, ПараметрыОформления, ОтборУсловногоОформления);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
