&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	
	ВыполнитьКомандуНаСервере();
	
	//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	//ОбработкаОбъект.ВыполнитьПроверкуПлатежейПоQRКодам();

КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере()
	
	//ПараметрыРаботы = ПолучитьПараметрыПодключенияКОнЛайнКассе();
	
	ДокументСсылка = Документы.ПоступлениеНаРасчетныйСчет.НайтиПоНомеру("000000205",ТекущаяДата()); 
	
	// «full_prepayment» – предоплата 100%. Полная
	//предварительная оплата до момента передачи
	//предмета расчета.
	//• «prepayment» – предоплата. Частичная
	//предварительная оплата до момента передачи
	//предмета расчета.
	//• «advance» – аванс.
	//• «full_payment» – полный расчет. Полная
	//оплата, в том числе с учетом аванса
	//(предварительной оплаты) в момент передачи
	//предмета расчета.
	//• «partial_payment» – частичный расчет и кредит.
	//Частичная оплата предмета расчета в момент
	//его передачи с последующей оплатой в кредит.
	//• «credit» – передача в кредит. Передача
	//предмета расчета без его оплаты в момент его
	//передачи с последующей оплатой в кредит.
	//• «credit_payment» – оплата кредита. Оплата
	//предмета расчета после его получения
	
	
	//• «commodity» – товар. О реализуемом товаре, за
	//исключением подакцизного товара
	//(наименование и иные сведения, описывающие
	//товар).
	//• «excise» – подакцизный товар. О реализуемом
	//подакцизном товаре (наименование и иные
	//сведения, описывающие товар).
	//• «job» – работа. О выполняемой работе
	//(наименование и иные сведения, описывающие
	//работу).
	//• «service» – услуга. Об оказываемой услуге
	//(наименование и иные сведения, описывающие
	//услугу).
	//• «payment» – платеж. Об авансе, задатке,
	//предоплате, кредите, взносе в счет оплаты,
	//пени, штрафе, вознаграждении, бонусе и ином
	//аналогичном предмете расчета.
	
	//ПараметрыРаботы.Вставить("СпособРасчета", "advance");
	//ПараметрыРаботы.Вставить("ПредметРасчета", "payment");
	
   // JSON = ПоступлениеНаРасчетныйСчетвJSON(ДокументСсылка, ПараметрыРаботы);
   
	//ТекстСообщения = "";
	//НадоСоздавать = Ложь;
	//ПроверитьЧек(ДокументСсылка, ТекстСообщения, НадоСоздавать, "Приход");
	//Если НадоСоздавать Тогда
	//	СоздатьЧек(ДокументСсылка, ТекстСообщения, "Приход");
	//КонецЕсли;
	
	
КонецПроцедуры
