
#Область РаботаССайтом 

Функция НовыеПараметрыЗапросаДляОнЛайнКассы()
	
	Касса = Константы.НВД_СБПКасса.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТокеныДляОнлайнКасс.Касса КАК Касса,
		|	ТокеныДляОнлайнКасс.Токен КАК Токен,
		|	ТокеныДляОнлайнКасс.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		|	РегистрСведений.ТокеныДляОнлайнКасс КАК ТокеныДляОнлайнКасс
		|ГДЕ
		|	ТокеныДляОнлайнКасс.Касса = &Касса";
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ТекущаяДата() - ВыборкаДетальныеЗаписи.ДатаСоздания > 23*60*60 Тогда
			//надо получить новый токен
			Токен = "";
		Иначе	
			// Берем токен из регистра
			Токен = ВыборкаДетальныеЗаписи.Токен;	
		КонецЕсли;
	Иначе
		//Надо получить новый токен
		Токен = "";
	КонецЕсли;
	
	АдресСайта = Константы.НВД_АдресСервисаСБПКассы.Получить();
	КодГруппы = Константы.НВД_КодГруппыДляКассыСБП.Получить(); 
	Логин = Константы.НВД_ЛогинДляКассыСБП.Получить();
	Пароль = Константы.НВД_ПарольСБПДляКассыСБП.Получить();
	ЭлПочтаОрганизации = Константы.НВД_ЭлПочтаДляСБПКассы.Получить();	
	СайтОрганизации = Константы.НВД_АдресСайтаДляСБПКассы.Получить();
	
	Если НЕ ЗначениеЗаполнено(АдресСайта) Тогда
		АдресСайта = "https://online.atol.ru";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодГруппы) Тогда
		КодГруппы = "v4-online-atol-ru_4179";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Логин) Тогда
		Логин = "v4-online-atol-ru";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пароль) Тогда
		Пароль = "iGFFuihss";
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстЗапроса");
	Результат.Вставить("ТекстСообщения");
	ИмяСервера = СтрЗаменить(АдресСайта,"https://","");
	ИмяСервера = СтрЗаменить(ИмяСервера,"/","");
	Результат.Вставить("ИмяСервера",ИмяСервера);
	Результат.Вставить("Схема","https");
	Результат.Вставить("Порт");
	Результат.Вставить("Прокси",ПолучениеФайловИзИнтернета.ПолучитьПрокси(Результат.Схема));
	Результат.Вставить("ЗащищенноеСоединение", Истина);
	Результат.Вставить("ОтветСервера");
	Результат.Вставить("Соединение");
	Результат.Вставить("ТелоЗапроса");
	Результат.Вставить("GUID_1С");
	Результат.Вставить("uuid_Атол");
	Результат.Вставить("Операция");
	Результат.Вставить("МетодЗапроса");
	Результат.Вставить("Токен", Токен);
	Результат.Вставить("ТокенДатаСоздания");
	Результат.Вставить("КодГруппы", КодГруппы);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("Касса", Касса);
	Результат.Вставить("ЭлПочтаОрганизации", ЭлПочтаОрганизации); 
	Результат.Вставить("СайтОрганизации", СайтОрганизации); 
	Результат.Вставить("СпособРасчета");
	Результат.Вставить("ПредметРасчета");
	Результат.Вставить("ВидОплаты", 0);
	Результат.Вставить("ТелефонКлиентаСБП");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОтветССайта(ПараметрыРаботы)

	ПараметрыРаботы.ТекстСообщения = "";
	ПараметрыРаботы.ОтветСервера = "";
	
	СоединениеССервером(ПараметрыРаботы);
	
	Если ПараметрыРаботы.Соединение = Неопределено Тогда
		ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Ошибка при установке соединения с сайтом.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-type","application/json");
	ЗаголовокHTTP.Вставить("charset","utf-8");
	Если ЗначениеЗаполнено(ПараметрыРаботы.Токен) Тогда
		ЗаголовокHTTP.Вставить("Token",ПараметрыРаботы.Токен);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыРаботы.Операция) Тогда
		ЗаголовокHTTP.Вставить("operation",ПараметрыРаботы.Операция);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыРаботы.КодГруппы) Тогда
		ЗаголовокHTTP.Вставить("group_code",ПараметрыРаботы.КодГруппы);
	КонецЕсли;
	ЗаголовокHTTP.Вставить("api_version","v4");
	Если ЗначениеЗаполнено(ПараметрыРаботы.uuid_Атол) Тогда
		ЗаголовокHTTP.Вставить("uuid",ПараметрыРаботы.uuid_Атол);
	КонецЕсли;
	
	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыРаботы.ТекстЗапроса, ЗаголовокHTTP);
	
	Если ЗначениеЗаполнено(ПараметрыРаботы.ТелоЗапроса) Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыРаботы.ТелоЗапроса);
	КонецЕсли;
	
	Попытка
		Если ПараметрыРаботы.МетодЗапроса = "GET" Тогда
			HTTPОтветСервера = ПараметрыРаботы.Соединение.Получить(HTTPЗапрос);
		ИначеЕсли ПараметрыРаботы.МетодЗапроса = "PUT" Тогда
			HTTPОтветСервера = ПараметрыРаботы.Соединение.Записать(HTTPЗапрос);
		ИначеЕсли ПараметрыРаботы.МетодЗапроса = "POST" Тогда
			HTTPОтветСервера = ПараметрыРаботы.Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Иначе	
			HTTPОтветСервера = ПараметрыРаботы.Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		КонецЕсли;
	Исключение
		
		ДобавитьОписаниеОшибки(ПараметрыРаботы,
			ОписаниеИсключительнойОшибки(
			НСтр("ru = 'Не удалось получить данные с сайта. 
				|Проверьте правильность адреса сервера, порт,'")
				+ Символы.ПС
				+ НСтр("ru = 'а также настройки подключения к Интернет.'")));
		
		Возврат Неопределено;
	
	КонецПопытки;
	
	КодСостояния = HTTPОтветСервера.КодСостояния;
	РасшифровкаКодаСостояния = РасшифровкаКодаСостоянияHTTP(КодСостояния);
	
	ОтветСервера = HTTPОтветСервера.ПолучитьТелоКакСтроку();
	
	Успешно = Истина;
	Если НЕ ЗначениеЗаполнено(ОтветСервера) Тогда
		Успешно = Ложь;
	КонецЕсли;
	
	ПараметрыРаботы.ОтветСервера = ОтветСервера;
	
	Если КодСостояния <> 200 Тогда
		ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Ошибка получения ответа с сайта. Код ответа: '") + КодСостояния + " причина: " + РасшифровкаКодаСостояния + " ответ:" + ОтветСервера);
		Возврат Успешно;
	КонецЕсли;
		
	Если КодСостояния = 200 Тогда
		ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Ошибка получения ответа с сайта. Код ответа: '") + КодСостояния + " причина: " + РасшифровкаКодаСостояния + " ответ:" + ОтветСервера);
		Возврат Успешно;
	КонецЕсли;
	
	Если Успешно = Ложь Тогда
		ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Не удалось получить ответ сайта.'")) ;
	КонецЕсли;

	Возврат Успешно;
	
КонецФункции

Процедура СоединениеССервером(ПараметрыРаботы)
	
	Соединение = Неопределено;
	
	Попытка
		
		ssl = ?(ПараметрыРаботы.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено);
			
		Соединение = Новый HTTPСоединение(
			ПараметрыРаботы.ИмяСервера,
			ПараметрыРаботы.Порт,
			ПараметрыРаботы.Логин,
			ПараметрыРаботы.Пароль,
			ПараметрыРаботы.Прокси,
			1800,
			ssl
		);
		
	Исключение
		
		ПараметрыРаботы.ОписаниеОшибки = ОписаниеИсключительнойОшибки(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось установить соединение с сервером %1:%2. Проверьте правильность адреса сервера, порт, имя пользователя и пароль.'"),
					ПараметрыРаботы.ИмяСервера,
					ПараметрыРаботы.Порт));
		Соединение = Неопределено;
			
	КонецПопытки;
	
	ПараметрыРаботы.Соединение = Соединение; 
	
КонецПроцедуры

Функция РасшифровкаКодаСостоянияHTTP(КодСостояния)
	
	Если КодСостояния = 304 Тогда // Not Modified
		Расшифровка = НСтр("ru = 'Нет необходимости повторно передавать запрошенные ресурсы.'");
	ИначеЕсли КодСостояния = 400 Тогда // Bad Request
		Расшифровка = НСтр("ru = 'Запрос не может быть исполнен.'");
	ИначеЕсли КодСостояния = 401 Тогда // Unauthorized
		Расшифровка = НСтр("ru = 'Попытка авторизации на сервере была отклонена.'");
	ИначеЕсли КодСостояния = 402 Тогда // Payment Required
		Расшифровка = НСтр("ru = 'Требуется оплата.'");
	ИначеЕсли КодСостояния = 403 Тогда // Forbidden
		Расшифровка = НСтр("ru = 'К запрашиваемому ресурсу нет доступа.'");
	ИначеЕсли КодСостояния = 404 Тогда // Not Found
		Расшифровка = НСтр("ru = 'Запрашиваемый ресурс не существует на сервере.'");
	ИначеЕсли КодСостояния = 405 Тогда // Method Not Allowed
		Расшифровка = НСтр("ru = 'Метод запроса не поддерживается сервером.'");
	ИначеЕсли КодСостояния = 406 Тогда // Not Acceptable
		Расшифровка = НСтр("ru = 'Запрошенный формат данных не поддерживается сервером.'");
	ИначеЕсли КодСостояния = 407 Тогда // Proxy Authentication Required
		Расшифровка = НСтр("ru = 'Ошибка аутентификации на прокси-сервере'");
	ИначеЕсли КодСостояния = 408 Тогда // Request Timeout
		Расшифровка = НСтр("ru = 'Время ожидания сервером передачи от клиента истекло.'");
	ИначеЕсли КодСостояния = 409 Тогда // Conflict
		Расшифровка = НСтр("ru = 'Запрос не может быть выполнен из-за конфликтного обращения к ресурсу.'");
	ИначеЕсли КодСостояния = 410 Тогда // Gone
		Расшифровка = НСтр("ru = 'Ресурс на сервере был перемещен.'");
	ИначеЕсли КодСостояния = 411 Тогда // Length Required
		Расшифровка = НСтр("ru = 'Сервер требует указание ""Content-length."" в заголовке запроса.'");
	ИначеЕсли КодСостояния = 412 Тогда // Precondition Failed
		Расшифровка = НСтр("ru = 'Запрос не применим к ресурсу'");
	ИначеЕсли КодСостояния = 413 Тогда // Request Entity Too Large
		Расшифровка = НСтр("ru = 'Сервер отказывается обработать, слишком большой объем передаваемых данных.'");
	ИначеЕсли КодСостояния = 414 Тогда // Request-URL Too Long
		Расшифровка = НСтр("ru = 'Сервер отказывается обработать, слишком длинный URL.'");
	ИначеЕсли КодСостояния = 415 Тогда // Unsupported Media-Type
		Расшифровка = НСтр("ru = 'Сервер заметил, что часть запроса была сделана в неподдерживаемом формат'");
	ИначеЕсли КодСостояния = 416 Тогда // Requested Range Not Satisfiable
		Расшифровка = НСтр("ru = 'Часть запрашиваемого ресурса не может быть предоставлена'");
	ИначеЕсли КодСостояния = 417 Тогда // Expectation Failed
		Расшифровка = НСтр("ru = 'Сервер не может предоставить ответ на указанный запрос.'");
	ИначеЕсли КодСостояния = 429 Тогда // Too Many Requests
		Расшифровка = НСтр("ru = 'Слишком много запросов за короткое время.'");
	ИначеЕсли КодСостояния = 500 Тогда // Internal Server Error
		Расшифровка = НСтр("ru = 'Внутренняя ошибка сервера.'");
	ИначеЕсли КодСостояния = 501 Тогда // Not Implemented
		Расшифровка = НСтр("ru = 'Сервер не поддерживает метод запроса.'");
	ИначеЕсли КодСостояния = 502 Тогда // Bad Gateway
		Расшифровка = НСтр("ru = 'Сервер, выступая в роли шлюза или прокси-сервера, 
		                         |получил недействительное ответное сообщение от вышестоящего сервера.'");
	ИначеЕсли КодСостояния = 503 Тогда // Server Unavailable
		Расшифровка = НСтр("ru = 'Сервер временно не доступен.'");
	ИначеЕсли КодСостояния = 504 Тогда // Gateway Timeout
		Расшифровка = НСтр("ru = 'Сервер в роли шлюза или прокси-сервера 
		                         |не дождался ответа от вышестоящего сервера для завершения текущего запроса.'");
	ИначеЕсли КодСостояния = 505 Тогда // HTTP Version Not Supported
		Расшифровка = НСтр("ru = 'Сервер не поддерживает указанную в запросе версию протокола HTTP'");
	ИначеЕсли КодСостояния = 506 Тогда // Variant Also Negotiates
		Расшифровка = НСтр("ru = 'Сервер настроен некорректно, и не способен обработать запрос.'");
	ИначеЕсли КодСостояния = 507 Тогда // Insufficient Storage
		Расшифровка = НСтр("ru = 'На сервере недостаточно места для выполнения запроса.'");
	ИначеЕсли КодСостояния = 509 Тогда // Bandwidth Limit Exceeded
		Расшифровка = НСтр("ru = 'Сервер превысил отведенное ограничение на потребление трафика.'");
	ИначеЕсли КодСостояния = 510 Тогда // Not Extended
		Расшифровка = НСтр("ru = 'Сервер требует больше информации о совершаемом запросе.'");
	ИначеЕсли КодСостояния = 511 Тогда // Network Authentication Required
		Расшифровка = НСтр("ru = 'Требуется авторизация на сервере.'");
	Иначе 
		Расшифровка = НСтр("ru = '<Неизвестный код состояния>.'");
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '[%1] %2'"), 
		КодСостояния, 
		Расшифровка);
	
КонецФункции

Функция ОписаниеИсключительнойОшибки(ТекстНачалаСообщения = "", ТекстОкончанияСообщения = "")
	
	ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	
	ТекстСообщения = НСтр("ru = 'Произошла ошибка:'")
		+ " " + ТекстНачалаСообщения
		+ ?(ПустаяСтрока(ТекстОкончанияСообщения), "", Символы.ПС + ТекстОкончанияСообщения)
		+ ?(ПустаяСтрока(ПодробноеПредставлениеОшибки), "", Символы.ПС + ПодробноеПредставлениеОшибки);
		
	Возврат ТекстСообщения;
	
КонецФункции

Процедура ДобавитьОписаниеОшибки(ПараметрыПолучения, Дополнение)

	Если ПустаяСтрока(ПараметрыПолучения.ТекстСообщения) Тогда
		ПараметрыПолучения.ТекстСообщения = Дополнение;
	Иначе
		ПараметрыПолучения.ТекстСообщения = ПараметрыПолучения.ТекстСообщения + Символы.ПС + Дополнение;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьПараметрыПодключенияКОнЛайнКассе()
	
	ПараметрыРаботы = НовыеПараметрыЗапросаДляОнЛайнКассы();
 
	ПараметрыРаботы.ТекстЗапроса = "possystem/v4/getToken?login=" + ПараметрыРаботы.Логин + "&pass=" + ПараметрыРаботы.Пароль ;
	ПараметрыРаботы.МетодЗапроса = "GET";
	
	Если ЗначениеЗаполнено(ПараметрыРаботы.Токен) Тогда
		Возврат ПараметрыРаботы;
	КонецЕсли;
	
	ОтветПолучен = ПолучитьОтветССайта(ПараметрыРаботы);
	Если ОтветПолучен = Ложь или Не ЗначениеЗаполнено(ПараметрыРаботы.ОтветСервера) Тогда
		ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Токен не получен.'"));
		ТекстСообщения = ПараметрыРаботы.ТекстСообщения;
		Возврат "";
	КонецЕсли;
	
	ТокенПолучен = Ложь;
	
	JSON = Новый ЧтениеJSON();
	JSON.УстановитьСтроку(ПараметрыРаботы.ОтветСервера);
	
	Успешно = Истина;
	
	Попытка
		Результат = ПрочитатьJSON(JSON);
	Исключение
		Успешно = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не смогли прочитать ответ JSON с сайта " + ОписаниеОшибки();
		Сообщение.Сообщить();
		ТекстСообщения = "";
	КонецПопытки;
	
	Если Успешно и ТипЗнч(Результат) = Тип("Структура") Тогда
		//error		Неопределено
		//timestamp	"15.08.2023 19:58:27"	Строка
		//token	"ieh3KpTZmrBta7nhoVPduZz_VdY30ndPlWfOkbD-Z0w-nujYoAcW3N2aBCdxm_O4y16bYF_YFNy9ooU11CDrMuve3MEZtDnFb8mIBoNrCdw5AjHzJXgy_dmK_EJSFQ7Z"	Строка
		Если Результат.Свойство("error") Тогда
			Если Результат.error <> Неопределено Тогда
				ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Токен не получен.'")
				+ Символы.ПС 
				+ ПараметрыРаботы.ОтветСервера);
			Иначе
				Если Результат.Свойство("token") Тогда
					Токен = Результат.token;
					Если СтрДлина(Токен)  > 20 Тогда
						ТокенПолучен = Истина;
						ПараметрыРаботы.Токен = Токен;
					КонецЕсли;
				КонецЕсли;
				Если Результат.Свойство("timestamp") Тогда
					ТокенВремя = Результат.timestamp;
					ТокенДействуетДо = ТокенВремя +  + 86400;
					ПараметрыРаботы.ТокенДатаСоздания = Дата(Результат.timestamp);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ТекстСообщения = ПараметрыРаботы.ТекстСообщения;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыРаботы.Токен) И ЗначениеЗаполнено(ПараметрыРаботы.ТокенДатаСоздания) Тогда
		НаборЗаписейТокеновДляОнЛайнКасс = РегистрыСведений.ТокеныДляОнлайнКасс.СоздатьНаборЗаписей();
		НаборЗаписейТокеновДляОнЛайнКасс.Отбор.Касса.Установить(ПараметрыРаботы.Касса); 
		НаборЗаписейТокеновДляОнЛайнКасс.Прочитать();
		Если НаборЗаписейТокеновДляОнЛайнКасс.Количество() = 0 Тогда
    		НовыйТокен = НаборЗаписейТокеновДляОнЛайнКасс.Добавить();
    		НовыйТокен.Касса = ПараметрыРаботы.Касса;
    		НовыйТокен.ДатаСоздания = ПараметрыРаботы.ТокенДатаСоздания; 
			НовыйТокен.Токен = ПараметрыРаботы.Токен;
		Иначе
   		 	НовыйТокен = НаборЗаписейТокеновДляОнЛайнКасс[0];
			НовыйТокен.Касса = ПараметрыРаботы.Касса;
    		НовыйТокен.ДатаСоздания = ПараметрыРаботы.ТокенДатаСоздания;
			НовыйТокен.Токен = ПараметрыРаботы.Токен;
		КонецЕсли; 
		НаборЗаписейТокеновДляОнЛайнКасс.Записать();
	КонецЕсли;
	
	Возврат ПараметрыРаботы;
	
КонецФункции	

#КонецОбласти 

#Область СозданиеЧеков 

Процедура СоздатьЧекСПроверкойНаСуществующий(ДокументСсылка, ТипОперации) Экспорт
	
	ТекстСообщения = "";
	НадоСоздавать = Ложь;
	ПроверитьЧек(ДокументСсылка, ТекстСообщения, НадоСоздавать, ТипОперации);
	Если НадоСоздавать Тогда
		СоздатьЧек(ДокументСсылка, ТекстСообщения, ТипОперации);
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПолучитьGUIDСсылки(ПараметрыРаботы, ДокСсылка)
	
	ТипОперации =ПараметрыРаботы.ТипОперации;
	
	Если ТипОперации = "" или ТипОперации = "Приход" Тогда
		ПараметрыРаботы.GUID_1С = Строка(ДокСсылка.УникальныйИдентификатор());
	ИначеЕсли ТипОперации = "Возврат прихода" Тогда
		UUID_1С_Возврат = ДокСсылка.UUID_1С_Возврат;
		Если ПустаяСтрока(UUID_1С_Возврат) Тогда
			UUID_1С_Возврат = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		ПараметрыРаботы.GUID_1С = UUID_1С_Возврат;
		Попытка
			ВписатьВДокументЗначение(ДокСсылка, "uuid_Атол", UUID_1С_Возврат);
		Исключение
			ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Не удалось записать документ.'")
			+ Символы.ПС + ДокСсылка + Символы.ПС 
			+ ПараметрыРаботы.ОтветСервера);
		КонецПопытки;		
	ИначеЕсли ТипОперации = "Коррекция прихода" Тогда
		UUID_1С_Корректирующий = ДокСсылка.UUID_1С_Корректирующий;
		Если ПустаяСтрока(UUID_1С_Корректирующий) Тогда
			UUID_1С_Корректирующий = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		ПараметрыРаботы.GUID_1С = UUID_1С_Корректирующий;
		Попытка
			ВписатьВДокументЗначение(ДокСсылка, "uuid_Атол", UUID_1С_Корректирующий);
		Исключение
			ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Не удалось записать документ.'")
			+ Символы.ПС + ДокСсылка + Символы.ПС 
			+ ПараметрыРаботы.ОтветСервера);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивТоваров(ДокументСсылка, ПараметрыРаботы, КодНалога)
	
	Товары = Новый Массив;
	
	
	
	//Разбиваем сууму документа на суммы не более 10 т.р.
	
	СуммаДокумента = ДокументСсылка.Сумма;
	
	//Если нужно будет разбиение ну разные суммы то раскоментировать
	
	//ОстатокСуммыДокумента = СуммаДокумента;
	//
	//Пока ОстатокСуммыДокумента > 0 Цикл
	//	
	//	Если ОстатокСуммыДокумента < 10000 Тогда
	//		СуммаТовара = ОстатокСуммыДокумента;
	//	Иначе
	//		// нужно суммы в таблице товаров сделать различные
	//		ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел();
	//		СуммаТовара =  ГенераторСлучайныхЧисел.СлучайноеЧисло(8000,10000);
	//	КонецЕсли;		
	//	
	//	СтрокаТЧ = Новый Структура;
	//	
	//	СтрокаТЧ.Вставить("name",  "Натяжной потолок");
	//	СтрокаТЧ.Вставить("price",  СуммаТовара);
	//	СтрокаТЧ.Вставить("quantity", 1);
	//	СтрокаТЧ.Вставить("sum", СуммаТовара);
	//
	//	Если Не ЗначениеЗаполнено(ПараметрыРаботы.СпособРасчета) Тогда
	//		ПараметрыРаботы.СпособРасчета = "full_payment";
	//	КонецЕсли;
	//	СтрокаТЧ.Вставить("payment_method", ПараметрыРаботы.СпособРасчета);
	//
	//	Если Не ЗначениеЗаполнено(ПараметрыРаботы.ПредметРасчета) Тогда
	//		ПараметрыРаботы.ПредметРасчета = "commodity";
	//	КонецЕсли;
	//	СтрокаТЧ.Вставить("payment_object", ПараметрыРаботы.ПредметРасчета);
	//
	//	Налог = Новый Структура;
	//
	//	Налог.Вставить("type",КодНалога);
	//
	//	СтрокаТЧ.Вставить("vat",Налог);
	//
	//	Товары.Добавить(СтрокаТЧ);
	//	
	//	ОстатокСуммыДокумента = ОстатокСуммыДокумента - СуммаТовара;
	//КонецЦикла;
	
	СтрокаТЧ = Новый Структура;
	
	СтрокаТЧ.Вставить("name",  "Натяжной потолок");
	СтрокаТЧ.Вставить("price",  СуммаДокумента);
	СтрокаТЧ.Вставить("quantity", 1);
	СтрокаТЧ.Вставить("sum", СуммаДокумента);
	
	Если Не ЗначениеЗаполнено(ПараметрыРаботы.СпособРасчета) Тогда
		ПараметрыРаботы.СпособРасчета = "full_payment";
	КонецЕсли;
	СтрокаТЧ.Вставить("payment_method", ПараметрыРаботы.СпособРасчета);
	
	Если Не ЗначениеЗаполнено(ПараметрыРаботы.ПредметРасчета) Тогда
		ПараметрыРаботы.ПредметРасчета = "commodity";
	КонецЕсли;
	СтрокаТЧ.Вставить("payment_object", ПараметрыРаботы.ПредметРасчета);
	
	Налог = Новый Структура;
	
	Налог.Вставить("type",КодНалога);
	
	СтрокаТЧ.Вставить("vat",Налог);
	
	Товары.Добавить(СтрокаТЧ);
	
	Возврат Товары;
	
КонецФункции	

Функция ПоступлениеНаРасчетныйСчетвJSON(ДокументСсылка, ПараметрыРаботы)
	
	
	//Поменять на ставку НДС Организации
	НДС = УчетНДС.СтавкаНДСПоУмолчанию(ДокументСсылка.Организация);
	//НДС = Перечисления.СтавкиНДС.БезНДС;
	
	// варианты из комментария или назначения платежа
	НаименованиеУслуги = "Натяжной потолок";
	
	Если НЕ ПараметрыРаботы.Свойство("GUID_1С") Тогда
		ПараметрыРаботы.Вставить("GUID_1С");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыРаботы.GUID_1С) Тогда
		ПараметрыРаботы.GUID_1С = Строка(ДокументСсылка.УникальныйИдентификатор());
	КонецЕсли;	
	
	//nva
	//Если ДокументСсылка.РасшифровкаПлатежа.Количество()  > 0 Тогда
	//	 Для каждого СтрокаРасшифровки Из ДокументСсылка.РасшифровкаПлатежа Цикл
	//	 	 НДСУслуги = СтрокаРасшифровки.СтавкаНДС;
	//		 Прервать;
	//	 КонецЦикла;
	//КонецЕсли;
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("external_id",  ПараметрыРаботы.GUID_1С);
	
	Чек = Новый Структура;
	
	
	Клиент =  Новый Структура;  
	//сюда надо вписать эл. адрес клиента
	Клиент.Вставить("email",НВД_ОбщийМодульСервер.ПолучитьEmailКонтрагента(ДокументСсылка.Контрагент));
	Если ЗначениеЗаполнено(ПараметрыРаботы.ТелефонКлиентаСБП) Тогда
		ТелефонКонтрагента = ПараметрыРаботы.ТелефонКлиентаСБП;
	Иначе	
		ТелефонКонтрагента = НВД_ОбщийМодульСервер.ПолучитьТелефонКонтрагента(ДокументСсылка.Контрагент);
	КонецЕсли;

    ТелефонКонтрагента = СтрСоединить(СтрРазделить(ТелефонКонтрагента, СтрСоединить(СтрРазделить(ТелефонКонтрагента, "0123456789"), "")), "");
	
	ТелефонКонтрагента = ?(Лев(ТелефонКонтрагента,1) = "8" ИЛИ Лев(ТелефонКонтрагента,1) = "7", Прав(ТелефонКонтрагента, СтрДлина(ТелефонКонтрагента)-1), ТелефонКонтрагента);
	
	Клиент.Вставить("phone", ТелефонКонтрагента); 
	
	Если ЗначениеЗаполнено(ДокументСсылка.Контрагент) Тогда
		
		РеквизитыКонтрагента = НВД_ОбщегоНазначения.ИННКПППоОрганизацииКонтрагенту(ДокументСсылка.Контрагент);
		ИННКонтрагента = РеквизитыКонтрагента.ИНН;
		Если ЗначениеЗаполнено(ИННКонтрагента) Тогда
			Клиент.Вставить("inn",ИННКонтрагента);
		КонецЕсли;
		// варианты из назаначения платежа или комментария
		Клиент.Вставить("name",ДокументСсылка.Контрагент.Наименование);
	КонецЕсли;
	
	Организация =  Новый Структура;
	Организация.Вставить("email",ПараметрыРаботы.ЭлПочтаОрганизации);
	
	РеквизитыОрганизации = НВД_ОбщегоНазначения.ИННКПППоОрганизацииКонтрагенту(ДокументСсылка.Организация);
	
	ИННОрганизации = РеквизитыОрганизации.ИНН;
	Если ПараметрыРаботы.ИмяСервера = "testonline.atol.ru" Тогда
		ИННОрганизации = "5544332219";
	КонецЕсли;
	Если ЗначениеЗаполнено(ИННОрганизации) Тогда
		Организация.Вставить("inn",ИННОрганизации);
	КонецЕсли;
	Если СтрДлина(ИННОрганизации) <> 10 И СтрДлина(ИННОрганизации) <> 12 Тогда
		ПараметрыРаботы.ТекстСообщения =  "Неправильно указа ИНН организации";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ПараметрыРаботы.ТекстСообщения;
		Сообщение.Сообщить(); 
		Возврат Неопределено;
	КонецЕсли;
	Организация.Вставить("payment_address",ПараметрыРаботы.СайтОрганизации);
	
	КодНалога = "vat22";
	
	Если НДС = Перечисления.СтавкиНДС.НДС18 Тогда
		КодНалога = "vat18";
	ИначеЕсли НДС = Перечисления.СтавкиНДС.НДС20 Тогда
		КодНалога = "vat20";
	ИначеЕсли НДС = Перечисления.СтавкиНДС.НДС22 Тогда
		КодНалога = "vat22";	
	ИначеЕсли НДС = Перечисления.СтавкиНДС.БезНДС Тогда
		КодНалога = "none";
	КонецЕсли;
	
	Товары = ПолучитьМассивТоваров(ДокументСсылка, ПараметрыРаботы, КодНалога);
	
	// vats
	Если КодНалога <> "none" Тогда
		
		Налоги = Новый Массив;
		
		СТрокаНалоги = Новый Структура;
		СтрокаНалоги.Вставить("type",КодНалога);
		
		ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(НДС);
		СуммаНДС = Окр(УчетНДС.РассчитатьСуммуНДС(ДокументСсылка.Сумма, Истина, Истина,ЗначениеСтавкиНДС), 2);
		
		СтрокаНалоги.Вставить("sum", СуммаНДС);
		Налоги.Добавить(СтрокаНалоги);
	КонецЕсли;
	
	Оплаты = Новый Массив;
	СтрокаОплаты = Новый Структура;
	Если ПараметрыРаботы.ВидОплаты = 0 Тогда
		ПараметрыРаботы.ВидОплаты = 1; 
	КонецЕсли;
	СтрокаОплаты.Вставить("type",ПараметрыРаботы.ВидОплаты);
	СтрокаОплаты.Вставить("sum",ДокументСсылка.Сумма);
	Оплаты.Добавить(СтрокаОплаты);
	
	Чек.Вставить("client",Клиент);			
	Чек.Вставить("company",Организация);			
	Чек.Вставить("items",Товары);			
	Чек.Вставить("payments",Оплаты);			
	Если КодНалога <> "none" Тогда
		Чек.Вставить("vats",Налоги);			
	КонецЕсли;
	Чек.Вставить("total",ДокументСсылка.Сумма);			
	
	ТелоЗапроса.Вставить("receipt",Чек);			
	ТелоЗапроса.Вставить("timestamp",Формат(ДокументСсылка.Дата,"ДЛФ=DT"));			
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, ТелоЗапроса);
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	Возврат ТекстJSON;
	
КонецФункции

Функция СписаниеСРасчетногоСчетВJSON(ДокументСсылка,ПараметрыРаботы)
	
	НДСУслуги = Перечисления.СтавкиНДС.БезНДС;
	// варианты из комментария или назначения платежа
	НаименованиеУслуги = "Возврат";
	
	Если ДокументСсылка.РасшифровкаПлатежа.Количество()  > 0 Тогда
		Для каждого СтрокаРасшифровки Из ДокументСсылка.РасшифровкаПлатежа Цикл
			НДСУслуги = СтрокаРасшифровки.СтавкаНДС;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("external_id",  ПараметрыРаботы.GUID_1С);
	
	Чек = Новый Структура;
	
	Клиент =  Новый Структура;
	Клиент.Вставить("email",НВД_ОбщийМодульСервер.ПолучитьEmailКонтрагента(ДокументСсылка.Контрагент));
	ТелефонКонтрагента = НВД_ОбщийМодульСервер.ПолучитьТелефонКонтрагента(ДокументСсылка.Контрагент);

    ТелефонКонтрагента = СтрСоединить(СтрРазделить(ТелефонКонтрагента, СтрСоединить(СтрРазделить(ТелефонКонтрагента, "0123456789"), "")), "");
	
	ТелефонКонтрагента = ?(Лев(ТелефонКонтрагента,1) = 8 ИЛИ Лев(ТелефонКонтрагента,1) = 7, Прав(ТелефонКонтрагента, СтрДлина(ТелефонКонтрагента)-1), ТелефонКонтрагента);
	
	Клиент.Вставить("phone",ТелефонКонтрагента);
	
	Если ЗначениеЗаполнено(ДокументСсылка.Контрагент) Тогда
		
		РеквизитыКонтрагента = НВД_ОбщегоНазначения.ИННКПППоОрганизацииКонтрагенту(ДокументСсылка.Контрагент);
		ИННКонтрагента = РеквизитыКонтрагента.ИНН;
		Если ЗначениеЗаполнено(ИННКонтрагента) Тогда
			Клиент.Вставить("inn",ИННКонтрагента);
		КонецЕсли;
		// варианты из назаначения платежа или комментария
		Клиент.Вставить("name",ДокументСсылка.Контрагент.Наименование);
	КонецЕсли;
	
	Организация =  Новый Структура;
	Организация.Вставить("email",ПараметрыРаботы.ЭлПочтаОрганизации);
	
	РеквизитыОрганизации = НВД_ОбщегоНазначения.ИННКПППоОрганизацииКонтрагенту(ДокументСсылка.Организация);
	
	ИННОрганизации = РеквизитыОрганизации.ИНН;
	Если ПараметрыРаботы.ИмяСервера = "testonline.atol.ru" Тогда
		ИННОрганизации = "5544332219";
	КонецЕсли;
	Если ЗначениеЗаполнено(ИННОрганизации) Тогда
		Организация.Вставить("inn",ИННОрганизации);
	КонецЕсли;
	Если СтрДлина(ИННОрганизации) <> 10 И СтрДлина(ИННОрганизации) <> 12 Тогда
		ПараметрыРаботы.ТекстСообщения =  "Неправильно указа ИНН организации";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ПараметрыРаботы.ТекстСообщения;
		Сообщение.Сообщить(); 
		Возврат Неопределено;
	КонецЕсли;
	Организация.Вставить("payment_address",ПараметрыРаботы.СайтОрганизации);
	
	
	Товары = Новый Массив;
	
	СтрокаТЧ = Новый Структура;
	
	СтрокаТЧ.Вставить("name",  НаименованиеУслуги);
	СтрокаТЧ.Вставить("price",  ДокументСсылка.Сумма);
	СтрокаТЧ.Вставить("quantity", 1);
	СтрокаТЧ.Вставить("sum", ДокументСсылка.Сумма);
	
	Если Не ЗначениеЗаполнено(ПараметрыРаботы.СпособРасчета) Тогда
		ПараметрыРаботы.СпособРасчета = "full_payment";
	КонецЕсли;
	СтрокаТЧ.Вставить("payment_method", ПараметрыРаботы.СпособРасчета);
	
	Если Не ЗначениеЗаполнено(ПараметрыРаботы.ПредметРасчета) Тогда
		ПараметрыРаботы.ПредметРасчета = "service";
	КонецЕсли;
	СтрокаТЧ.Вставить("payment_object", ПараметрыРаботы.ПредметРасчета);
	
	Налог = Новый Структура;
	КодНалога = "none";
	
	Если НДСУслуги = Перечисления.СтавкиНДС.НДС18 Тогда
		КодНалога = "vat18";
	ИначеЕсли НДСУслуги = Перечисления.СтавкиНДС.НДС20 Тогда
		КодНалога = "vat20";
	ИначеЕсли НДСУслуги = Перечисления.СтавкиНДС.НДС22 Тогда
		КодНалога = "vat22";	
	ИначеЕсли НДСУслуги = Перечисления.СтавкиНДС.БезНДС Тогда
		КодНалога = "none";
	Иначе 
		КодНалога = "none";
	КонецЕсли;
	
	Налог.Вставить("type",КодНалога);
	
	СтрокаТЧ.Вставить("vat",Налог);
	
	Товары.Добавить(СтрокаТЧ);
	
	// vats
	Если КодНалога <> "none" Тогда
		
		Налоги = Новый Массив;
		
		СТрокаНалоги = Новый Структура;
		СтрокаНалоги.Вставить("type",КодНалога);
		
		ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(НДСУслуги);
		СуммаНДС = Окр(УчетНДС.РассчитатьСуммуНДС(ДокументСсылка.Сумма, Истина, ЗначениеСтавкиНДС), 2);
		
		СтрокаНалоги.Вставить("sum", СуммаНДС);
		Налоги.Добавить(СтрокаНалоги);
	КонецЕсли;
	
	Оплаты = Новый Массив;
	СтрокаОплаты = Новый Структура;
	Если ПараметрыРаботы.ВидОплаты = 0 Тогда
		ПараметрыРаботы.ВидОплаты = 1; 
	КонецЕсли;
	СтрокаОплаты.Вставить("type",ПараметрыРаботы.ВидОплаты);
	СтрокаОплаты.Вставить("sum",ДокументСсылка.Сумма);
	Оплаты.Добавить(СтрокаОплаты);
	
	Чек.Вставить("client",Клиент);			
	Чек.Вставить("company",Организация);			
	Чек.Вставить("items",Товары);			
	Чек.Вставить("payments",Оплаты);			
	Если КодНалога <> "none" Тогда
		Чек.Вставить("vats",Налоги);			
	КонецЕсли;
	Чек.Вставить("total",ДокументСсылка.Сумма);			
	
	ТелоЗапроса.Вставить("receipt",Чек);			
	ТелоЗапроса.Вставить("timestamp",Формат(ДокументСсылка.Дата,"ДЛФ=DT"));			
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, ТелоЗапроса);
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	Возврат ТекстJSON;
	
КонецФункции

Процедура ПроверитьЧек(ДокСсылка, ТекстСообщения, НадоСоздавать = Ложь, ТипОперации = "", uuid_Атол = "" ) Экспорт
	
	Если Не ЗначениеЗаполнено(uuid_Атол) Тогда
		Если ТипОперации = "" или ТипОперации = "Приход" Тогда
			uuid_Атол = ДокСсылка.UUID_АТОЛ;
			url_Атол = ДокСсылка.СсылкаНаЧек;
		ИначеЕсли ТипОперации = "Возврат прихода" Тогда
			uuid_Атол = ДокСсылка.UUID_АТОЛ;
			url_Атол = ДокСсылка.СсылкаНаЧек;
			UUID_1С_Возврат = ДокСсылка.UUID_1С_Возврат;
		ИначеЕсли ТипОперации = "Коррекция прихода" Тогда
			uuid_Атол = ДокСсылка.UUID_АТОЛ_Корректирующий;
			url_Атол = ДокСсылка.СсылкаНаЧек_Корректирующий;
			UUID_1С_Корректирующий = ДокСсылка.UUID_1С_Корректирующий;
		КонецЕсли;
	КонецЕсли;
	
	Если uuid_Атол = Неопределено или ПустаяСтрока(uuid_Атол) Тогда
		НадоСоздавать = Истина;
		Возврат;
	КонецЕсли;
		
   	ПараметрыРаботы = ПолучитьПараметрыПодключенияКОнЛайнКассе();
	ПараметрыРаботы.Вставить("ТипОперации",ТипОперации);
	ПараметрыРаботы.Вставить("UUID_1С_Возврат",UUID_1С_Возврат);
	ПараметрыРаботы.Вставить("UUID_1С_Корректирующий",UUID_1С_Корректирующий);
	
	ПолучитьGUIDСсылки(ПараметрыРаботы,ДокСсылка);
	
	ПараметрыРаботы.МетодЗапроса = "GET";

	ПараметрыРаботы.ТекстЗапроса = "possystem/v4/" + ПараметрыРаботы.КодГруппы + "/report/" + uuid_Атол +"?token=" + ПараметрыРаботы.Токен;
	ПараметрыРаботы.Операция = "report";
	ПараметрыРаботы.uuid_Атол = uuid_Атол;
	
	ОтветПолучен = Ложь;
	ОтветПолучен = ПолучитьОтветССайта(ПараметрыРаботы);
	
	Если ОтветПолучен = Ложь или Не ЗначениеЗаполнено(ПараметрыРаботы.ОтветСервера) Тогда
		ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Ответ не получен.'"));
		ТекстСообщения = ТекстСообщения + Символы.ПС + ПараметрыРаботы.ТекстСообщения;
		НадоСоздавать = Истина;
		Возврат;
	КонецЕсли;
	
	JSON = Новый ЧтениеJSON();
	JSON.УстановитьСтроку(ПараметрыРаботы.ОтветСервера);
	Результат = ПрочитатьJSON(JSON);
	
	uuidПолучен = Ложь;
	НомерЧека = 0;
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("uuid") Тогда
			Если Не ПустаяСтрока(Результат.uuid) и uuid_Атол <> Результат.uuid Тогда		
				Попытка
					ВписатьВДокументЗначение(ДокСсылка, "uuid_Атол", Результат.uuid);
				Исключение
					ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Не удалось записать документ.'")
					+ Символы.ПС + ДокСсылка + Символы.ПС 
					+ ПараметрыРаботы.ОтветСервера);
				КонецПопытки;	
			КонецЕсли;
		Иначе
			НадоСоздавать = Истина;
		КонецЕсли;
		Если Результат.Свойство("error") Тогда
			Если Результат.error <> Неопределено Тогда
				ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Ответ не получен.'")
				+ Символы.ПС 
				+ ПараметрыРаботы.ОтветСервера);
				ТекстСообщения = ТекстСообщения + Символы.ПС + ПараметрыРаботы.ОтветСервера;
				// уже есть
				Если Результат.error.code = 33 Тогда
					НадоСоздавать = Ложь;
				ИначеЕсли Результат.error.code = 1 Тогда //был превышен таймаут чек не пробился
					НадоСоздавать = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Результат.Свойство("payload") Тогда
			Если Результат.payload <> Неопределено Тогда
				Если Результат.payload.Свойство("ofd_receipt_url") Тогда
					ofd_receipt_url = Результат.payload.ofd_receipt_url;
				КонецЕсли;
				Если Результат.payload.Свойство("fiscal_receipt_number") Тогда
					НомерЧека = Результат.payload.fiscal_receipt_number;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Результат.Свойство("status") Тогда
			status = Результат.status;
		КонецЕсли;
		Если НомерЧека <> 0 и status <> "fail" Тогда
			uuidПолучен = Истина;
			//ВписатьНомерЧека(ДокСсылка,НомерЧека);
		КонецЕсли;
		Если uuidПолучен и Не ПустаяСтрока(ofd_receipt_url) и ofd_receipt_url <> url_Атол Тогда
			Попытка
				ВписатьВДокументЗначение(ДокСсылка, "uuid_Атол", Результат.uuid);
				ВписатьВДокументЗначение(ДокСсылка, "СсылкаНаЧек", ofd_receipt_url);
			Исключение
				ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Не удалось записать документ.'")
				+ Символы.ПС + ДокСсылка + Символы.ПС 
				+ ПараметрыРаботы.ОтветСервера);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЧек(ДокСсылка, ТекстСообщения, ТипОперации = "", ТелефонКлиентаСБП = "") Экспорт

	ПараметрыРаботы = ПолучитьПараметрыПодключенияКОнЛайнКассе();
	ПараметрыРаботы.Вставить("ТипОперации",ТипОперации);
	ПараметрыРаботы.Вставить("ТелефонКлиентаСБП",ТелефонКлиентаСБП);
	
	ПолучитьGUIDСсылки(ПараметрыРаботы, ДокСсылка); 
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Попытка	
			JSON = Новый ЧтениеJSON();
			JSON.УстановитьСтроку(ТекстСообщения);
	        Результат = ПрочитатьJSON(JSON);
			Если ТипЗнч(Результат) = Тип("Структура") Тогда
				Если Результат.Свойство("status") И Результат.status = "fail" Тогда //на тот случай когда в системе есть чек но он не фискализирован
	            	//тогда формруем новый uuid 1С
					ПараметрыРаботы.GUID_1С = Строка(Новый УникальныйИдентификатор());
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") и (ТипОперации = "Приход" или ТипОперации = "")  Тогда
		ПараметрыРаботы.ТекстЗапроса = "possystem/v4/"+ПараметрыРаботы.КодГруппы+"/sell?token=" + ПараметрыРаботы.Токен;
		ПараметрыРаботы.Операция = "sell";
		ПараметрыРаботы.СпособРасчета = "full_payment";
		ПараметрыРаботы.ПредметРасчета = "commodity";
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") и ТипОперации = "Возврат прихода" Тогда
		ПараметрыРаботы.ТекстЗапроса = "possystem/v4/"+ПараметрыРаботы.КодГруппы+"/sell_refund?token=" + ПараметрыРаботы.Токен;
		ПараметрыРаботы.Операция = "sell_refund";
		ПараметрыРаботы.СпособРасчета = "full_payment";
		ПараметрыРаботы.ПредметРасчета = "commodity";
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") и ТипОперации = "Коррекция прихода" Тогда
		//ПараметрыРаботы.ТекстЗапроса = "possystem/v4/"+КодГруппы+"/sell_correction?token=" + Токен;
		ПараметрыРаботы.ТекстЗапроса = "possystem/v4/"+ПараметрыРаботы.КодГруппы+"/sell?token=" + ПараметрыРаботы.Токен;
		ПараметрыРаботы.Операция = "sell";
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ПараметрыРаботы.ТекстЗапроса = "possystem/v4/"+ПараметрыРаботы.КодГруппы+"/sell_refund?token=" + ПараметрыРаботы.Токен;
		ПараметрыРаботы.Операция = "sell_refund";
	КонецЕсли;
	
	ПараметрыРаботы.МетодЗапроса = "POST";
	
	// по документу сформировать тело
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ПараметрыРаботы.ТелоЗапроса = ПоступлениеНаРасчетныйСчетвJSON(ДокСсылка,ПараметрыРаботы);
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ПараметрыРаботы.ТелоЗапроса = СписаниеСРасчетногоСчетВJSON(ДокСсылка,ПараметрыРаботы);
	КонецЕсли;
	
	Если ПараметрыРаботы.ТелоЗапроса = Неопределено Тогда
		ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Не сформировано тело запроса.'"));
		ТекстСообщения = ТекстСообщения + Символы.ПС + ПараметрыРаботы.ТекстСообщения;
		Возврат;
	КонецЕсли;
	
	ОтветПолучен = Ложь;
	ОтветПолучен = ПолучитьОтветССайта(ПараметрыРаботы);
	Если ОтветПолучен = Ложь или Не ЗначениеЗаполнено(ПараметрыРаботы.ОтветСервера) Тогда
		ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Ответ не получен.'"));
		ТекстСообщения = ТекстСообщения + Символы.ПС + ПараметрыРаботы.ТекстСообщения;
		Возврат;
	КонецЕсли;
	
	JSON = Новый ЧтениеJSON();
	JSON.УстановитьСтроку(ПараметрыРаботы.ОтветСервера);
	
	Результат = ПрочитатьJSON(JSON);
	uuidПолучен = Ложь;
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("error") Тогда
			Если Результат.error <> Неопределено Тогда
				
				// уже существует
				Если Результат.error.code =  33 Тогда
					uuid_АТОЛ = Результат.uuid;
					uuidПолучен = Истина;
					ПроверитьЧек(ДокСсылка,ТекстСообщения, Ложь, ТипОперации, uuid_АТОЛ);
					//Возврат;
				КонецЕсли;
				
				ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Ответ не получен.'")
				+ Символы.ПС 
				+ ПараметрыРаботы.ОтветСервера);
			Иначе
				НомерЧека = 0;
				Если Результат.Свойство("uuid") Тогда
					uuid_Атол = Результат.uuid;
				КонецЕсли;
				Если Результат.Свойство("timestamp") Тогда
					timestamp = Результат.timestamp;
				КонецЕсли;
				Если Результат.Свойство("status") Тогда
					status = Результат.status;
				КонецЕсли;
				Если Результат.Свойство("payload") Тогда
					Если Результат.payload <> Неопределено Тогда
						Если Результат.payload.Свойство("fiscal_receipt_number") Тогда
							НомерЧека = Результат.payload.fiscal_receipt_number;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если СтрДлина(uuid_Атол)  > 20 и status <> "fail" Тогда
					uuidПолучен = Истина;
					Попытка
						ВписатьВДокументЗначение(ДокСсылка, "uuid_Атол", НомерЧека);
					Исключение
						ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Не удалось записать документ.'")
						+ Символы.ПС + ДокСсылка + Символы.ПС 
						+ ПараметрыРаботы.ОтветСервера);
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если uuidПолучен Тогда
		Попытка
			ВписатьВДокументЗначение(ДокСсылка, "uuid_Атол", Результат.uuid);
		Исключение
			ДобавитьОписаниеОшибки(ПараметрыРаботы, НСтр("ru = 'Не удалось записать документ.'")
			+ Символы.ПС + ДокСсылка + Символы.ПС 
			+ ПараметрыРаботы.ОтветСервера);
		КонецПопытки;
	КонецЕсли; 
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + ПараметрыРаботы.ТекстСообщения;
	
КонецПроцедуры

Процедура ВписатьВДокументЗначение(ДокСсылка, ИмяРеквизита, ЗначениеРеквизита)
	
	Если ЗначениеРеквизита = 0 Тогда
		 Возврат;
	КонецЕсли;
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	
	Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита,ДокОбъект.Метаданные()) Тогда
		 Возврат;
	КонецЕсли;
	
	ДокОбъект[ИмяРеквизита] = ЗначениеРеквизита;
	ДокОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

#КонецОбласти

