
&НаКлиенте
&Вместо("ОбработатьШтрихкоды")
Процедура НВД_ОбработатьШтрихкоды(Данные)
	
	ШК = Данные.Штрихкод; // Штрихкод[0].Штрихкод;
	
	Если ПустаяСтрока(ШК) Тогда
		ПоказатьПредупреждение(,"Штрих-код не распознан");
		Возврат;
	КонецЕсли;

	//#14336
	Если Лев(ШК, 12) = "000000000000" Тогда
		Закрыть();
		Возврат;
	ИначеЕсли Лев(ШК, 12) = "000000000001" ИЛИ Лев(ШК, 12) = "000000000003" Тогда
		ВыпускКлиент("Выпуск");
		Возврат; 
	ИначеЕсли Лев(ШК, 12) = "000000000004" Тогда
		ВыпускКлиент("ВыпускИзОстатков");
		Возврат;
	ИначеЕсли Лев(ШК, 12) = "000000000005" Тогда
		ВыпускКлиент("ВыпускИзМатериаловЗаказчика");
		Возврат;
	ИначеЕсли Лев(ШК, 12) = "000000000006" Тогда
		ЗаменитьМатериал(ЭтаФорма.Команды.Найти("ЗаменитьМатериал"));
		Возврат;
	ИначеЕсли Лев(ШК, 12) = "000000000007" Тогда
		ИзменитьКоличество(ЭтаФорма.Команды.Найти("ИзменитьКоличество"));
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры
