
Процедура ИзменитьЦветТекстаЭлементаФормы(Элемент, Цвет) Экспорт
	Если ЗначениеЗаполнено(Цвет) Тогда
		Элемент.ЦветТекста = Цвет;
	КонецЕсли;	
КонецПроцедуры 

Процедура УстановитьОформлениеПоляКонтрагентВСоответствииСМеткой(Элементы, Объект) Экспорт
	
	ПолеКонтрагент = Элементы.Найти("Контрагент");
	Если ПолеКонтрагент <> Неопределено И Объект.Свойство("Контрагент") И ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		Цвет = НВД_ОбщийМодульСервер.ПолучитьЦветМеткиКонтрагента(Объект.Контрагент);
		НВД_ОбщегоНазначенияКлиент.ИзменитьЦветТекстаЭлементаФормы(ПолеКонтрагент, Цвет);
	КонецЕсли;
	
КонецПроцедуры	

#Область ПолучениеРеквизитовСправочниковИДокументов

Функция ПолучитьЦветМеткиКонтрагента(Контрагент) Экспорт
	Возврат НВД_ОбщийМодульСервер.ПолучитьЦветМеткиКонтрагента(Контрагент);
КонецФункции

#КонецОбласти