
&НаСервере
Процедура НВД_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// настройка для розницы
	ДопустимаяГлубинаВложенности = Константы.ДопустимаяГлубинаВложенностиСопутствующихТоваровИУслуг.Получить();
	
	// №14840
	Параметры.Свойство("СФормыПодбора", СФормыПодбора);
	Если СФормыПодбора = Истина Тогда
		// с формы подбора для заказа покупателя
		ДопустимаяГлубинаВложенности = 1;	
	КонецЕсли;
		
	ИсходнаяТаблица.Очистить();
	
	Если Параметры.Свойство("МассивПозиций") Тогда
		
		Для каждого ЭлементМассива из Параметры.МассивПозиций Цикл
			НоваяСтрока = ИсходнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		КонецЦикла;
		
		Если ИсходнаяТаблица.Количество() = 1 Тогда
			Заголовок = "Подбор сопутствующих товаров для номенклатуры: " + ИсходнаяТаблица[0].Номенклатура;
			Если ЗначениеЗаполнено(ИсходнаяТаблица[0].ХарактеристикаНоменклатуры) Тогда
				Заголовок = Заголовок + ", " + ИсходнаяТаблица[0].ХарактеристикаНоменклатуры;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Заголовок = "Подбор сопутствующих товаров для номенклатуры: " + Параметры.Номенклатура;
		Если ЗначениеЗаполнено(Параметры.ХарактеристикаНоменклатуры) Тогда
			Заголовок = Заголовок + ", " + Параметры.ХарактеристикаНоменклатуры;
		КонецЕсли;	
		
		//ИсходнаяНоменклатура = Параметры.Номенклатура;
		//ИсходноеКоличество = Параметры.Количество;	
		//ИсходнаяХарактеристика = Параметры.ХарактеристикаНоменклатуры;
		//ИсходнаяУИСтроки = Параметры.УИСтроки;
		
		НоваяСтрока = ИсходнаяТаблица.Добавить();
		НоваяСтрока.Номенклатура = Параметры.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Параметры.ХарактеристикаНоменклатуры;
		НоваяСтрока.Количество = Параметры.Количество;		
		НоваяСтрока.УИСтроки = Параметры.УИСтроки;

	КонецЕсли;
	
	СтрокиДерева = ДеревоСопутствующейНоменклатуры.ПолучитьЭлементы();
	ТекИндекс = 0;
	
	Для каждого СтрокаТабличнойЧасти из ИсходнаяТаблица Цикл		
		СтруктураПодбора = Новый Структура("УИСтрокиПодбора", СтрокаТабличнойЧасти.УИСтроки);
		ЕстьСопутка = ДобавитьСопутствующуюНоменклатуру(СтрокаТабличнойЧасти, СтруктураПодбора, СтрокиДерева, 1);
		//nva+++
		Если ЕстьСопутка И Параметры.Свойство("ИсключатьПозицииКоторыеЕстьВТабличнойЧасти") И Параметры.ИсключатьПозицииКоторыеЕстьВТабличнойЧасти Тогда
			Для Каждого СтрокаДерева Из СтрокиДерева Цикл
				Если ИсходнаяТаблица.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры",СтрокаДерева.Номенклатура, СтрокаДерева.ХарактеристикаНоменклатуры)).Количество() > 0 Тогда
					СтрокаДерева.Пометка = Ложь;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		//nva---
		Если ЕстьСопутка И ИсходнаяТаблица.Количество() > 1 Тогда
			// строка номенклатуры подбора  
			НоваяСтрока = СтрокиДерева.Вставить(ТекИндекс);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
			НоваяСтрока.ЭтоНоменклатураПодбора = Истина;
			ТекИндекс = СтрокиДерева.Количество();
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиДерева.Количество() = 0 Тогда
		
		// №14840 когда с формы подбора товаров, сообщения не выводим, просто закрываем форму
		Если СФормыПодбора Тогда
			Отказ = Истина;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранной позиции отсутствуют сопутствующие товары", ,,, Отказ);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма, "ВыбраннаяНоменклатураНоменклатураАртикул");
	
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура НВД_ДеревоУстановитьФлажкиПосле(Команда) 
	СтрокиДерева = ДеревоСопутствующейНоменклатуры.ПолучитьЭлементы();
	Для Каждого ТекущаяСтрока Из СтрокиДерева Цикл
		Если ТекущаяСтрока.Уровень = 0 Тогда
			Продолжить;
		КонецЕсли;
		ТекущаяСтрока.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НВД_ДеревоСнятьФлажкиПосле(Команда)
	СтрокиДерева = ДеревоСопутствующейНоменклатуры.ПолучитьЭлементы();
	Для Каждого ТекущаяСтрока Из СтрокиДерева Цикл
		Если ТекущаяСтрока.Уровень = 0 Тогда
			Продолжить;
		КонецЕсли;	
		ТекущаяСтрока.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
