&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьРегистра = РегистрыСведений.СБП_QRКоды.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.qrcId = Запись.qrcId;
	ЗаписьРегистра.Прочитать();
	Если ЗаписьРегистра.Выбран() Тогда //значит такой записи нет
		Данные = ЗаписьРегистра.imageParams_content.Получить();
		ДД = Base64Значение(Данные);
		Картинка = Новый Картинка(ДД, Ложь);
		СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
	КонецЕсли;
    
КонецПроцедуры