Процедура ИА_ОбработкаПроведенияВходящейПлатежкиОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Экспорт
	
	Попытка
		тч = ЭтотОбъект.ИА_ЗаказыНаПриобретение;
	Исключение
		Возврат; // по новой схеме нет ТЧ
	КонецПопытки;
	
	Попытка
		Если не ЭтотОбъект.Оплачено Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ЭтотОбъект.ИА_ЗаказыНаПриобретение.Количество() = 0 И ЭтотОбъект.ИА_Фонды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	СуммаДокумента = 0;
	Попытка 
		СуммаДокумента = ЭтотОбъект.СуммаДокумента;
	Исключение
	КонецПопытки;
	Если СуммаДокумента > 0 И ЭтотОбъект.ИА_ЗаказыНаПриобретение.Итог("Сумма")+ЭтотОбъект.ИА_Фонды.Итог("Сумма")> 0 И ЭтотОбъект.ИА_ЗаказыНаПриобретение.Итог("Сумма")+ЭтотОбъект.ИА_Фонды.Итог("Сумма") <> СуммаДокумента  Тогда
		Сообщить("Сумма по фондам и заявкам должна быть равна сумме документа!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ОрганизацияФП = ИА_ФП.ПолучитьГоловнуюОрганизацию(ЭтотОбъект.Организация);
	
	ЭтоВПС = ТипЗнч(ЭтотОбъект) = тип("ДокументОбъект.КСУ_ВнедоходноеПоступлениеСредств");
	// валюта
	Если ЭтоВПС Тогда
		ПересчитыватьВВалюту = Ложь;
		СтрокаКурсыВалют = Ложь;
	Иначе
		СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
		ВалютаУПР = Константы[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаУПР].Получить();
		ВалютаДокумента = ЭтотОбъект[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаДокумента];	
		Если ВалютаДокумента = ВалютаУПР Тогда
			ПересчитыватьВВалюту = Ложь;
			СтрокаКурсыВалют = Ложь;
		Иначе
			ПересчитыватьВВалюту = Истина;
			СтрокаКурсыВалют = ИА_ФП.ПолучитьКурсКратностьВалют(ЭтотОбъект.Дата,ВалютаУПР, ВалютаДокумента);
		КонецЕсли;
	КонецЕсли;
		
	// движения
	ЭтотОбъект.Движения.ИА_СредстваНаФондах.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_СредстваНаФондах.Очистить();
	
	ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.Очистить();
	
	ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.Очистить();
	
	ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Очистить();
	
	//ЭтотОбъект.Движения.КСУ_ЛентаСобытий.Записывать = Истина;
	//ЭтотОбъект.Движения.КСУ_ЛентаСобытий.Очистить();
	
	
	// ФОНДЫ
	Для каждого стр из ЭтотОбъект.ИА_Фонды Цикл
		Проводка = ЭтотОбъект.Движения.ИА_СредстваНаФондах.ДобавитьПриход();
		Проводка.Период     = ЭтотОбъект.Дата;
		Если ФППоОрганизациям Тогда
			Проводка.Организация = ОрганизацияФП;
		КонецЕсли;
		Проводка.Фонд 	= стр.Фонд;
		Проводка.Подразделение 	= Стр.Подразделение;
		Проводка.СуммаБезНал = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
		
		Проводка.Операция = Перечисления.КСУ_ОперацииПоФондам.ВнедоходноеПоступление;
		Если ЭтоВПС ТОгда			
			Проводка.ПояснениеТекст = строка(ЭтотОбъект.ТипИсточникаСредств) + " " + ЭтотОбъект.ИсточникСредств;
	    КонецЕсли;
	КонецЦикла;
	
	
	// Заказы
	ТЗ_ЗаказыНаПриобретение = ЭтотОбъект.ИА_ЗаказыНаПриобретение.Выгрузить();
	ТЗ_ЗаказыНаПриобретение.Свернуть("ЗП","Сумма");
	
	Для каждого стр из ТЗ_ЗаказыНаПриобретение Цикл
		ЗП = стр.ЗП;
		
		// Проверка на превышение оплаты
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	-СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &ДатаКонца, Регистратор, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОбороты
		|ГДЕ
		|	НЕ(ИА_СредстваВРезервеНаФондахОбороты.Регистратор ССЫЛКА Документ.ИА_ФинансовоеПланирование
		|				ИЛИ ИА_СредстваВРезервеНаФондахОбороты.Регистратор ССЫЛКА Документ.ИА_ЗакрытиеЗаказаНаПриобретение)";
		Запрос.УстановитьПараметр("ЗП", ЗП);
		Запрос.УстановитьПараметр("ДатаКонца", ЭтотОбъект.Дата - 1);
		Выборка = Запрос.Выполнить().Выбрать();
		МаксСумма =0;
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
			МаксСумма = Выборка.Сумма;
		КонецЕсли;
		
		Если Стр.Сумма > МаксСумма Тогда
			Сообщить("По заказу "+ЗП.Номер+" сумма к возврату больше выплаченной (выплачено "+МаксСумма+")!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		//
		
		Фонд = ЗП.Фонд;
		Подразделение = ЗП.Подразделение;
		
		Проводка = ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.ДобавитьРасход();
		Проводка.Период     = ЭтотОбъект.Дата;
		Если ФППоОрганизациям Тогда
			Проводка.Организация = ОрганизацияФП;
		КонецЕсли;
		Проводка.Фонд 	= Фонд;
		Проводка.Подразделение 	= Подразделение;
		Проводка.ЗП = ЗП;
		Проводка.СуммаБезНал = -Стр.Сумма;
		
		
		Проводка = ЭтотОбъект.Движения.ИА_СредстваНаФондах.ДобавитьРасход();
		Проводка.Период     = ЭтотОбъект.Дата;
		Если ФППоОрганизациям Тогда
			Проводка.Организация = ОрганизацияФП;
		КонецЕсли;
		Проводка.Фонд 	= Фонд;       
		Проводка.Подразделение 	= Подразделение;
		Проводка.СуммаБезНал = -Стр.Сумма;
		
		Проводка.Операция = Перечисления.КСУ_ОперацииПоФондам.ВнедоходноеПоступление;
		Если ЭтоВПС ТОгда			
			Проводка.ПояснениеТекст = строка(ЭтотОбъект.ТипИсточникаСредств) + " " + ЭтотОбъект.ИсточникСредств;
			Проводка.ПояснениеСсылка = ЗП;
	    КонецЕсли;
				
		Проводка = ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.ДобавитьПриход();
		Проводка.Период     = ЭтотОбъект.Дата;
		Проводка.Организация = ЗП.Организация;
		Проводка.ЗП 	= ЗП;       
		Проводка.Сумма = -Стр.Сумма;
	КонецЦикла;
	
	ИА_ФП.СформироватьДвиженияПлатежкиПоСтатусам(ЭтотОбъект, ТЗ_ЗаказыНаПриобретение, ложь);
	
КонецПроцедуры

Процедура ИА_ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Экспорт
	
	ЭтотОбъект.Движения.ИА_СредстваНаФондах.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_СредстваНаФондах.Очистить();
	
	ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.Очистить();
	
	ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.Очистить();
	
	ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ИсторияСтатусовЗВС.Очистить();
	
	//ЭтотОбъект.Движения.КСУ_ЛентаСобытий.Записывать = Истина;
	//ЭтотОбъект.Движения.КСУ_ЛентаСобытий.Очистить();
	
	
	ДатаОплаты = ЭтотОбъект.Дата;
	Попытка
		Если не ЭтотОбъект.Оплачено Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОплаты) и НачалоДня(ЭтотОбъект.ДатаОплаты)<>НачалоДня(ЭтотОбъект.Дата) Тогда
			ДатаОплаты = КонецДня(ЭтотОбъект.ДатаОплаты);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если не ЭтотОбъект.ПроведеноБанком Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	СтруктураНастройкиРеквизитов = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов(); 
	
	ФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	ЗапретПустых = Константы.КСУ_ЗапретитьПроведениеПлатежкиБезФондовИЗаказов.Получить();
	ИспПодр = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ОрганизацияФП = ИА_ФП.ПолучитьГоловнуюОрганизацию(ЭтотОбъект.Организация);
	
	Попытка
		ТипРКО = Тип("ДокументОбъект.РасходныйКассовыйОрдер");
	Исключение
		Попытка
			ТипРКО = Тип("ДокументОбъект.РасходИзКассы");
		Исключение
			Сообщ = Новый СообщениеПользователю;
			Сообщ.Текст = "Не определен документ Расхода ФП по Налу";
			Если Константы.ИА_ФП_РазделятьНалИБезнал.Получить() Тогда 
				Сообщ.Сообщить();
			КонецЕсли;
			ТипРКО = Неопределено;
		КонецПопытки;
	КонецПопытки;
	
	//проведение по заказам
	ПроводкаНал = Константы.ИА_ФП_РазделятьНалИБезнал.Получить() и ТипЗнч(ЭтотОбъект) = ТипРКО;	
	СуммаДокумента = 0;
	
	Попытка
		Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.КСУ_ФормальнаяВыплата") Тогда
			СуммаДокумента = ЭтотОбъект.СуммаДокумента;
		иначе 	
			СуммаДокумента = ЭтотОбъект.Сумма;
		КонецЕсли;	
	Исключение
		
	КонецПопытки;
	
	Если ЗапретПустых и ЭтотОбъект.ИА_ЗаказыНаПриобретение.Количество() = 0 И ЭтотОбъект.ИА_Фонды.Количество() = 0 Тогда
		Сообщ = Новый СообщениеПользователю;
		Сообщ.Текст = "Запрещено проводить платежки без фондов и заказов КСУ";
		Сообщ.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ИА_Фонды.Количество() > 0 И НЕ (ИА_ПраваС.ЗначениеПраваТекПользователя("ВыплатаНапрямуюСФондов")
		ИЛИ ИА_ПраваС.ЗначениеПраваТекПользователя("ФП_ПолныеПрава")) Тогда
		Сообщ = Новый СообщениеПользователю;
		Сообщ.Текст = "У вас нет прав на выплату напрямую с фондов!";
		Сообщ.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если СуммаДокумента = 0 ИЛИ (ЭтотОбъект.ИА_ЗаказыНаПриобретение.Количество() = 0 И ЭтотОбъект.ИА_Фонды.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	ФормальнаяВыплата = ТипЗнч(ЭтотОбъект) = тип("ДокументОбъект.КСУ_ФормальнаяВыплата");
	Если ФормальнаяВыплата Тогда
		ПересчитыватьВВалюту = Ложь;
	Иначе
		ВалютаУПР = Константы[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаУПР].Получить();
		ВалютаДокумента = ЭтотОбъект[СтруктураНастройкиРеквизитов.ИмяРеквизитаВалютаДокумента];
		
		Если ВалютаДокумента = ВалютаУПР Тогда
			ПересчитыватьВВалюту = Ложь;
			СтрокаКурсыВалют = Ложь;
		Иначе
			ПересчитыватьВВалюту = Истина;
			СтрокаКурсыВалют = ИА_ФП.ПолучитьКурсКратностьВалют(ЭтотОбъект.дата,ВалютаУПР, ВалютаДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Отказ = ИА_ФП.ДатаВыплатыНеКорректна(ЭтотОбъект.Ссылка);
	
	СуммаДокумента = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(ЭтотОбъект.СуммаДокумента, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), СуммаДокумента);					
	
	ПоФондам = ЭтотОбъект.ИА_Фонды.Количество()>0;	
	Запрос = Новый Запрос;
	
	КонтрольРасходов = Константы.ИА_ФП_КонтрольРасходов.Получить();
	
	ТЗ_Фонды = ЭтотОбъект.ИА_Фонды.Выгрузить();
	ТЗ_Фонды.Свернуть("Фонд,Подразделение","Сумма");
	
	Для каждого стр из ТЗ_Фонды Цикл
		Запрос.Текст = "ВЫБРАТЬ
		|	СредстваНаФондахОстатки.СуммаБезналОстаток - ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК СуммаОстаток,
		|	СредстваНаФондахОстатки.Фонд,
		|	СредстваНаФондахОстатки.Подразделение
		|ИЗ
		|	РегистрНакопления.ИА_СредстваНаФондах.Остатки(
		|			&НаДату,
		|			Фонд = &Фонд
		|				И (Организация = &Организация или &НеРазделять)
		|				И Подразделение = &Подразделение) КАК СредстваНаФондахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(
		|				&НаДату,
		|				Фонд = &Фонд
		|					И (Организация = &Организация или &НеРазделять)
		|					И Подразделение = &Подразделение) КАК ИА_СредстваВРезервеНаФондахОстатки
		|		ПО (ИСТИНА)";
		Запрос.УстановитьПараметр("НаДату", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("Организация", ОрганизацияФП);
		Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
		Запрос.УстановитьПараметр("Фонд", стр.Фонд);
		Запрос.УстановитьПараметр("Подразделение", стр.Подразделение);
		
		Если ПроводкаНал Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СуммаБезнал", "СуммаНал");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		//ДенегОсталось = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
		ИтогоПогасилиВал = 0;
		ИтогоПогасили = 0;
		ДенегОсталосьПогаситьВал = стр.Сумма;
		
		Пока Выборка.Следующий() И ДенегОсталосьПогаситьВал > 0 Цикл
			
			//Сальдо = Выборка.СуммаОстаток;
			
			СальдоВал = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(Выборка.СуммаОстаток, ВалютаУПР, ВалютаДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КратностьУпрУчета, СтрокаКурсыВалют.КратностьДокумента), Выборка.СуммаОстаток);
			ГасимВал = Мин(СальдоВал, ДенегОсталосьПогаситьВал);
			
			Фонд = Выборка.Фонд;
			
			Проводка = ЭтотОбъект.Движения.ИА_СредстваНаФондах.ДобавитьРасход();
			Проводка.Период     = ДатаОплаты;
			Если ФППоОрганизациям Тогда
				Проводка.Организация = ОрганизацияФП;
			КонецЕсли;
			Проводка.Фонд 	= Фонд;
			Проводка.Подразделение 	= Выборка.Подразделение;
			
			Гасим = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(ГасимВал, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), ГасимВал);
			Проводка.СуммаБезНал = мин(Гасим, Выборка.СуммаОстаток);
			Проводка.СуммаВал = ГасимВал;
			
			Проводка.операция = Перечисления.КСУ_ОперацииПоФондам.ПрямаяВыплатаИзФонда;
			Если ФормальнаяВыплата ТОгда			
				Проводка.ПояснениеТекст = ЭтотОбъект.Комментарий;				
	    	КонецЕсли;
			
			ИтогоПогасилиВал = ИтогоПогасилиВал + ГасимВал;
			ИтогоПогасили = ИтогоПогасили + Проводка.СуммаБезНал;
			ДенегОсталосьПогаситьВал = ДенегОсталосьПогаситьВал - ГасимВал;
			
		КонецЦикла;
		
		Если ИтогоПогасилиВал < стр.Сумма Тогда
			//Сообщить("На фонде недостаточно средств. Затребовано "+ ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма) + ", возможно списать "+ ИтогоПогасили);
			Потр = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
			Сообщить("Недостаточно средств на фонде "+ стр.Фонд +". Сумма выплаты " + формат(Потр,"ЧДЦ=2; ЧН=") + ", остаток на фонде "  + формат(ИтогоПогасили,"ЧДЦ=2; ЧН=") + ", превышение " + формат(Потр-ИтогоПогасили,"ЧДЦ=2; ЧН=") + ".");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ТЗ_ЗаказыНаПриобретение = ЭтотОбъект.ИА_ЗаказыНаПриобретение.Выгрузить();
	ТЗ_ЗаказыНаПриобретение.Свернуть("ЗП","Сумма");
	
	// Статусы и лента
	ИА_ФП.СформироватьДвиженияПлатежкиПоСтатусам(ЭтотОбъект, ТЗ_ЗаказыНаПриобретение, Истина);
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("НаДату", КонецДня(ЭтотОбъект.Дата));//Списываем платежки на дату ФП, даже если ФП позже по времени
	
	//заказы по фнодам, резервам
	ПроблемыФондов = новый ТаблицаЗначений;
	ПроблемыФондов.Колонки.Добавить("Фонд");
	ПроблемыФондов.Колонки.Добавить("Остаток");
	ПроблемыФондов.Колонки.Добавить("Потребность");
	
	Для каждого стр из ТЗ_ЗаказыНаПриобретение Цикл
		ЗП = стр.ЗП;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИА_СредстваВРезервеНаФондахОбороты.Фонд КАК Фонд,
		|	ИА_СредстваВРезервеНаФондахОбороты.Подразделение КАК Подразделение,
		|	ИА_СредстваВРезервеНаФондахОбороты.Организация КАК Организация,
		|	СУММА(ИА_СредстваВРезервеНаФондахОбороты.СуммаБезналОборот) КАК ОстатокПоЗаказу,
		|	МАКСИМУМ(ЕСТЬNULL(СредстваНаФондахОстатки.СуммаБезналОстаток,0)) КАК ОстатокФонда
		|ИЗ
		|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &НаДату, Регистратор, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваНаФондах.Остатки(
		|				&НаДату1,
		|				Организация = &Организация
		|					ИЛИ &НеРазделять) КАК СредстваНаФондахОстатки
		|		ПО (ИА_СредстваВРезервеНаФондахОбороты.Подразделение = СредстваНаФондахОстатки.Подразделение или не &ИспПодр)
		|			И ИА_СредстваВРезервеНаФондахОбороты.Фонд = СредстваНаФондахОстатки.Фонд
		|ГДЕ
		|	ИА_СредстваВРезервеНаФондахОбороты.Регистратор <> &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ИА_СредстваВРезервеНаФондахОбороты.Фонд,
		|	ИА_СредстваВРезервеНаФондахОбороты.Подразделение,
		|	ИА_СредстваВРезервеНаФондахОбороты.Организация";
		
		
		Запрос.УстановитьПараметр("ЗП", ЗП);
		Запрос.УстановитьПараметр("НаДату1", ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("ИспПодр", ИспПодр);
		Запрос.УстановитьПараметр("Организация", ОрганизацияФП);
		Запрос.УстановитьПараметр("НеРазделять", не ФППоОрганизациям);
		
		Если ПроводкаНал Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СуммаБезнал", "СуммаНал");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		//ДенегОсталось = ?(ПересчитыватьВВалюту,  ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
		ИтогоПогасили = 0;
		ИтогоПогасилиВал = 0; 
		ОстатокФонда = 0;
		ДенегОсталосьПогаситьВал = стр.Сумма;
		
		Пока Выборка.Следующий() И ДенегОсталосьПогаситьВал > 0 Цикл
			ОстатокФонда = Выборка.ОстатокФонда;
			//Сальдо = Выборка.ОстатокПоЗаказу;
			//Гасим = Мин(Сальдо, ДенегОсталось);
			
			СальдоВал = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(Выборка.ОстатокПоЗаказу, ВалютаУПР, ВалютаДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КратностьУпрУчета, СтрокаКурсыВалют.КратностьДокумента), Выборка.ОстатокПоЗаказу);
			ГасимВал = Мин(СальдоВал, ДенегОсталосьПогаситьВал);
			
			Гасим = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(ГасимВал, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), ГасимВал);
			Гасим = мин(Гасим, Выборка.ОстатокПоЗаказу);
			
			Фонд = Выборка.Фонд;
			Подразделение = Выборка.Подразделение;
			
			
			Проводка = ЭтотОбъект.Движения.ИА_СредстваВРезервеНаФондах.ДобавитьРасход();
			Проводка.Период     = ДатаОплаты;
			Если ФППоОрганизациям Тогда
				Проводка.Организация = ОрганизацияФП;
			КонецЕсли;
			Проводка.Фонд 	= Фонд;
			Проводка.Подразделение 	= Подразделение;
			Проводка.ЗП = ЗП;
			Если ПроводкаНал Тогда
				Проводка.СуммаНал = Гасим;
			Иначе
				Проводка.СуммаБезНал = Гасим;
			КонецЕсли;
			
			
			Проводка = ЭтотОбъект.Движения.ИА_СредстваНаФондах.ДобавитьРасход();
			Проводка.Период     = ДатаОплаты;
			Если ФППоОрганизациям Тогда
				Проводка.Организация = ОрганизацияФП;
			КонецЕсли;
			Проводка.Фонд 	= Фонд;       
			Проводка.Подразделение 	= Подразделение;
			
			Проводка.СуммаБезНал = Гасим;
			Проводка.СуммаВал = ГасимВал;
			
			Проводка.операция = Перечисления.КСУ_ОперацииПоФондам.ВыплатаПоЗаказу;
			Если ФормальнаяВыплата ТОгда			
				Проводка.ПояснениеТекст = ЭтотОбъект.Комментарий;				
				Проводка.ПояснениеСсылка = ЗП; 
	    	КонецЕсли;
			
			ИтогоПогасилиВал = ИтогоПогасилиВал + ГасимВал;
			ИтогоПогасили = ИтогоПогасили + Проводка.СуммаБезНал;
			ДенегОсталосьПогаситьВал = ДенегОсталосьПогаситьВал - ГасимВал;
		КонецЦикла;
		
		Потр = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
		Если ИтогоПогасилиВал < стр.Сумма Тогда			
			Сообщить("Недостаточно одобренных средств на заказе №"+ЗП.Номер+". Сумма выплаты " + формат(Потр,"ЧДЦ=2; ЧН=") + ", остаток одобренных средств "  + формат(ИтогоПогасили,"ЧДЦ=2; ЧН=") + ", превышение " + формат(Потр-ИтогоПогасили,"ЧДЦ=2; ЧН=") + ".");		
			Отказ = Истина;
		КонецЕсли;
		
		Если ОстатокФонда < ИтогоПогасили И КонтрольРасходов Тогда
			Сообщить("Недостаточно средств на фонде "+ ЗП.фонд +" заказ №"+ЗП.Номер+".");
			Отказ = Истина;
			
			нстр = ПроблемыФондов.Найти(ЗП.фонд);
			Если нстр = Неопределено тогда
				нстр = ПроблемыФондов.Добавить();
				нстр.Фонд = ЗП.фонд;
				нстр.Остаток = ОстатокФонда;
				нстр.Потребность = 0;
			КонецЕсли;
			нстр.Потребность = нстр.Потребность + Потр;
		КонецЕсли;
		
		
		Проводка = ЭтотОбъект.Движения.ИА_ЗаказыНаПриобретение.ДобавитьРасход();
		Проводка.Период     = ДатаОплаты;
		Проводка.Организация = ЗП.Организация;
		Проводка.ЗП 	= ЗП;       
		Проводка.Сумма = ИтогоПогасили;
		
	КонецЦикла;
	
	Если ПроблемыФондов.Количество() >0 Тогда
		Сообщить("При проведении выплаты по заказам обнаружены следующие ошибки:");
	КонецЕсли;
	Для каждого стрПр из ПроблемыФондов цикл
		Сообщить("Недостаточно средств на фонде "+ стрПр.Фонд +". Требуется на выплаты " + формат(стрПр.Потребность,"ЧДЦ=2; ЧН=") + ", остаток на фонде "  + формат(стрПр.Остаток,"ЧДЦ=2; ЧН=") + ", превышение " + формат(стрПр.Потребность-стрПр.Остаток,"ЧДЦ=2; ЧН=") + ".");
	КонецЦикла;
	
	// проведение по спецдоходу
	ЭтотОбъект.Движения.ИА_ДоходыБудущихПериодов.Записывать = Истина;
	ЭтотОбъект.Движения.ИА_ДоходыБудущихПериодов.Очистить();
	фСпецдохода = Константы.ИА_ФП_ФондДоходовБП.Получить();
	Для каждого стр из ЭтотОбъект.ИА_Фонды Цикл
		Если стр.Фонд = фСпецдохода Тогда
			Если не (ЗначениеЗаполнено(стр.Источник) И ЗначениеЗаполнено(стр.ВидДохода)) Тогда
				Сообщить("При списании спецдохода необходимо указать вид дохода и источник!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Движение = ЭтотОбъект.Движения.ИА_ДоходыБудущихПериодов.ДобавитьРасход();
			Движение.Период = ДатаОплаты;
			Если ФППоОрганизациям Тогда
				Движение.Организация = ОрганизацияФП;
			КонецЕсли;
			Движение.Источник = стр.Источник;
			Движение.ОперацияСсылка = Перечисления.КСУ_ОперацииПоФондам.ПрямаяВыплатаИзФонда;
			Движение.Операция = "Возврат покупателю";
			Движение.ВидДохода = стр.ВидДохода;
			Движение.Подразделение = стр.ПодразделениеДохода;
			Если ПроводкаНал тогда
				Движение.Сумманал = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);
			Иначе
				Движение.СуммаБезнал = ?(ПересчитыватьВВалюту,  ИА_ФП.ПересчитатьИзВалютыВВалюту1(стр.Сумма, ВалютаДокумента, ВалютаУПР, СтрокаКурсыВалют.КурсДокумента, СтрокаКурсыВалют.КурсУпрУчета, СтрокаКурсыВалют.КратностьДокумента, СтрокаКурсыВалют.КратностьУпрУчета), стр.Сумма);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

