
//&После("ОбработкаПроведения")
//Процедура НВД_ОбработкаПроведения(Отказ, РежимПроведения)
//	Если Не Отказ Тогда
//		Если ТекущийСтатус = Справочники.СтатусыРезервирований.ПустаяСсылка() Тогда
//			ТекущийСтатус  = Справочники.СтатусыРезервирований.ВРаботе; 
//		КонецЕсли;
//	КонецЕсли;	
//КонецПроцедуры

//&После("ОбработкаУдаленияПроведения")
//Процедура НВД_ОбработкаУдаленияПроведения(Отказ)
//	Если Не Отказ Тогда
//		Если ТекущийСтатус <> Справочники.СтатусыРезервирований.ПустаяСсылка() Тогда
//			ТекущийСтатус  = Справочники.СтатусыРезервирований.ПустаяСсылка(); 
//		КонецЕсли; 
//		Проведен = Ложь;
//	КонецЕсли;
//КонецПроцедуры

&Перед("ПередЗаписью")
Процедура НВД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (РежимЗаписи = РежимЗаписиДокумента.Запись И ПометкаУдаления) 
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ТекущийСтатус <> Справочники.СтатусыРезервирований.ПустаяСсылка() Тогда
			ТекущийСтатус  = Справочники.СтатусыРезервирований.ПустаяСсылка(); 
		КонецЕсли;	
	Иначе
		Если ТекущийСтатус = Справочники.СтатусыРезервирований.ПустаяСсылка() Тогда
			ТекущийСтатус  = Справочники.СтатусыРезервирований.ВРаботе; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
