
&НаСервере
Процедура НВД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДокументЗаявкаНаДоставку.Ссылка КАК Ссылка,
	               |	ДокументЗаявкаНаДоставку.ПометкаУдаления КАК ПометкаУдаления,
	               |	ДокументЗаявкаНаДоставку.Номер КАК Номер,
	               |	ДокументЗаявкаНаДоставку.Дата КАК Дата,
	               |	ДокументЗаявкаНаДоставку.Город КАК Город,
	               |	ДокументЗаявкаНаДоставку.Проведен КАК Проведен,
	               |	ДокументЗаявкаНаДоставку.авто_Водитель КАК авто_Водитель,
	               |	ДокументЗаявкаНаДоставку.авто_ГосНомер КАК авто_ГосНомер,
	               |	ДокументЗаявкаНаДоставку.авто_Марка КАК авто_Марка,
	               |	ДокументЗаявкаНаДоставку.авто_Модель КАК авто_Модель,
	               |	ДокументЗаявкаНаДоставку.авто_ТелефонВодителя КАК авто_ТелефонВодителя,
	               |	ДокументЗаявкаНаДоставку.АдресДоставки КАК АдресДоставки,
	               |	ДокументЗаявкаНаДоставку.Валюта КАК Валюта,
	               |	ДокументЗаявкаНаДоставку.ВодительЗаберетГрузСамостоятельно КАК ВодительЗаберетГрузСамостоятельно,
	               |	ДокументЗаявкаНаДоставку.ДоставленоДата КАК ДоставленоДата,
	               |	ДокументЗаявкаНаДоставку.ДоставленоОтветственный КАК ДоставленоОтветственный,
	               |	ДокументЗаявкаНаДоставку.Комментарий КАК Комментарий,
	               |	ДокументЗаявкаНаДоставку.НомерОтправления КАК НомерОтправления,
	               |	ДокументЗаявкаНаДоставку.ОжидаемаяДатаДоставки КАК ОжидаемаяДатаДоставки,
	               |	ДокументЗаявкаНаДоставку.ОжидаемаяДатаОтправки КАК ОжидаемаяДатаОтправки,
	               |	ДокументЗаявкаНаДоставку.ОплачиваетПолучатель КАК ОплачиваетПолучатель,
	               |	ДокументЗаявкаНаДоставку.Организация КАК Организация,
	               |	ДокументЗаявкаНаДоставку.Автор КАК Автор,
	               |	ДокументЗаявкаНаДоставку.ОтветственныйЗаДоставку КАК ОтветственныйЗаДоставку,
	               |	ДокументЗаявкаНаДоставку.ОтправленEMail КАК ОтправленEMail,
	               |	ДокументЗаявкаНаДоставку.ОтправленоДата КАК ОтправленоДата,
	               |	ДокументЗаявкаНаДоставку.ОтправленоОтветственный КАК ОтправленоОтветственный,
	               |	ДокументЗаявкаНаДоставку.Получатель КАК Получатель,
	               |	ДокументЗаявкаНаДоставку.СпособДоставки КАК СпособДоставки,
	               |	ДокументЗаявкаНаДоставку.СтоимостьДоставки КАК СтоимостьДоставки,
	               |	ДокументЗаявкаНаДоставку.Результат КАК ТекущийСтатус,
	               |	ДокументЗаявкаНаДоставку.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	ДокументЗаявкаНаДоставку.Экспедитор КАК Экспедитор,
	               |	ДокументЗаявкаНаДоставку.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		СерияНоменклатуры КАК СерияНоменклатуры,
	               |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		Количество КАК Количество,
	               |		Основание КАК Основание
	               |	) КАК Товары,
	               |	ДокументЗаявкаНаДоставку.МоментВремени КАК МоментВремени,
	               |	НАЧАЛОПЕРИОДА(ДокументЗаявкаНаДоставку.ОжидаемаяДатаДоставки, ДЕНЬ) КАК ОжидаемаяДатаДоставкиБезВремени,
	               |	НАЧАЛОПЕРИОДА(ДокументЗаявкаНаДоставку.ДоставленоДата, ДЕНЬ) КАК ДатаДоставкиБезВремени,
	               |	НАЧАЛОПЕРИОДА(ДокументЗаявкаНаДоставку.ОжидаемаяДатаОтправки, ДЕНЬ) КАК ОжидаемаяДатаОтправкиБезВремени,
	               |	НАЧАЛОПЕРИОДА(ДокументЗаявкаНаДоставку.ОтправленоДата, ДЕНЬ) КАК ДатаОтправкиБезВремени,
	               |	ДокументЗаявкаНаДоставку.ТранспортноеСредство.Водитель КАК Водитель,
	               |	ОснованияЗаявкиНаДоставку.ОснованиеСкладОтгрузки КАК СкладОтгрузки,
	               |	ОснованияЗаявкиНаДоставку.Заказ КАК Заказ
	               |ИЗ
	               |	Документ.ЗаявкаНаДоставку КАК ДокументЗаявкаНаДоставку
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаявкаНаДоставкуОснования.Основание.Склад КАК ОснованиеСкладОтгрузки,
	               |			ЗаявкаНаДоставкуОснования.Ссылка КАК Ссылка,
	               |			ЗаявкаНаДоставкуОснования.Основание.Ссылка КАК Заказ
	               |		ИЗ
	               |			Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставкуОснования) КАК ОснованияЗаявкиНаДоставку
	               |		ПО ДокументЗаявкаНаДоставку.Ссылка = ОснованияЗаявкиНаДоставку.Ссылка";
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	СвойстваСписка.ОсновнаяТаблица = Список.ОсновнаяТаблица;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка); 
	
	Элемент = Элементы.Вставить("СписокВодитель", Тип("ПолеФормы"), Элементы.Список, Элементы.СписокЭкспедитор);
	Элемент.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент.ПутьКДанным = "Список.Водитель";
	Элемент.Заголовок = "Водитель";
	
	Элемент = Элементы.Вставить("СписокСкладОтгрузки", Тип("ПолеФормы"), Элементы.Список, Элементы.СписокАдресДоставки);
	Элемент.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент.ПутьКДанным = "Список.СкладОтгрузки";
	Элемент.Заголовок = "Склад отгрузки"; 
	
	//Элемент = Элементы.Вставить("СписокЗаказ", Тип("ПолеФормы"), Элементы.Список, Элементы.Ссылка);
	//Элемент.Вид = ВидПоляФормы.ПолеНадписи;
	//Элемент.ПутьКДанным = "Список.Заказ";
	//Элемент.Заголовок = "Заказ";
КонецПроцедуры
