
&НаКлиенте
Процедура НВД_ПриОткрытииПосле(Отказ)
	КСУ_ПриОткрытии();
КонецПроцедуры

#Область КСУ

&НаКлиенте
Процедура КСУ_ВнедоходноеПоступлениеНажатие(Элемент)
		
	сВДПС = ИА_ФПСервер.ПолучитьСсылкуНаВДПС(Объект.Ссылка);
	если сВДПС <> Неопределено тогда
		ПоказатьЗначение(,сВДПС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеВопросаВДПС(рез, дп) Экспорт
	Если рез = КодВозвратаДиалога.Да ТОгда
		Парам = новый Структура("Основание", новый Структура("Ссылка, ЭтоПлатежка", Объект.Ссылка, Истина));
		ОпОп = новый ОписаниеОповещения("ЗакрытиеФормыВДПС", ЭтотОбъект);
		ОткрытьФорму("Документ.КСУ_ВнедоходноеПоступлениеСредств.ФормаОбъекта",Парам,,,,, ОпОп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте                           
Процедура ЗакрытиеФормыВДПС(рез, дп) Экспорт
	ЗагВДПС = ИА_ФПСервер.ПолучитьТекстСсылкиНаВДПС(Объект.Ссылка);
	Если ЗагВДПС <> "" Тогда
		Элементы.КСУ_ВнедоходноеПоступление.Заголовок = ЗагВДПС;
		Элементы.КСУ_ВнедоходноеПоступление.Видимость = Истина;
		Элементы.КСУ_ВДПС.Видимость = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КСУ_ВДПС(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Сначала запишите документ");
		Возврат;
	КонецЕсли;
	
	ОпВопрос = новый ОписаниеОповещения("ЗакрытиеВопросаВДПС", ЭтотОбъект);
	ПоказатьВопрос(ОпВопрос, "Документ ""Внедоходное поступление средств"" используется в КСУ ""Инсайт"" в модуле ""Финансовое планирование"" для обязательной регистрации всех поступлений денежных средств из любых источников, кроме денег, полученных от продажи товаров и услуг, предоставляемых вашей организацией. Кредиты, займы, проценты с займов, возвраты от поставщиков и т.п. Создать документ?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура КСУ_ПриОткрытии()
	// КСУ
	ЗагВДПС = ИА_ФПСервер.ПолучитьТекстСсылкиНаВДПС(Объект.Ссылка);
	Если ЗагВДПС = "" Тогда
		Элементы.КСУ_ВнедоходноеПоступление.Видимость = ложь;
	Иначе
		Элементы.КСУ_ВнедоходноеПоступление.Заголовок = ЗагВДПС;
		Элементы.КСУ_ВДПС.Видимость = ложь;
	КонецЕсли;
	// /КСУ
КонецПроцедуры

#КонецОбласти

