
&НаСервереБезКонтекста
Функция СформироватьМассивОрганизацийССБП()
	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Организации.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Организации КАК Организации
        |ГДЕ
        |	Организации.НВД_СчетДляСБП <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции 

&НаКлиенте
Процедура НВД_ОрганизацияСБПНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    ДанныеВыбора = Новый СписокЗначений;
    ДанныеВыбора.ЗагрузитьЗначения(СформироватьМассивОрганизацийССБП());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОрганизациюИСчетДляСБП()	
	Если НЕ ЗначениеЗаполнено(Объект.НВД_ОрганизацияСБП) Тогда
		МассивОрагизацийССБП = СформироватьМассивОрганизацийССБП();
		Если МассивОрагизацийССБП.Количество() > 0 Тогда
			Объект.НВД_ОрганизацияСБП = МассивОрагизацийССБП[0];
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НВД_СчетСБП) И ЗначениеЗаполнено(Объект.НВД_ОрганизацияСБП) Тогда 
		Объект.НВД_СчетСБП	= Объект.НВД_ОрганизацияСБП.НВД_СчетДляСБП;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьСБП()
	Если Объект.НВД_ИспользоватьСБП Тогда
		Элементы.ГруппаСБП.Видимость = Истина;
	Иначе
		Элементы.ГруппаСБП.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НВД_ИспользоватьСБППриИзмененииПосле(Элемент)
	ВидимостьСБП();
	ЗаполнитьОрганизациюИСчетДляСБП();
КонецПроцедуры

&НаСервере
Процедура НВД_СгенерироватьQRКодПослеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

Функция ПараметрыДляСБПЗаполнены() 
	
	Если ЗначениеЗаполнено(Объект.НВД_ОрганизацияСБП) И ЗначениеЗаполнено(Объект.НВД_СчетСБП) И 
		Объект.НВД_ИспользоватьСБП И ЗначениеЗаполнено(Объект.НВД_СчетСБП.НВД_legalId) И 
		ЗначениеЗаполнено(Объект.НВД_СчетСБП.НВД_merchantId) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции  

&НаКлиенте
Функция ПолучитьПараметрыПодключенияСБП() 
	
	Результат = Новый Структура;
	Результат.Вставить("ЗащитаСоединения"	, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	Результат.Вставить("АдресСервиса"		, "testapi.sbp.gazprombank.ru");
	Результат.Вставить("ПортСервиса"		, 9443);
	
	Возврат Результат; 
	
КонецФункции // ПолучитьЗащищенноеСоединениеБСП()

&НаСервереБезКонтекста
Функция НазначениеПлатежаНаСервере(Контрагент)

	Возврат "Оплата по договору. Плательщик: " + Контрагент + ", УИН: " + Строка(Контрагент.УникальныйИдентификатор());	

КонецФункции // НазначениеПлатежаНаСервере()

&НаСервере
Функция ПолучитьСтруктуруПараметровСчетаДляСПБ(БанковскийСчет)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("legalId", БанковскийСчет.НВД_legalId);
	СтруктураПараметров.Вставить("merchantId", БанковскийСчет.НВД_merchantId);
	СтруктураПараметров.Вставить("account", БанковскийСчет.НомерСчета);
	
	Возврат СтруктураПараметров;
	
КонецФункции	

&НаКлиенте
Функция ПолучитьJSONРегистрацииInvoiceМетки() Экспорт   
	
	Результат = Новый Структура("Результат, ПричинаОтказа, СтрокаQRМетки", Ложь, "", "");
	
	ПараметрыЗаписи_JSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	Запись_JSON = Новый ЗаписьJSON;
	Запись_JSON.УстановитьСтроку(ПараметрыЗаписи_JSON);
	
	СтруктураПараметровСчетаДляСПБ = ПолучитьСтруктуруПараметровСчетаДляСПБ(Объект.НВД_СчетСБП);
	
	СтруктураКода = Новый Структура();
	СтруктураКода.Вставить("legalId"						, СтруктураПараметровСчетаДляСПБ.legalId);
	СтруктураКода.Вставить("account"						, СтруктураПараметровСчетаДляСПБ.account);
	СтруктураКода.Вставить("merchantId"						, СтруктураПараметровСчетаДляСПБ.merchantId);
	СтруктураКода.Вставить("templateVersion"				, "01");
	СтруктураКода.Вставить("qrcType"						, "01");
	//СтруктураКода.Вставить("amount"							, "1500");
	//СтруктураКода.Вставить("currency"						, "RUB");
	СтруктураКода.Вставить("paymentPurpose"					, НазначениеПлатежаНаСервере(Объект.Ссылка));
	//СтруктураКода.Вставить("paymentDetails"					, СтруктураДеталиПолупки);
	СтруктураКода.Вставить("callbackMerchantNotifications"	, "http://1c.optceiling.ru/workbase/hs/gpb");         //     свой url  
	СтруктураКода.Вставить("mediaType"						, "image/png");
	СтруктураКода.Вставить("width"						    , "300");
	СтруктураКода.Вставить("height"						    , "300");
	
	ЗаписатьJSON(Запись_JSON, СтруктураКода);
	
	//Запись_JSON.ЗаписатьКонецОбъекта();
	Строка_JSON	= Запись_JSON.Закрыть();
	
	Результат.Результат		= Истина;
	Результат.ПричинаОтказа	= "";
	Результат.СтрокаQRМетки	= Строка_JSON;
	
	Возврат Результат; 
	
КонецФункции // ПолучитьJSONФормированияQRКода()

&НаКлиенте
Функция РегистрацияInvoiceМетки()  
	
	Результат = Новый Структура("Результат, ПричинаОтказа, СтрокаQRМетки, QRCLD, mediaType, content", Ложь, "", "", "", "", "");
	
	ИмячЭтапа = "Регистрация Invoice Метки";
	
	//сформриуем JSON строку запроса
	СтруктураInvoiceМетки = ПолучитьJSONРегистрацииInvoiceМетки();
	
	Если СтруктураInvoiceМетки.Результат Тогда
		СтрокаТелаЗапроса = СтруктураInvoiceМетки.СтрокаQRМетки;
		
		Заголовки = Новый Соответствие;
		//Заголовки.Вставить("Host","195.225.38.125");
		Заголовки.Вставить("Content-Type", "application/json");
		//Заголовки.Вставить("Content-Type", "text/plain");
		//--data-raw '
		
		ПараметрыСоединения = ПолучитьПараметрыПодключенияСБП();
		
		HTTP_Запрос = Новый HTTPЗапрос("/merchant/v1/qrc-data", Заголовки);
		HTTP_Запрос.УстановитьТелоИзСтроки(СтрокаТелаЗапроса);  
		
		НТТР_Соединение = Новый HTTPСоединение(ПараметрыСоединения.АдресСервиса //сервер
		, ПараметрыСоединения.ПортСервиса //порт
		, "LA0000047585"//пользователь
		, "Km27b8fkeTuuBo"//пароль
		, //прокси
		, //таймаут
		, ПараметрыСоединения.ЗащитаСоединения //параметры защиты соединения... корое где SSL сертификат барть
		, //испольовать аутентификацию ОС
		);
		//-- 
		
		Попытка
			HTTP_Ответ = НТТР_Соединение.ОтправитьДляОбработки(HTTP_Запрос); //это POST запрос  
		Исключение
		    Сообщить(ОписаниеОшибки());
			Возврат Результат;  
		КонецПопытки; 
		
		ТекстОтветаHTTP = HTTP_Ответ.ПолучитьТелоКакСтроку(); 
		
		//Сообщить(ТекстОтветаHTTP);
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстОтветаHTTP);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		
		Для Каждого Стр из ДанныеJSON Цикл 
			Если Стр.Ключ = "data" Тогда 
				Для Каждого СтрДата Из Стр.Значение Цикл 
					Если СтрДата.Ключ = "payload" Тогда 
						СсылкаQR = СтрДата.Значение;	
					КонецЕсли;
					Если СтрДата.Ключ = "qrcId" Тогда 
						QRCLD = СтрДата.Значение;	
					КонецЕсли;
					Если СтрДата.Ключ = "image" Тогда
						Для Каждого СтрImg Из СтрДата.Значение Цикл
							Если СтрImg.Ключ = "mediaType" Тогда 
								mediaType = СтрImg.Значение;	
							КонецЕсли;
							Если СтрImg.Ключ = "content" Тогда 
								content = СтрImg.Значение;	
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Результат.Результат		= Истина;
		Результат.ПричинаОтказа	= "";
		Результат.СтрокаQRМетки	= СсылкаQR; 
		Результат.QRCLD	= QRCLD;
		Результат.mediaType	= mediaType; 
		Результат.content	= content;
	Иначе
		Результат = СтруктураInvoiceМетки; //полностью копируем результаты регистрации метки
	КонецЕсли;  
	
	Возврат Результат;  
	
КонецФункции // РегистрацияInvoiceМетки()

&НаСервере
Процедура ПоместитьВОбъектНаСервере(content)
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	СправочникОбъект.НВД_imageParams_content = Новый ХранилищеЗначения(content, Новый СжатиеДанных());
	СправочникОбъект.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура НВД_СгенерироватьQRКодПосле(Команда)
	Если ПараметрыДляСБПЗаполнены() Тогда
		СтруктураQRВзноса = РегистрацияInvoiceМетки(); 
		
		Если СтруктураQRВзноса.Результат Тогда
			СтрокаQRКода = СтруктураQRВзноса.СтрокаQRМетки;
			QRCLD         = СтруктураQRВзноса.QRCLD;
			content       = СтруктураQRВзноса.content;
			Объект.НВД_СтрокаQRМетки = СтрокаQRКода;
			Объект.НВД_qrcld = QRCLD;
			Записать();
			
			ДД = Base64Значение(content);
			Картинка = Новый Картинка(ДД, Ложь);
			СсылкаНаИзображениеQR = ПоместитьВоВременноеХранилище(Картинка, Новый УникальныйИдентификатор);
			ПоместитьВОбъектНаСервере(content);
			
			ЭтаФорма.ОбновитьОтображениеДанных();
		Иначе 
			Сообщить("Не удалось сгенерировать QR!");
		КонецЕсли;		
	Иначе 
		ПоказатьПредупреждение(, "Проверьте, заполнены ли все параметры");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НВД_ПриОткрытииПосле(Отказ)
	Элементы.ГруппаСБП.Видимость = Объект.НВД_ИспользоватьСБП;		
КонецПроцедуры

&НаСервере
Функция ПолучитьСчетДляСБППоОрганизации(Организация)
	Возврат Организация.НВД_СчетДляСБП;
КонецФункции

&НаКлиенте
Процедура НВД_НВД_ОрганизацияСБППриИзмененииПосле(Элемент)
	Объект.НВД_СчетСБП = ПолучитьСчетДляСБППоОрганизации(Объект.НВД_ОрганизацияСБП);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьМассивСчетовДляСБП(Организация)
	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	БанковскиеСчета.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.БанковскиеСчета КАК БанковскиеСчета
        |ГДЕ
        |	БанковскиеСчета.Владелец = &Организация
        |	И БанковскиеСчета.НВД_legalId <> """"
        |	И БанковскиеСчета.НВД_merchantId <> """"";
	
	Запрос.УстановитьПараметр("Организация", Организация);
    РезультатЗапроса = Запрос.Выполнить();
    
    Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

&НаКлиенте
Процедура НВД_СчетСБПНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    ДанныеВыбора = Новый СписокЗначений;
    ДанныеВыбора.ЗагрузитьЗначения(СформироватьМассивСчетовДляСБП(Объект.НВД_ОрганизацияСБП));
КонецПроцедуры

&НаСервере
Процедура НВД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Данные = РеквизитФормыВЗначение("Объект").НВД_imageParams_content.Получить();
	Если ЗначениеЗаполнено(Данные) Тогда
		ДД = Base64Значение(Данные);
		Картинка = Новый Картинка(ДД, Ложь);
		СсылкаНаИзображениеQR = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
	КонецЕсли;
	
	ЦветТекстаНекорректногоКонтрагента = Новый Цвет(225, 40, 40);
	ЦветГиперссылки = Новый Цвет(28, 85, 174);
	
	УстановитьНастройкиКонтроляДублей();
	
	ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц();
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиКонтроляДублей()
	
	Элементы.ДублиНаименование.Видимость                 = Ложь;
	Элементы.ДублиНаименованиеПолное.Видимость           = Ложь;
	Элементы.ПредставлениеПроверкиДублей.Видимость       = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НВД_НаименованиеПриИзмененииПосле(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Объект.Наименование)) Тогда
		Элементы.ДублиНаименование.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	НаименованиеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.Наименование);
	ПроверитьНаДубли("Наименование");
КонецПроцедуры 

&НаСервере
Процедура ПроверитьНаДубли(Реквизит)
	
	Если Реквизит = "НаименованиеПолное" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
			Возврат;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ОрганизационноПравоваяФорма.НаименованиеБезОПФ) Тогда
			Возврат;
		КонецЕсли;
		НаименованиеПолноеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.НаименованиеПолное);
	КонецЕсли;

	Если Реквизит = "Наименование" Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			Возврат;
		КонецЕсли;
		НаименованиеДляПоискаДублей = НаименованиеДляПоискаДублей(Объект.Наименование);
	КонецЕсли;
	
	ЗапросКонтрагенты = Новый Запрос;
	ЗапросКонтрагенты.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.Ссылка = &Ссылка
	|	И (Контрагенты.Наименование ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.НаименованиеПолное ПОДОБНО &Наименование)";
	
	
	ЗапросКонтрагенты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
	ЗапросКонтрагенты.УстановитьПараметр("Ссылка", Объект.Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	Результат = ЗапросКонтрагенты.Выполнить();
			
	Если Результат.Пустой() Тогда
		
		ЗапросКонтакты = Новый Запрос;
		ЗапросКонтакты.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контакты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК Контакты
		|ГДЕ
		|	Контакты.Наименование ПОДОБНО &Наименование
		|	И НЕ Контакты.Ссылка В (&Контакты)";
		
		ЗапросКонтакты.УстановитьПараметр("Контакты", ДанныеКонтактныхЛиц.Выгрузить(,"КонтактноеЛицо").ВыгрузитьКолонку("КонтактноеЛицо"));
		ЗапросКонтакты.УстановитьПараметр("Наименование", ЭтотОбъект[Реквизит + "ДляПоискаДублей"]);
		Результат = ЗапросКонтакты.Выполнить();
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Элементы["Дубли"+Реквизит].Видимость = НЕ Результат.Пустой();

КонецПроцедуры

&НаКлиенте
Процедура НВД_ДублиНаименованиеНажатиеПосле(Элемент)
	ПараметрыДублей = Новый Структура;
	МассивКонтактов = Новый Массив;
	
	Для Каждого Контакт Из ЭтотОбъект.ДанныеКонтактныхЛиц Цикл
		МассивКонтактов.Добавить(Контакт.КонтактноеЛицо);
	КонецЦикла;
	
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("Наименование", НаименованиеДляПоискаДублей);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуКонтактнойИнформацииКонтактныхЛиц()
	
	ДанныеКонтактныхЛиц.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактныеЛица.Наименование КАК Наименование,
	|	КонтактныеЛица.Ссылка КАК КонтактноеЛицо,
	|	КонтактныеЛица.Должность КАК Должность
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.ОбъектВладелец = &Владелец";

	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	ВыборкаКонтакты = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаКонтакты.Следующий() Цикл
				
		ДанныеКЛ = ДанныеКонтактныхЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(ДанныеКЛ, ВыборкаКонтакты, "КонтактноеЛицо,Наименование,Должность");
		ДанныеКЛ.Ссылка = ДанныеКЛ.КонтактноеЛицо;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НаименованиеДляПоискаДублей(Наименование)
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Наименование))Тогда
		Возврат "";
	КонецЕсли;
	
	ПоисковоеВыражение = ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование);
	
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "-", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, " ", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, "(", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, ")", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, ".", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, """", "%");
	ПоисковоеВыражение = СтрЗаменить(ПоисковоеВыражение, """", "%");
	
	Возврат СокрЛП("%"+ПоисковоеВыражение+"%");
	
КонецФункции

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСпискаДублей(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено И РезультатЗакрытия.Свойство("ВыбранДубльКонтрагента") Тогда
		
		ОбработатьВыборДублей(РезультатЗакрытия.ВыбранныйКонтрагент);
		Элементы.ДублиНаименование.Видимость = Ложь;
		Элементы.ДублиНаименованиеПолное.Видимость = Ложь;
		КонтрагентЗамененНаДубль = Истина;
		Возврат;
		
	КонецЕсли;
	
	СформироватьПредставлениеПроверкиДублей(ЭтотОбъект);
	//РаботаСКонтрагентамиУНФКлиентСервер.СформироватьПредставлениеПроверкиДанных(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборДублей(ВыбранныйКонтрагент)
	
	ЗакрыватьПриВыборе = Ложь;
	ЗначениеВРеквизитФормы(ВыбранныйКонтрагент.ПолучитьОбъект(), "Объект");
	УдалитьЭлементыДублейКИ();
	ДублиКИ.Очистить();
	Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыДублейКИ()
	
	Для Каждого Дубль Из ДублиКИ Цикл
		Если Элементы.Найти("СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)) <> Неопределено Тогда
			Элементы.Удалить(Элементы["СообщениеОДублях_"+ Строка(Дубль.ИндексДекорации)]);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Контакт Из ДанныеКонтактныхЛиц Цикл
		
		ИндексКЛ = ДанныеКонтактныхЛиц.Индекс(Контакт);
		
		Если Элементы.Найти("СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ)) <> Неопределено Тогда
			Элементы.Удалить(Элементы["СообщениеОДубляхКЛ_"+ Строка(ИндексКЛ)]);
		КонецЕсли;
		
	КонецЦикла;
	
	ДублиКИ.Очистить();
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеПроверкиДублей(Форма)
	
	Объект = Форма.Объект;
	ОписаниеОшибки = "";
	
	Если ИННиКППКорректны(Форма) И Не ПустаяСтрока(Объект.ИНН) Тогда
		
		
		МассивДублей = ПолучитьДублиКонтрагентаСервер(СокрЛП(Объект.ИНН), СокрЛП(Объект.КПП), Объект.Ссылка);
		
		КоличествоДублей = МассивДублей.Количество();
		
		Если КоличествоДублей > 0 Тогда
			
			СтруктураПараметровСообщенияОДублях = Новый Структура;
			СтруктураПараметровСообщенияОДублях.Вставить("ИННиКПП", ?(ЭтоЮрЛицо(Объект.ВидКонтрагента), НСтр("ru = 'ИНН и КПП'"), НСтр("ru = 'ИНН'")));
			
			Если КоличествоДублей = 1 Тогда
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", НСтр("ru = 'один'"));
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагент'"));
			ИначеЕсли КоличествоДублей < 5 Тогда
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", КоличествоДублей);
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагента'"));
			Иначе
				СтруктураПараметровСообщенияОДублях.Вставить("КоличествоДублей", КоличествоДублей);
				СтруктураПараметровСообщенияОДублях.Вставить("СклонениеКонтрагентов", НСтр("ru = 'контрагентов'"));
			КонецЕсли;
			
			ОписаниеОшибки = НСтр("ru = 'С таким [ИННиКПП] есть [КоличествоДублей] [СклонениеКонтрагентов]'");
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ОписаниеОшибки, СтруктураПараметровСообщенияОДублях);
			
		КонецЕсли;
	КонецЕсли;
	
	Форма.ПредставлениеПроверкиДублей = Новый ФорматированнаяСтрока(ОписаниеОшибки, , Форма.ЦветТекстаНекорректногоКонтрагента, , "ПоказатьДубли");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДублиКонтрагентаСервер(ИНН, КПП, ИсключаяСсылку)
	
	Возврат Справочники.Контрагенты.ПроверитьДублиСправочникаКонтрагентыПоИННКПП(ИНН, КПП, ИсключаяСсылку);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИННиКППКорректны(Форма)
	
	Объект = Форма.Объект;
	ЭтоЮрЛицо = ЭтоЮрЛицо(Объект.ВидКонтрагента);
	
	Если ЭтоЮрЛицо Тогда
		Результат = НЕ ПустаяСтрока(Объект.ИНН);
	Иначе
		Результат = ИСТИНА;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоЮрЛицо(ВидКонтрагента)
	
	Возврат ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидКонтрагента.ЮрЛицо");
	
КонецФункции


&НаКлиенте
Процедура НВД_ДублиНаименованиеПолноеНажатиеПосле(Элемент)
	ПараметрыДублей = Новый Структура;
	МассивКонтактов = Новый Массив;
	
	Для Каждого Контакт Из ЭтотОбъект.ДанныеКонтактныхЛиц Цикл
		МассивКонтактов.Добавить(Контакт.КонтактноеЛицо);
	КонецЦикла;
	
	ПараметрыДублей.Вставить("ИсключаяКонтакты", МассивКонтактов);
	ПараметрыДублей.Вставить("Наименование", НаименованиеДляПоискаДублей);
	ПараметрыДублей.Вставить("СсылкаНаРедактируемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораДублей", ПараметрыДублей, ЭтотОбъект,,,,ОписаниеОповещения);	
КонецПроцедуры

