
&НаКлиенте
Процедура ЗаполнитьПериод(Команда)
	Перем Родитель;
	
	Если ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока) Тогда
		ПолучитьФорму("Справочник.НВД_Периоды.Форма.ФормаЗаполненияПериодов", Новый Структура("ПериодРодитель", Элементы.Список.ТекущаяСтрока)).Открыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РеструктурироватьПериоды(Команда)
	Вн_РеструктурироватьПериоды();
КонецПроцедуры

&НаСервере
Процедура Вн_РеструктурироватьПериоды()
	
	Справочники.НВД_Периоды.РеструктурироватьПериоды();
	
КонецПроцедуры

