
&НаКлиенте
&ИзменениеИКонтроль("ОбработатьШтрихкод")
Процедура НВД_ОбработатьШтрихкод(Параметр)

	СтруктураТовара = ОбщийМодульКлиент.ПолучитьНоменклатуруПоШтрихКоду(МенеджерОборудованияКлиентПереопределяемый.ПреобразоватьДанныеСоСканераВМассив(Параметр));
	
	Если НЕ СтруктураТовара.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
		
		//Попробуем найти в ТЧ
		//СтруктураПоиска = новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", СтруктураТовара.Номенклатура, СтруктураТовара.ХарактеристикаНоменклатуры, СтруктураТовара.ЕдиницаИзмерения);
		СтруктураПоиска = новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения", СтруктураТовара.Номенклатура, СтруктураТовара.ХарактеристикаНоменклатуры, СтруктураТовара.СерияНоменклатуры, СтруктураТовара.ЕдиницаИзмерения);		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураТовара);
			//НоваяСтрока.Количество = 1;
			//Если ТипЗнч(НоваяСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
			//	НоваяСтрока.Коэффициент = 1;
			//Иначе
			//	НоваяСтрока.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
			//КонецЕсли;
			//НоваяСтрока.Цена = ПолучитьЦенуНоменклатуры(НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры, НоваяСтрока.ЕдиницаИзмерения);
			СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(НоваяСтрока);
			СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанные, "Коэффициент, Цена, Количество"); //#2792 добавлено Количество
						
			НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;			
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			НоваяСтрока.Количество = НоваяСтрока.Количество + 1;
		КонецЕсли;	
		
		//НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, УчитыватьНДС, , УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));		
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуРучнойСкидкиВСтрокеТЧ(НоваяСтрока);
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, ИспользуютсяАвтоматическиеСкидки, Истина, Истина);
		ПересчитатьЦенуИСуммуНоменклатурыВСтрокеПоВалюте(НоваяСтрока.НомерСтроки);		
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
		
		РассчитатьИтоговыеПоказателиКлиент();
		//ОбновитьДанныеДокумента();
		Если ИспользоватьБонусы Тогда
			ПересчитатьБонусыПоДокументу();
		КонецЕсли;
		ЗаполнитьОстаткиПоТоварам();        
		
		Модифицированность = Истина;
	#Удаление
	Иначе
		Сообщить("Не удалось найти номенклатуру со штрих-кодом " + СтруктураТовара.ШтрихКод);
	#КонецУдаления
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НВД_ВнешнееСобытиеПосле(Источник, Событие, Данные)
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура НВД_КонтрагентПриИзмененииПосле(Элемент)
	НВД_ОбщегоНазначенияКлиент.УстановитьОформлениеПоляКонтрагентВСоответствииСМеткой(Элементы, Объект);
КонецПроцедуры

&НаКлиенте
Процедура НВД_ПриОткрытииПосле(Отказ)
	НВД_ОбщегоНазначенияКлиент.УстановитьОформлениеПоляКонтрагентВСоответствииСМеткой(Элементы, Объект);
КонецПроцедуры


