
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контакты = Новый Массив;
	
	Параметры.Свойство("ИНН", ИНН);
	Параметры.Свойство("КПП", КПП);
	Параметры.Свойство("Наименование", Наименование);
	Параметры.Свойство("НаименованиеПолное", НаименованиеПолное);
	Параметры.Свойство("ИсключаяКонтакты", Контакты);
	Параметры.Свойство("ТипКИ", ТипКИ);
	Параметры.Свойство("СсылкаНаРедактируемыйОбъект", СсылкаНаРедактируемыйОбъект);
	Параметры.Свойство("ПредставлениеКИ", ПредставлениеКИ);
	
	Если Параметры.Свойство("ЭтоЮрЛицо") Тогда
		ЭтоЮрЛицо = Параметры.ЭтоЮрЛицо;
	КонецЕсли;
	
	Для Каждого Контакт Из Контакты Цикл
		НовыйКонтакт = ИсключаяКонтакты.Добавить();
		НовыйКонтакт.Контакт = Контакт;
	КонецЦикла;
	
	ОбновитьТаблицуДублей();
	УправлениеФормой();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПроизведенаЗаменаСсылок" Тогда
		ОбновитьТаблицуДублей();
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_Контрагент" Тогда
		ОбновитьТаблицуДублей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаДублейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.ТаблицаДублей.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПередачи = Новый Структура("Ключ", Элементы.ТаблицаДублей.ТекущиеДанные.Ссылка);
	ПараметрыПередачи.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму(ИмяФормыПоТипуСсылки(Элементы.ТаблицаДублей.ТекущиеДанные.Тип),
		ПараметрыПередачи, 
		Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТаблицуДублей()
	
	//Если ЗначениеЗаполнено(ИНН) Тогда
	//	ОбновитьСписокДублейПоИНН();
	//	Возврат;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		ОбновитьСписокДублейПоНаименованию();
		Возврат;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
	//	ОбновитьСписокДублейПоПолномуНаименованию();
	//	Возврат;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ТипКИ) Тогда
	//	ОбновитьСписокДублейПоКИ();
	//	Возврат;
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДублейПоНаименованию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Код КАК Код,
	|	Контрагенты.Наименование КАК Наименование,
	|	""Контрагент"" КАК Тип,
	|	1 КАК РеквизитДопУпорядочивания,
	|	ВЫБОР
	|		КОГДА Контрагенты.ПометкаУдаления
	|			ТОГДА 4
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК СостояниеЭлементов,
	|	"""" КАК ОтветственныйНаименование,
	|	КИ.НомерТелефона КАК Телефон
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ГДЕ
	|			КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)) КАК КИ
	|		ПО Контрагенты.Ссылка = КИ.Ссылка
	|ГДЕ
	|	(Контрагенты.НаименованиеПолное ПОДОБНО &Наименование
	|			ИЛИ Контрагенты.Наименование ПОДОБНО &Наименование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 20
	|	Контакты.Ссылка,
	|	Контакты.Код,
	|	Контакты.Наименование,
	|	""Контакт"",
	|	2,
	|	ВЫБОР
	|		КОГДА Контакты.ПометкаУдаления
	|			ТОГДА 4
	|		ИНАЧЕ 3
	|	КОНЕЦ,
	|	"""",
	|	КИ.НомерТелефона
	|ИЗ
	|	Справочник.КонтактныеЛица КАК Контакты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	|			КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ГДЕ
	|			КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица)) КАК КИ
	|		ПО Контакты.Ссылка = КИ.Ссылка
	|ГДЕ
	|	НЕ Контакты.Ссылка В (&Контакты)
	|	И Контакты.Наименование ПОДОБНО &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания,
	|	Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Контакты = ДанныеФормыВЗначение(ИсключаяКонтакты, Тип("ТаблицаЗначений")).ВыгрузитьКолонку("Контакт");
	Запрос.УстановитьПараметр("Контакты", Контакты);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаДублей.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	Если Элементы.ТаблицаДублей.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПередачи = Новый Структура("Ключ", Элементы.ТаблицаДублей.ТекущиеДанные.Ссылка);
	ПараметрыПередачи.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму(ИмяФормыПоТипуСсылки(Элементы.ТаблицаДублей.ТекущиеДанные.Тип),
		ПараметрыПередачи,
		Элементы.ТаблицаДублей);

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ТаблицаДублейИНН.Видимость = ЗначениеЗаполнено(ИНН);	
	Элементы.ТаблицаДублейКПП.Видимость = ЗначениеЗаполнено(ИНН) И ЭтоЮрЛицо;
	Элементы.ТаблицаДублейНаименованиеПолное.Видимость = ЗначениеЗаполнено(НаименованиеПолное);
	Элементы.ТаблицаДублейПредставлениеКИ.Видимость    = ЗначениеЗаполнено(ТипКИ);
	Элементы.ТаблицаДублейПредставлениеКИ.Заголовок = 
		?(ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон, НСтр("ru = 'телефон'"), НСтр("ru = 'e-mail'"));
	
	Заголовок = ЗаголовокФормы();

	Контрагенты = ТаблицаДублей.НайтиСтроки(Новый Структура("Тип", "Контрагент"));
	Контакты    = ТаблицаДублей.НайтиСтроки(Новый Структура("Тип", "Контакт"));
	Лиды        = ТаблицаДублей.НайтиСтроки(Новый Структура("Тип", "Лид"));
			
КонецПроцедуры

&НаСервере
Функция ЗаголовокФормы()
	
	Заголовок = НСтр("ru = 'Список дублей по '");
	
	Если ЗначениеЗаполнено(ПредставлениеКИ) Тогда
		КИ = ?(ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон, НСтр("ru='номеру телефона'"), НСтр("ru='e-mail'"));
		Возврат Заголовок + КИ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
		Заголовок = Заголовок + НСтр("ru='юр.названию'");
		Возврат Заголовок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Заголовок = Заголовок + НСтр("ru='представлению'");
		Возврат Заголовок;
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(КПП),
					Заголовок + НСтр("ru = 'ИНН и КПП'"),
					Заголовок + НСтр("ru = 'ИНН'"));
	
КонецФункции

&НаКлиенте
Процедура ПерейтиККонтрагенту(Команда)
	
	ТекущийКонтрагент    = Элементы.ТаблицаДублей.ТекущиеДанные.Ссылка;
	//ЕстьПравоПоРЛС = ЕстьПравоПоРЛС(ТекущийКонтрагент);

	Если ЗначениеЗаполнено(СсылкаНаРедактируемыйОбъект) Тогда
		ПараметрыКонтрагента = Новый Структура("Ключ", ТекущийКонтрагент);
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрыКонтрагента);
		Возврат;
	КонецЕсли;
	
	//Если НЕ ЕстьПравоПоРЛС Тогда
	//	ТекстПредупреждения = НСтр("ru = 'Нет прав на чтение объекта'");
	//	ПоказатьПредупреждение(,ТекстПредупреждения);
	//	Возврат;
	//КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВопросПерейтиКОбъекту",ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Продолжить работу с выбранным контрагентом без сохранения текущего?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);

КонецПроцедуры

//&НаСервере
//Функция ЕстьПравоПоРЛС(Ссылка)
//	Возврат УправлениеДоступом.ЧтениеРазрешено(Ссылка);
//КонецФункции

&НаКлиенте
Процедура ОбработатьВопросПерейтиКОбъекту(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ВыбранДубльКонтрагента", Истина);
	ПараметрыЗакрытия.Вставить("ВыбранныйКонтрагент",     Элементы.ТаблицаДублей.ТекущиеДанные.Ссылка);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры 

&НаКлиенте
Функция ИмяФормыПоТипуСсылки(Тип)
	
	Если Тип = "Контрагент" Тогда
		Возврат "Справочник.Контрагенты.ФормаОбъекта";
	КонецЕсли;
	
	Если Тип = "Контакт" Тогда
		Возврат "Справочник.КонтактныеЛица.ФормаОбъекта";
	КонецЕсли;
		
КонецФункции

#КонецОбласти
