#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Валюта = Константы.ВалютаУчета.Получить();
	Отчет.Дата = ТекущаяДатаСеанса();
	
	ТЗ_ПорядокВидовЦен = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
								"ОтчетПрайсЛист",
								"ПорядокВидовЦен");
	
	Отчет.ОтборВидыЦен.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка,
	|	999 КАК Порядок,
	|	ЛОЖЬ КАК Выбрать
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен";
	//Выборка = Запрос.Выполнить().Выбрать();
	ТЗ_ВидыЦен = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ_ПорядокВидовЦен <> Неопределено Тогда
		Для каждого ЭлементТЗ из ТЗ_ПорядокВидовЦен Цикл
			Отбор = Новый Структура("Ссылка", ЭлементТЗ.ВидЦены);
			НайденныеСтроки = ТЗ_ВидыЦен.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Попытка
					НайденныеСтроки[0].Порядок = ЭлементТЗ.ПорядокЦены;
					НайденныеСтроки[0].Выбрать = ЭлементТЗ.Выбрать;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		ТЗ_ВидыЦен.Сортировать("Порядок");		
	КонецЕсли;
	
	Для каждого ЭлементТЗ из ТЗ_ВидыЦен Цикл
		НоваяСтрока = Отчет.ОтборВидыЦен.Добавить();
		НоваяСтрока.ВидЦены = ЭлементТЗ.ССылка;
		НоваяСтрока.Выбрать = ЭлементТЗ.Выбрать;
	КонецЦикла;
	
	Элементы.ГруппаИндивидуальныеЦены.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены");
	УправлениеВидимостьюПоИндивидуальнымЦенам();
	
	//#3642
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	СКДНоменклатура = ТекОбъект.ПолучитьМакет("СКДНоменклатура");
	ИнициализироватьКомпоновщикНастроек(СКДНоменклатура, КомпоновщикНастроекНоменклатура);
	СКДФактура = ТекОбъект.ПолучитьМакет("СКДФактура");
	ИнициализироватьКомпоновщикНастроек(СКДФактура, КомпоновщикНастроекФактура);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	УправлениеВидимостьюПоВидуЦен();	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	ТЗ_ПорядокВидовЦен = Отчет.ОтборВидыЦен.Выгрузить(, "НомерСтроки, Выбрать, ВидЦены");
	Если ТЗ_ПорядокВидовЦен.Количество() > 0 Тогда
		ТЗ_ПорядокВидовЦен.Колонки.НомерСтроки.Имя = "ПорядокЦены";
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
			"ОтчетПрайсЛист",
			"ПорядокВидовЦен",
			ТЗ_ПорядокВидовЦен);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы();
	
	// №6999 добавлено присвоение значения по умолчанию
	Если НЕ ЗначениеЗаполнено(Отчет.ВидНоменклатурыПотолки) Тогда
		Отчет.ВидНоменклатурыПотолки = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек(МакетСКД, КомпоновщикНастроек)
	
	АдресВХ = ПоместитьВоВременноеХранилище(МакетСКД, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХ);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(МакетСКД.НастройкиПоУмолчанию);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ГруппаОтборНоменклатуры.Видимость = Ложь;
	Элементы.ГруппаОтборФактуры.Видимость = Ложь;
	Элементы.ВыводитьКартинки.Видимость = Ложь;
	//Элементы.ДобавлятьФактуруВНазваниеЦвета.Видимость = Ложь;
	Элементы.ПоказыватьНулевыеЦены.Видимость = Истина;
	Элементы.ВидНоменклатурыПотолки.Видимость = Ложь;
	
	Если Отчет.ВидПрайсЛиста = 0 Тогда
		Элементы.ГруппаОтборНоменклатуры.Видимость = Истина;
		Элементы.ВыводитьКартинки.Видимость = Истина;
		
	ИначеЕсли Отчет.ВидПрайсЛиста = 1 Тогда
		Элементы.ГруппаОтборФактуры.Видимость = Истина;
		Элементы.ВидНоменклатурыПотолки.Видимость = Истина;
		//Элементы.ДобавлятьФактуруВНазваниеЦвета.Видимость = Истина;
	ИначеЕсли Отчет.ВидПрайсЛиста = 2 Тогда
		Элементы.ПоказыватьНулевыеЦены.Видимость = Ложь;
	ИначеЕсли Отчет.ВидПрайсЛиста = 3 Тогда
		Элементы.ГруппаОтборНоменклатуры.Видимость = Истина;
		Элементы.ГруппаОтборФактуры.Видимость = Истина;
		Элементы.ВыводитьКартинки.Видимость = Истина;
		//Элементы.ВидНоменклатурыПотолки.Видимость = Истина;
		//Элементы.ДобавлятьФактуруВНазваниеЦвета.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция НайтиЦену(Выборка, СписокВидовЦен, НомерЦеныВСписке, ТаблицаСЦенами)
	
	ОтборЦены = Новый Структура;
	ОтборЦены.Вставить("Номенклатура", 	Выборка.Номенклатура);
	ОтборЦены.Вставить("ЕдИзм",			Выборка.ЕдИзм);
	ОтборЦены.Вставить("ВидЦены",		СписокВидовЦен.Получить(НомерЦеныВСписке).Значение);
	ОтборЦены.Вставить("ХарактеристикаНоменклатуры",Выборка.ХарактеристикаНоменклатуры);
	НайденныеСтроки = ТаблицаСЦенами.НайтиСтроки(ОтборЦены);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].Цена;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура СформироватьНаСервереУслугиПроизводства()
	
	СписокВидовЦен = Новый СписокЗначений;
	СтруктураПараметров = Новый Структура;	
	ИнициализацияПараметровОтчета(СписокВидовЦен, СтруктураПараметров);
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ТекОбъект.ПолучитьМакет("МакетУслугиРаскроя");	
	МакетОсновной = ТекОбъект.ПолучитьМакет("Макет");
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_УслугиРаскроя";
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = МакетОсновной.ПолучитьОбласть("ШапкаПрайса");
	ОбластьМакета.Параметры.Организация = Отчет.Организация;
	ОбластьМакета.Параметры.Дата = Формат(Отчет.Дата,"ДЛФ=ДД");
	Таб.Вывести(ОбластьМакета);
	
	ВывестиУслугиПроизводства(Отчет.Дата, СписокВидовЦен, Макет, Таб);
	
	Результат = Таб;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервереКомплектующие()
	
	СписокВидовЦен = Новый СписокЗначений;
	СтруктураПараметров = Новый Структура;	
	ИнициализацияПараметровОтчета(СписокВидовЦен, СтруктураПараметров);
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_Комплектующие";
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПрайса");
	//ОбластьМакета.Параметры.Организация = Отчет.Организация;
	//ОбластьМакета.Параметры.Дата = Формат(Отчет.Дата,"ДЛФ=ДД");
	Таб.Вывести(ОбластьМакета);
	
	ВывестиКомплектующие(СтруктураПараметров, Макет, Таб);
	
	Результат = Таб;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервереПродукция()
	
	СписокВидовЦен = Новый СписокЗначений;
	СтруктураПараметров = Новый Структура;	
	ИнициализацияПараметровОтчета(СписокВидовЦен, СтруктураПараметров);
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ТекОбъект.ПолучитьМакет("МакетПотолки");
	МакетОсновной = ТекОбъект.ПолучитьМакет("Макет");
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_Потолки";
	
	ОбластьМакета = МакетОсновной.ПолучитьОбласть("ШапкаПрайса");
	ОбластьМакета.Параметры.Организация = Отчет.Организация;
	ОбластьМакета.Параметры.Дата = Формат(Отчет.Дата,"ДЛФ=ДД");
	Таб.Вывести(ОбластьМакета);
		
	ВывестиЦеныНаПродукцию(СтруктураПараметров, Макет, Таб);
	
	Результат = Таб;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервереВсе()
		
	СписокВидовЦен = Новый СписокЗначений;
	СтруктураПараметров = Новый Структура;	
	ИнициализацияПараметровОтчета(СписокВидовЦен, СтруктураПараметров);
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ТекОбъект.ПолучитьМакет("Макет");
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист";
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПрайса");
	ОбластьМакета.Параметры.Организация = Отчет.Организация;
	ОбластьМакета.Параметры.Дата = Формат(Отчет.Дата,"ДЛФ=ДД");
	Таб.Вывести(ОбластьМакета);	
		
	//КОМПЛЕКТУЮЩИЕ
	ТабВрем = Новый ТабличныйДокумент;
	ВывестиКомплектующие(СтруктураПараметров, Макет, ТабВрем);
	ПрисоединитьТабличныйДокумент(Таб, ТабВрем);
		
	//ПОТОЛКИ
	ТабВрем = Новый ТабличныйДокумент;
	МакетПотолки = ТекОбъект.ПолучитьМакет("МакетПотолки");
	ВывестиЦеныНаПродукцию(СтруктураПараметров, МакетПотолки, ТабВрем);
	ПрисоединитьТабличныйДокумент(Таб, ТабВрем);
	
	//УСЛУГИ ПРОИЗВОДСТВА
	ТабВрем = Новый ТабличныйДокумент;
	Макет = ТекОбъект.ПолучитьМакет("МакетУслугиРаскроя");	
	ВывестиУслугиПроизводства(Отчет.Дата, СписокВидовЦен, Макет, ТабВрем);
	ПрисоединитьТабличныйДокумент(Таб, ТабВрем);
	
	Результат = Таб;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	// №6999 переделано на вызов стандартной проверки заполнения
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	//проверка перенесена в модуль объекта
	//Если Отчет.ИндивидуальныеЦены 
	//	И (НЕ ЗначениеЗаполнено(Отчет.Контрагент) ИЛИ НЕ ЗначениеЗаполнено(Отчет.ДоговорКонтрагента)) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен контрагент или договор");
	//КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПрайсЛист;
	Если Отчет.ВидПрайсЛиста = 0 Тогда
		СформироватьНаСервереКомплектующие();
	ИначеЕсли Отчет.ВидПрайсЛиста = 1 Тогда
		СформироватьНаСервереПродукция();
	ИначеЕсли Отчет.ВидПрайсЛиста = 2 Тогда
		СформироватьНаСервереУслугиПроизводства();
	ИначеЕсли Отчет.ВидПрайсЛиста = 3 Тогда	
		СформироватьНаСервереВсе();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПрайсЛистаПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаПечать(Команда)
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПрайсЛист");
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "ПрайсЛист");
	ПечатнаяФорма.СинонимМакета = "ПрайсЛист";
	ПечатнаяФорма.ТабличныйДокумент = Результат;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "ПрайсЛист";
	
	ОбластиОбъектов = Новый СписокЗначений;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

КонецПроцедуры

&НаСервере
Функция ОтправитьПоПочтеНаСервере()
	
	ЗаголовокНовогоПисьма = "Прайс-лист от " + Формат(Отчет.Дата,"ДЛФ=Д") + " компании " + Отчет.Организация.Наименование;
	
	ТекстПисьма = "Добрый день!
	| Высылаем вам прайс-лист.";	
	
	НовоеПисьмо = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо(ЗаголовокНовогоПисьма, , ТекстПисьма);
	
	Возврат НовоеПисьмо;				
				
КонецФункции

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Если Отчет.Организация.Пустая() Тогда 
		ПоказатьПредупреждение(,"Не указана организация");
	Иначе
		//Если Отчет.ВыводитьКартинки Тогда 
		//	
		//	ПоказатьПредупреждение(, "Файл прайс-листа с картинками будет большим и не сможет быть отправлен по почте.
		//								|Сформируйте прайс без картинок и повторите отправку по почте");
		//	Элементы.ГруппаОтправить.Доступность = Ложь;
		//	
		//Иначе
			
			НовоеПисьмо = ОтправитьПоПочтеНаСервере();
			
			НазваниеОрганизации = СтрЗаменить(Отчет.Организация,"""","");
			ИмяФайла = КаталогВременныхФайлов() + "Прайс-лист от " + Формат(Отчет.Дата,"ДЛФ=Д") + " компании " + НазваниеОрганизации + ".xls";
			Результат.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
			ИмяБезРасширения = КаталогВременныхФайлов() + "Прайс-лист от " + Формат(Отчет.Дата,"ДЛФ=Д") + " компании " + НазваниеОрганизации; 
			Расширение = ".xls";
			
			ВложитьФайлНаСервере(НовоеПисьмо,ИмяБезРасширения,Расширение, ОбщийМодуль.Сериализовать(Новый ДвоичныеДанные(ИмяФайла)));
			
			ПараметрыНовойФормы = Новый Структура("Ключ", НовоеПисьмо);
			ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",ПараметрыНовойФормы);
			
		//КонецЕсли;
	КонецЕсли;   	
КонецПроцедуры

&НаСервере
Процедура ВложитьФайлНаСервере(Ссылка, ИмяФайла, Расширение, Данные)
	РаботаСЭлектроннойПочтой.СохранитьВложение(Ссылка, ИмяФайла, Расширение, Данные);
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	Если ПраваПользователей.ВидЦенДоступенПользователю(Отчет.ВидЦен) Тогда
	Иначе
		Отчет.ВидЦен = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НесколькоВидовЦенПриИзменении(Элемент)
	
	УправлениеВидимостьюПоВидуЦен();
	//Элементы.ГруппаОтборВидыЦен.Видимость = Отчет.НесколькоВидовЦен;
	//Элементы.ВидЦен.Видимость = НЕ Отчет.НесколькоВидовЦен;
	Если Отчет.НесколькоВидовЦен Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОтборВидыЦен;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюПоВидуЦен()
	
	Элементы.ГруппаОтборВидыЦен.Видимость = Отчет.НесколькоВидовЦен;
	Элементы.ВидЦен.Видимость = НЕ Отчет.НесколькоВидовЦен;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюПоИндивидуальнымЦенам()
	
	Элементы.ГруппаИндивидуальныеЦеныКонтрагент.Видимость = Отчет.ИндивидуальныеЦены;
	Элементы.НесколькоВидовЦен.Видимость = НЕ Отчет.ИндивидуальныеЦены;
	Если Отчет.ИндивидуальныеЦены Тогда
		Отчет.НесколькоВидовЦен = Ложь;
		УправлениеВидимостьюПоВидуЦен();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВидыЦенВыбратьВсе(Команда)
	Для Каждого ТекЦена Из Отчет.ОтборВидыЦен Цикл
		ТекЦена.Выбрать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВидыЦенОтменитьВыборВсех(Команда)
	Для Каждого ТекЦена Из Отчет.ОтборВидыЦен Цикл
		ТекЦена.Выбрать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСсылокПоОтбору(МакетСКД, КомпоновщикНастроек, НаименованиеКолонки)
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, НастройкиКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТЗ.ВыгрузитьКолонку(НаименованиеКолонки);
	 	
КонецФункции
	
&НаСервере
Процедура ИнициализацияПараметровОтчета(СписокВидовЦен, СтруктураПараметров)
	
	Если Отчет.Дата = Дата(1,1,1) Тогда
		Отчет.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ Отчет.НесколькоВидовЦен Тогда
		СписокВидовЦен.Добавить(Отчет.ВидЦен);
	Иначе
		Для Каждого ТекущаяСтрока Из Отчет.ОтборВидыЦен Цикл
			Если ТекущаяСтрока.Выбрать Тогда
				СписокВидовЦен.Добавить(ТекущаяСтрока.ВидЦены);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	СКДНоменклатура = ТекОбъект.ПолучитьМакет("СКДНоменклатура");
	СКДФактура 		= ТекОбъект.ПолучитьМакет("СКДФактура");
	СписокДляОтбораНоменклатуры = ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, КомпоновщикНастроекНоменклатура, "Номенклатура");
	СписокДляОтбораФактур 		= ПолучитьМассивСсылокПоОтбору(СКДФактура, КомпоновщикНастроекФактура, "Фактура");
	
	//СписокДляОтбораНоменклатуры = Новый СписокЗначений;
	//Для Каждого ТекущаяСтрока Из Отчет.ОтборГруппНоменклатуры Цикл
	//	СписокДляОтбораНоменклатуры.Добавить(ТекущаяСтрока.Номенклатура);
	//КонецЦикла;
	Если СписокДляОтбораНоменклатуры.Количество() = 0 Тогда
		СписокДляОтбораНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	//СписокДляОтбораФактур = Новый СписокЗначений;
	//Для Каждого ТекущаяСтрока Из Отчет.ОтборГруппФактуры Цикл
	//	СписокДляОтбораФактур.Добавить(ТекущаяСтрока.Фактура);
	//КонецЦикла;
	//Если СписокДляОтбораФактур.Количество() = 0 Тогда
	//	СписокДляОтбораФактур.Добавить(Справочники.Фактура.ПустаяСсылка());
	//КонецЕсли;	
	
	Если НЕ СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров.Вставить("ДатаОтчета", 					Отчет.Дата);
		СтруктураПараметров.Вставить("СписокВидовЦен", 				СписокВидовЦен);
		СтруктураПараметров.Вставить("СписокДляОтбораНоменклатуры", СписокДляОтбораНоменклатуры);
		СтруктураПараметров.Вставить("СписокДляОтбораФактур", 		СписокДляОтбораФактур);
		СтруктураПараметров.Вставить("Валюта", 						Отчет.Валюта);
		СтруктураПараметров.Вставить("ПоказыватьНулевыеЦены", 		Отчет.ПоказыватьНулевыеЦены);
		СтруктураПараметров.Вставить("ВидНоменклатурыПотолки",		Отчет.ВидНоменклатурыПотолки);
	КонецЕсли;

КонецПроцедуры

#Область ЦеныУслугПроизводства

&НаСервере
Функция ТекстЗапросаЦенУслугРаскроя()
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникВидыЦен.Ссылка КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА СправочникВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА СправочникВидыЦен.ВидЦеныНаУслугиПроизводства
	|		ИНАЧЕ СправочникВидыЦен.Ссылка
	|	КОНЕЦ КАК ВидЦеныРасчетный
	|ПОМЕСТИТЬ ВТ_ВидыЦен
	|ИЗ
	|	Справочник.ВидыЦен КАК СправочникВидыЦен
	|ГДЕ
	|	СправочникВидыЦен.Ссылка В(&ВидЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Валюта КАК Валюта,
	//|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ВидЦен КАК ВидЦен,
	|	ВТ_ВидыЦен.ВидЦены КАК ВидЦены,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.Углы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК Углы,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ВырезыApply.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ВырезыApply,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.Фотопечать.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК Фотопечать,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ДлинаШвов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ДлинаШвов,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ДлинаПользовательскихШвов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ДлинаПользовательскихШвов,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ВнутренниеВырезы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ВнутренниеВырезы,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.Кривые.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК Кривые,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ДлинаШвовМногофактурный.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ДлинаШвовМногофактурный,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.СтоимостьУслугиЦентровкиШва КАК СтоимостьУслугиЦентровкиШва
	|ИЗ
	|	РегистрСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СрезПоследних(
	|			&Период,
	//|			ВидЦен В (&ВидЦены) И
	|			ВЫБОР
	|				КОГДА &ОтборПоВалюте
	|					ТОГДА Валюта = &Валюта
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидыЦен КАК ВТ_ВидыЦен
	|		ПО (ВТ_ВидыЦен.ВидЦеныРасчетный = СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ВидЦен)";
	
КонецФункции

&НаСервере
Функция ТекстЗапросаИндивидуальныхЦенУслугРаскроя()
	Возврат
	"ВЫБРАТЬ
	|	""Индивидуальная цена"" КАК ВидЦен,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Валюта КАК Валюта,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Отменена КАК Отменена,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ВидЦеныНаУслугиПроизводства КАК ВидЦеныНаУслугиПроизводства,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.Углы.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК Углы,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ВырезыApply.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ВырезыApply,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.Фотопечать.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК Фотопечать,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ДлинаШвов.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ДлинаШвов,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ДлинаПользовательскихШвов.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ДлинаПользовательскихШвов,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ВнутренниеВырезы.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ВнутренниеВырезы,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.Кривые.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК Кривые,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ДлинаШвовМногофактурный.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ДлинаШвовМногофактурный,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.СтоимостьУслугиЦентровкиШва КАК СтоимостьУслугиЦентровкиШва
	|ИЗ
	|	РегистрСведений.СоответствиеИндивидуальныхЦенЦенамУслугРаскроя.СрезПоследних(
	|			&Период,
	|			ДоговорКонтрагента = &ДоговорКонтрагента
	|				И ВЫБОР
	|					КОГДА &ОтборПоВалюте
	|						ТОГДА Валюта = &Валюта
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних";
	
КонецФункции

&НаСервере
Процедура ВывестиТаблицуУслугРаскроя(ТаблицаДанных, Таб, Макет, ГруппаУслуг, ЗаголовокУслуг)
	
	//Если ТаблицаДанных[ГруппаУслуг].Количество() > 1 Тогда 
		//несколько услуг
		ОбластьМакета = Макет.ПолучитьОбласть("ГруппаУслуг");
		ОбластьМакета.Параметры.Услуга = ЗаголовокУслуг;
		Таб.Вывести(ОбластьМакета, 2, ГруппаУслуг, Истина);
		
		ТаблицаДанных[ГруппаУслуг].Сортировать("КоличествоДо Возр");
		Для Каждого ТекУслуга Из ТаблицаДанных[ГруппаУслуг] Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Услуга");
			ОбластьМакета.Параметры.Заполнить(ТекУслуга);
			//ОбластьМакета.Параметры.Услуга = ЗаголовокУслуг + " с " + ТекУслуга.КоличествоОт + " по " + ТекУслуга.КоличествоДо;
			//ОбластьМакета.Параметры.Цена = ТекУслуга.Цена;
			Таб.Вывести(ОбластьМакета, 3, ГруппаУслуг+1, Истина);
		КонецЦикла;
		
	//Иначе
	//	//одна услуга
	//	Для Каждого ТекУслуга Из ТаблицаДанных[ГруппаУслуг] Цикл
	//		ОбластьМакета = Макет.ПолучитьОбласть("УслугаБезОтступа");
	//		ОбластьМакета.Параметры.Услуга = ЗаголовокУслуг;
	//		ОбластьМакета.Параметры.Цена = ТекУслуга.Цена;
	//		Таб.Вывести(ОбластьМакета, 2, ГруппаУслуг, Истина);
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиУслугиПроизводства(ДатаОтчета, СписокВидовЦен, Макет, Таб)
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ИндУсловия = Ложь;
	Если Отчет.ИндивидуальныеЦены Тогда		
		ЗапросИндЦены = Новый Запрос;
		ЗапросИндЦены.Текст = ТекстЗапросаИндивидуальныхЦенУслугРаскроя();
		ЗапросИндЦены.УстановитьПараметр("Период",  ДатаОтчета);
		ЗапросИндЦены.УстановитьПараметр("ДоговорКонтрагента", Отчет.ДоговорКонтрагента);
		ЗапросИндЦены.УстановитьПараметр("Валюта", Отчет.Валюта);
		ЗапросИндЦены.УстановитьПараметр("ОтборПоВалюте", ЗначениеЗаполнено(Отчет.Валюта));
		ТаблицаЦены = ЗапросИндЦены.Выполнить().Выгрузить();
		Если ТаблицаЦены.Количество() > 0 Тогда
			Если НЕ ТаблицаЦены[0].Отменена Тогда
				ИндУсловия = Истина;
				//#7256
				Если ЗначениеЗаполнено(ТаблицаЦены[0].ВидЦеныНаУслугиПроизводства) Тогда
					// цены по ссылке на другой вид цен
					ИндЦена = Новый Массив;
					ИндЦена.Добавить(ТаблицаЦены[0].ВидЦеныНаУслугиПроизводства);
					Запрос = Новый Запрос;
					Запрос.Текст = ТекстЗапросаЦенУслугРаскроя();
					Запрос.УстановитьПараметр("Период",  ДатаОтчета);
					//Запрос.УстановитьПараметр("ОтборПоВидамЦен", Ложь);	
					Запрос.УстановитьПараметр("ВидЦены", ИндЦена); //Новый Массив);	
					//Запрос.УстановитьПараметр("ЦенаУслуг", ТаблицаЦены[0].ВидЦеныНаУслугиПроизводства);
					Запрос.УстановитьПараметр("Валюта", Отчет.Валюта);
					Запрос.УстановитьПараметр("ОтборПоВалюте", ЗначениеЗаполнено(Отчет.Валюта));
					ТаблицаЦены = Запрос.Выполнить().Выгрузить();					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ИндУсловия Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаЦенУслугРаскроя();
		Запрос.УстановитьПараметр("Период",  ДатаОтчета);
		//Запрос.УстановитьПараметр("ОтборПоВидамЦен", Истина);
		Запрос.УстановитьПараметр("ВидЦены", СписокВидовЦен);
		//Запрос.УстановитьПараметр("ЦенаУслуг", Неопределено);
		Запрос.УстановитьПараметр("Валюта", Отчет.Валюта);
		Запрос.УстановитьПараметр("ОтборПоВалюте", ЗначениеЗаполнено(Отчет.Валюта));
		ТаблицаЦены = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если ТаблицаЦены.Количество() > 0 Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
		Таб.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		Таб.Вывести(ОбластьМакета);
		
		Для Каждого ТекВидЦен Из ТаблицаЦены Цикл
			Если Отчет.НесколькоВидовЦен Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ВидЦен");
				ОбластьМакета.Параметры.ВидЦены = ВРЕГ(ТекВидЦен.ВидЦены) + " (" + ТекВидЦен.Валюта + ")";
				Таб.Вывести(ОбластьМакета, 1, "ВидЦен", Истина);
			КонецЕсли;
			
			Если ТекВидЦен.Углы.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "Углы", "Углы");
			КонецЕсли;
			Если ТекВидЦен.ВырезыApply.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ВырезыApply", "Вырезы Apply");
			КонецЕсли;
			Если ТекВидЦен.Фотопечать.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "Фотопечать", "Фотопечать");
			КонецЕсли;
			Если ТекВидЦен.ДлинаШвов.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ДлинаШвов", "Швы по длине");
			КонецЕсли;
			Если ТекВидЦен.ДлинаПользовательскихШвов.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ДлинаПользовательскихШвов", "Дополнительные швы по длине");
			КонецЕсли;
			Если ТекВидЦен.ВнутренниеВырезы.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ВнутренниеВырезы", "Внутренние вырезы");
			КонецЕсли;
			Если ТекВидЦен.Кривые.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "Кривые", "Криволинейный участок");
			КонецЕсли;
			Если ТекВидЦен.ДлинаШвовМногофактурный.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ДлинаШвовМногофактурный", "Швы в многофактурном потолке по длине");
			КонецЕсли;
			
			Если НЕ ТекВидЦен.СтоимостьУслугиЦентровкиШва = 0 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("УслугаБезОтступа");
				ОбластьМакета.Параметры.Услуга = "Центровка шва в % от заказа";
				ОбластьМакета.Параметры.Цена = ТекВидЦен.СтоимостьУслугиЦентровкиШва;
				Таб.Вывести(ОбластьМакета, 2, "ЦентровкаШва", Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ВывестиКомплектующие(СтруктураПараметров, Макет, Таб)
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	Таб.Вывести(ОбластьМакета);
	
	Если Отчет.ВыводитьКартинки Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Фото");
		Таб.Вывести(ОбластьМакета);
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	Если Отчет.ВыводитьКартинки Тогда
		Таб.Присоединить(ОбластьМакета);
	Иначе           Таб.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество()-1 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Цена");
		ОбластьМакета.Параметры.ВидЦен = СтруктураПараметров.СписокВидовЦен.Получить(НомерЦены).Значение;
		ОбластьМакета.Параметры.Валюта = Отчет.Валюта;
		Таб.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Период", 				КонецДня(СтруктураПараметров.ДатаОтчета));
	Запрос.УстановитьПараметр("ВидЦены", 				СтруктураПараметров.СписокВидовЦен);
	Запрос.УстановитьПараметр("Номенклатура", 			СтруктураПараметров.СписокДляОтбораНоменклатуры);
	Запрос.УстановитьПараметр("Валюта", 				СтруктураПараметров.Валюта);
	Запрос.УстановитьПараметр("НеПоказыватьНулевыеЦены", НЕ СтруктураПараметров.ПоказыватьНулевыеЦены);
	
	Запрос.УстановитьПараметр("ИспользоватьИндивидуальныеЦены",	Отчет.ИндивидуальныеЦены);
	Запрос.УстановитьПараметр("Контрагент",				Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",		Отчет.ДоговорКонтрагента);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Отменена КАК Отменена
	|ПОМЕСТИТЬ ВТ_ИндивидуальныеЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И Валюта = &Валюта) КАК ЦеныНоменклатурыИндивидуальныеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Период,
	|				Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|					И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Цена, 0)
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныВрем
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Валюта = &Валюта) КАК ЦеныСрезПоследних
	|		ПО (ЦеныСрезПоследних.ВидЦены = ВидыЦен.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Валюта = &Валюта) КАК ЦеныСсылочныхСрезПоследних
	|		ПО (ЦеныСсылочныхСрезПоследних.ВидЦены = ВидыЦен.ВидЦеныНоменклатуры)
	|ГДЕ
	|	ВидыЦен.Ссылка В(&ВидЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЦеныВрем.Номенклатура КАК Номенклатура,
	|	ВТ_ЦеныВрем.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ЦеныВрем.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ЦеныВрем.ВидЦены КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ИндивидуальныеЦены.Цена ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_ИндивидуальныеЦены.Отменена
	|						ТОГДА ВТ_ИндивидуальныеЦены.Цена
	|					ИНАЧЕ ВТ_ЦеныВрем.Цена
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ЦеныВрем.Цена
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	ВТ_ЦеныВрем КАК ВТ_ЦеныВрем
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальныеЦены КАК ВТ_ИндивидуальныеЦены
	|		ПО (&ИспользоватьИндивидуальныеЦены)
	|			И ВТ_ЦеныВрем.Валюта = ВТ_ИндивидуальныеЦены.Валюта
	|			И ВТ_ЦеныВрем.ЕдиницаИзмерения = ВТ_ИндивидуальныеЦены.ЕдиницаИзмерения
	|			И ВТ_ЦеныВрем.Номенклатура = ВТ_ИндивидуальныеЦены.Номенклатура
	|			И ВТ_ЦеныВрем.ХарактеристикаНоменклатуры = ВТ_ИндивидуальныеЦены.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИндивидуальныеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЦеныВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(СправочникХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ВТ_Цены.ЕдиницаИзмерения, СправочникНоменклатура.БазоваяЕдиницаИзмерения) КАК ЕдИзм,
	|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена,
	|	ВТ_Цены.ВидЦены КАК ВидЦены,
	|	ЕСТЬNULL(НоменклатураПрисоединенныеФайлы.ФайлХранилище, НЕОПРЕДЕЛЕНО) КАК ФайлХранилище,
	|	СправочникНоменклатура.Код КАК КодНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СправочникХарактеристикиНоменклатуры
	|		ПО (СправочникХарактеристикиНоменклатуры.Владелец = СправочникНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО СправочникНоменклатура.Ссылка = ВТ_Цены.Номенклатура
	|			И (ЕСТЬNULL(СправочникХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ВТ_Цены.ХарактеристикаНоменклатуры)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|		ПО (НоменклатураПрисоединенныеФайлы.ВладелецФайла = СправочникНоменклатура.Ссылка)
	|			И (НоменклатураПрисоединенныеФайлы.Ссылка = СправочникНоменклатура.ФайлКартинки)
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)
	|	И НЕ СправочникНоменклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА &НеПоказыватьНулевыеЦены
	|				ТОГДА ЕСТЬNULL(ВТ_Цены.Цена, 0) <> 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СправочникНоменклатура.ЭтоГруппа УБЫВ,
	|	Номенклатура
	|ИТОГИ ПО
	|	Номенклатура ИЕРАРХИЯ,
	|	ЕдИзм,
	|	ХарактеристикаНоменклатуры
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		// вывод групп номенклатуры
		Если ВыборкаНоменклатуры.Номенклатура.ЭтоГруппа Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Группа|Данные");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаНоменклатуры);
			Таб.Вывести(ОбластьМакета,ВыборкаНоменклатуры.Номенклатура.Уровень(),"Номенклатура"+ВыборкаНоменклатуры.Номенклатура.Уровень(),Истина);
			ОбластьЯчеек = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 1);
			ОбластьЯчеек.Отступ = 2* ВыборкаНоменклатуры.Номенклатура.Уровень();
			Если Отчет.ВыводитьКартинки Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Группа|Фото");
				Таб.Присоединить(ОбластьМакета,ВыборкаНоменклатуры.Номенклатура.Уровень(),"Номенклатура"+ВыборкаНоменклатуры.Номенклатура.Уровень(),Истина);
			КонецЕсли;
			
			
			Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество()-1 Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Группа|Цена");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаНоменклатуры);
				Таб.Присоединить(ОбластьМакета,ВыборкаНоменклатуры.Номенклатура.Уровень(),"Номенклатура"+ВыборкаНоменклатуры.Номенклатура.Уровень(),Истина);
			КонецЦикла;
			
			
			
			ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 2 + СтруктураПараметров.СписокВидовЦен.Количество() + ?(Отчет.ВыводитьКартинки, 1, 0));
			ОбластьОбъединения.Объединить();
			
			// вывод самой номенклатуры
		Иначе
			ВыборкаЕдиницИзмерения = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаЕдиницИзмерения.Следующий() Цикл	
				Если Отчет.ВыводитьКартинки Тогда
					ОбластьМакетаФото = Макет.ПолучитьОбласть("СтрокаСФото|Фото");
					Если ЗначениеЗаполнено(ВыборкаЕдиницИзмерения.Номенклатура.ФайлКартинки) Тогда
						ЗначениеХранилища = ВыборкаЕдиницИзмерения.Номенклатура.ФайлКартинки.ФайлХранилище.Получить();
					Иначе
						ЗначениеХранилища = Неопределено;
					КонецЕсли;
					Картинка = Новый Картинка(ЗначениеХранилища);
					ОбластьМакетаФото.Рисунки.ФотоТовара.Картинка = Картинка;									
					Таб.Вывести(ОбластьМакетаФото,ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),"Номенклатура"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),Истина);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть(?(Отчет.ВыводитьКартинки, "СтрокаСФото|Данные", "Строка|Данные"));
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаЕдиницИзмерения);
				Если Отчет.ВыводитьКартинки Тогда
					Таб.Присоединить(ОбластьМакета,ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),"Номенклатура"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),Истина);
				Иначе
					Таб.Вывести(ОбластьМакета,ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),"Номенклатура"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),Истина);
				КонецЕсли;
				ОбластьЯчеек = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 1);
				ОбластьЯчеек.Отступ = 2* ВыборкаЕдиницИзмерения.Номенклатура.Уровень();
				
				ВыборкаХарактеристик = ВыборкаЕдиницИзмерения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				ЭтоПервый = Истина;
				Пока ВыборкаХарактеристик.Следующий() Цикл
					
					Если ВыборкаХарактеристик.ХарактеристикаНоменклатуры.Пустая() Тогда
						
						// характеристики не используются
						Цены = Новый Соответствие;
						ВыборкаЦен = ВыборкаХарактеристик.Выбрать();
						Пока ВыборкаЦен.Следующий() Цикл
							Цены.Вставить(ВыборкаЦен.ВидЦены, ВыборкаЦен.Цена);
						КонецЦикла;
						
						Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество() - 1 Цикл
							ОбластьМакета = Макет.ПолучитьОбласть(?(Отчет.ВыводитьКартинки, "СтрокаСФото|Цена", "Строка|Цена"));
							ОбластьМакета.Параметры.Цена = Цены.Получить(СтруктураПараметров.СписокВидовЦен.Получить(НомерЦены).Значение);
							Таб.Присоединить(ОбластьМакета,ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),"Номенклатура"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),Истина);
						КонецЦикла;
						
					Иначе
						Если ЭтоПервый Тогда
							Если Отчет.ВыводитьКартинки Тогда
								ОбластьМакетаФото = Макет.ПолучитьОбласть("СтрокаСФото|Фото");
								Если ЗначениеЗаполнено(ВыборкаЕдиницИзмерения.Номенклатура.ФайлКартинки) Тогда
									ЗначениеХранилища = ВыборкаЕдиницИзмерения.Номенклатура.ФайлКартинки.ФайлХранилище.Получить();
								Иначе
									ЗначениеХранилища = Неопределено;
								КонецЕсли;
								Картинка = Новый Картинка(ЗначениеХранилища);								 
								ОбластьМакетаФото.Рисунки.ФотоТовара.Картинка = Картинка;									
								Таб.Присоединить(ОбластьМакетаФото,ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),"Номенклатура"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень(),Истина);
							КонецЕсли;
							
							Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество()-1 Цикл
								ОбластьМакета = Макет.ПолучитьОбласть(?(Отчет.ВыводитьКартинки, "СтрокаСФото|Цена", "Строка|Цена"));
								Таб.Присоединить(ОбластьМакета,ВыборкаНоменклатуры.Номенклатура.Уровень(),"Номенклатура"+ВыборкаНоменклатуры.Номенклатура.Уровень(),Истина);
							КонецЦикла;	
							ЭтоПервый = Ложь;
						КонецЕсли;
						
						Цены = Новый Соответствие;
						ВыборкаЦен = ВыборкаХарактеристик.Выбрать();
						Пока ВыборкаЦен.Следующий() Цикл
							Цены.Вставить(ВыборкаЦен.ВидЦены, ВыборкаЦен.Цена);
						КонецЦикла;
						
						Если Отчет.ВыводитьКартинки Тогда								
							ОбластьМакетаФото = Макет.ПолучитьОбласть("Характеристика|Фото");
							Таб.вывести(ОбластьМакетаФото,ВыборкаЕдиницИзмерения.Номенклатура.Уровень()+1,"Характеристика"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень()+1,Истина);
						КонецЕсли;
						ОбластьМакета = Макет.ПолучитьОбласть("Характеристика|Данные");
						ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаХарактеристик);
						Если Отчет.ВыводитьКартинки Тогда
							Таб.Присоединить(ОбластьМакета,ВыборкаЕдиницИзмерения.Номенклатура.Уровень()+1,"Характеристика"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень()+1,Истина);
						Иначе
							Таб.Вывести(ОбластьМакета,ВыборкаЕдиницИзмерения.Номенклатура.Уровень()+1,"Характеристика"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень()+1,Истина);
						Конецесли;
						ОбластьЯчеек = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 1);
						ОбластьЯчеек.Отступ = 2* ВыборкаЕдиницИзмерения.Номенклатура.Уровень() + 2;
						
						Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество() - 1 Цикл
							ОбластьМакета = Макет.ПолучитьОбласть("Характеристика|Цена");
							ОбластьМакета.Параметры.Цена = Цены.Получить(СтруктураПараметров.СписокВидовЦен.Получить(НомерЦены).Значение);										
							Таб.Присоединить(ОбластьМакета,ВыборкаЕдиницИзмерения.Номенклатура.Уровень()+1,"Характеристика"+ВыборкаЕдиницИзмерения.Номенклатура.Уровень()+1,Истина);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиЦеныНаПродукцию(СтруктураПараметров, Макет, Таб)
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	СписокВидовЦенМатериалов = Новый СписокЗначений;
	СписокВидовЦенМатериалов.ЗагрузитьЗначения(СтруктураПараметров.СписокВидовЦен.ВыгрузитьЗначения());
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	Таб.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	Таб.Вывести(ОбластьМакета);
	
	Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество()-1 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Цена");
		ОбластьМакета.Параметры.ВидЦены = ?(Отчет.ИндивидуальныеЦены, "Индивидуальная", СписокВидовЦенМатериалов.Получить(НомерЦены).Значение);
		ОбластьМакета.Параметры.Валюта = Отчет.Валюта;
		Таб.Присоединить(ОбластьМакета);
	КонецЦикла;
	//ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы-2, 1, Таб.ВысотаТаблицы-2, 2 + 2*СтруктураПараметров.СписокВидовЦен.Количество());
	//ОбластьОбъединения.Объединить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныИндивидуальныеСрезПоследних.Фактура КАК Фактура,
	|	ЦеныИндивидуальныеСрезПоследних.ЦветФактуры КАК ЦветФактуры,
	|	ЦеныИндивидуальныеСрезПоследних.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЦеныИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЦеныИндивидуальныеСрезПоследних.Цена
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ЦеныИндивидуальныеСрезПоследних.ВидЦеныСФотопечатью = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЦеныИндивидуальныеСрезПоследних.ЦенаСФотопечатью
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСФотопечатьюСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК ЦенаСФотопечатью,
	|	ЦеныИндивидуальныеСрезПоследних.Отменена КАК Отменена
	|ПОМЕСТИТЬ ВТ_ИндивидуальныеЦены
	|ИЗ
	|	РегистрСведений.ЦеныМатериаловИндивидуальные.СрезПоследних(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И Валюта = &Валюта) КАК ЦеныИндивидуальныеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|				&Период,
	|				ВидНоменклатуры = &ВидНоменклатуры
	|					И Валюта = &Валюта) КАК ЦеныСрезПоследних
	|		ПО ЦеныИндивидуальныеСрезПоследних.Фактура = ЦеныСрезПоследних.Фактура
	|			И ЦеныИндивидуальныеСрезПоследних.ЦветФактуры = ЦеныСрезПоследних.ЦветФактуры
	|			И ЦеныИндивидуальныеСрезПоследних.ВидЦены = ЦеныСрезПоследних.ВидЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|				&Период,
	|				ВидНоменклатуры = &ВидНоменклатуры
	|					И Валюта = &Валюта) КАК ЦеныСФотопечатьюСрезПоследних
	|		ПО (ЦеныИндивидуальныеСрезПоследних.Фактура = ЦеныСрезПоследних.Фактура)
	|			И (ЦеныИндивидуальныеСрезПоследних.ЦветФактуры = ЦеныСрезПоследних.ЦветФактуры)
	|			И (ЦеныИндивидуальныеСрезПоследних.ВидЦеныСФотопечатью = ЦеныСрезПоследних.ВидЦен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Фактура, ЗНАЧЕНИЕ(Справочник.Фактура.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Фактура, ЗНАЧЕНИЕ(Справочник.Фактура.ПустаяСсылка))
	|	КОНЕЦ КАК Фактура,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ЦветФактуры, ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ЦветФактуры, ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка))
	|	КОНЕЦ КАК ЦветФактуры,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Цена, 0)
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ЦенаСФотопечатью, 0)
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ЦенаСФотопечатью, 0)
	|	КОНЕЦ КАК ЦенаСФотопечатью
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|				&Период,
	|				ВидНоменклатуры = &ВидНоменклатуры
	|					И Валюта = &Валюта) КАК ЦеныСрезПоследних
	|		ПО (ЦеныСрезПоследних.ВидЦен = ВидыЦен.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|				&Период,
	|				ВидНоменклатуры = &ВидНоменклатуры
	|					И Валюта = &Валюта) КАК ЦеныСсылочныхСрезПоследних
	|		ПО (ЦеныСсылочныхСрезПоследних.ВидЦен = ВидыЦен.ВидЦеныНоменклатуры)
	|ГДЕ
	|	ВидыЦен.Ссылка В(&ВидЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦветаФактур.Владелец.Родитель КАК ГруппаФактуры,
	|	ЦветаФактур.Владелец КАК Фактура,
	|	ЦветаФактур.Ссылка КАК ЦветФактуры,
	|	ЕСТЬNULL(ВТ_Цены.ВидНоменклатуры, ЕСТЬNULL(ВТ_ИндивидуальныеЦены.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))) КАК ВидНоменклатурыПотолка,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ИндивидуальныеЦены.Цена ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_ИндивидуальныеЦены.Отменена
	|						ТОГДА ВТ_ИндивидуальныеЦены.Цена
	|					ИНАЧЕ ЕСТЬNULL(ВТ_Цены.Цена, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Цены.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ИндивидуальныеЦены.ЦенаСФотопечатью ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_ИндивидуальныеЦены.Отменена
	|						ТОГДА ВТ_ИндивидуальныеЦены.ЦенаСФотопечатью
	|					ИНАЧЕ ЕСТЬNULL(ВТ_Цены.ЦенаСФотопечатью, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Цены.ЦенаСФотопечатью, 0)
	|	КОНЕЦ КАК ЦенаСФотопечатью,
	|	ВТ_Цены.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.ЦветФактуры КАК ЦветаФактур
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ЦветаФактур.Владелец = ВТ_Цены.Фактура
	|			И ЦветаФактур.Ссылка = ВТ_Цены.ЦветФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальныеЦены КАК ВТ_ИндивидуальныеЦены
	|		ПО (&ИспользоватьИндивидуальныеЦены)
	|			И ЦветаФактур.Владелец = ВТ_ИндивидуальныеЦены.Фактура
	|			И ЦветаФактур.Ссылка = ВТ_ИндивидуальныеЦены.ЦветФактуры
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоФактуре
	|				ТОГДА ЦветаФактур.Владелец В ИЕРАРХИИ (&Фактура)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ГруппаФактуры КАК ГруппаФактуры,
	|	ВТ.Фактура КАК Фактура,
	|	ВТ.ЦветФактуры КАК ЦветФактуры,
	|	ВТ.ВидНоменклатурыПотолка КАК ВидНоменклатурыПотолка,
	|	ВТ.Цена КАК Цена,
	|	ВТ.ЦенаСФотопечатью КАК ЦенаСФотопечатью,
	|	ВТ.ВидЦены КАК ВидЦены
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НеПоказыватьНулевыеЦены
	|				ТОГДА ВТ.Цена <> 0
	|						ИЛИ ВТ.ЦенаСФотопечатью <> 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.ВидНоменклатурыПотолка,
	|	ВТ.Фактура,
	|	ВТ.ЦветФактуры
	|ИТОГИ ПО
	|	ВидНоменклатурыПотолка,
	|	ГруппаФактуры,
	|	Фактура,
	|	ЦветФактуры
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Период", 					СтруктураПараметров.ДатаОтчета);
	Запрос.УстановитьПараметр("ВидЦены",					СтруктураПараметров.СписокВидовЦен);
	Запрос.УстановитьПараметр("ОтборПоФактуре",				СтруктураПараметров.СписокДляОтбораФактур.Количество() > 0);
	Запрос.УстановитьПараметр("Фактура",					СтруктураПараметров.СписокДляОтбораФактур);
	Запрос.УстановитьПараметр("Валюта", 					СтруктураПараметров.Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры",			СтруктураПараметров.ВидНоменклатурыПотолки);
	Запрос.УстановитьПараметр("НеПоказыватьНулевыеЦены", 	НЕ СтруктураПараметров.ПоказыватьНулевыеЦены);
	
	Запрос.УстановитьПараметр("ИспользоватьИндивидуальныеЦены",	Отчет.ИндивидуальныеЦены);
	Запрос.УстановитьПараметр("Контрагент",					Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",			Отчет.ДоговорКонтрагента);
	
	ВыборкаВидов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидов.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ВидПотолка|Данные");
		ОбластьМакета.Параметры.Заполнить(ВыборкаВидов);
		Таб.Вывести(ОбластьМакета, 1);
		ОбластьМакета = Макет.ПолучитьОбласть("ВидПотолка|Цена");
		Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество()-1 Цикл
			Таб.Присоединить(ОбластьМакета, 1);
		КонецЦикла;
		ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 2 + 2*СписокВидовЦенМатериалов.Количество());
		ОбластьОбъединения.Объединить(); 
		
		// Группа фактуры
		ВыборкаГруппФактур = ВыборкаВидов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппФактур.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаГруппаФактуры|Данные");
			ОбластьМакета.Параметры.Заполнить(ВыборкаГруппФактур);
			Таб.Вывести(ОбластьМакета, 2);
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаГруппаФактуры|Цена");
			Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество()-1 Цикл
				Таб.Присоединить(ОбластьМакета, 2);
			КонецЦикла;
			ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 2 + 2*СписокВидовЦенМатериалов.Количество());
			ОбластьОбъединения.Объединить();
			
			// Фактура
			ВыборкаФактур = ВыборкаГруппФактур.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаФактур.Следующий() Цикл
				Фактура = ВыборкаФактур.Фактура;
				
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаФактура|Данные");
				ОбластьМакета.Параметры.Заполнить(ВыборкаФактур);
				Таб.Вывести(ОбластьМакета, 3);
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаФактура|Цена");
				Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество()-1 Цикл
					Таб.Присоединить(ОбластьМакета, 3);
				КонецЦикла;
				ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 2 + 2*СписокВидовЦенМатериалов.Количество());
				ОбластьОбъединения.Объединить();
				
				ВыборкаЦветов = ВыборкаФактур.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЦветов.Следующий() Цикл
					ЦветФактуры = ВыборкаЦветов.ЦветФактуры;
					
					ЦеныНоменклатуры = Новый Соответствие;
					ЦеныСФотоНоменклатуры = Новый Соответствие;
					ВыборкаЦены = ВыборкаЦветов.Выбрать();
					Пока ВыборкаЦены.Следующий() Цикл
						ЦеныНоменклатуры.Вставить(ВыборкаЦены.ВидЦены, ВыборкаЦены.Цена);
						ЦеныСФотоНоменклатуры.Вставить(ВыборкаЦены.ВидЦены, ВыборкаЦены.ЦенаСФотопечатью);
					КонецЦикла;
					
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
					ОбластьМакета.Параметры.ЦветФактуры = ЦветФактуры;
					Таб.Вывести(ОбластьМакета, 4);			
					Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество() - 1 Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Цена");
						ОбластьМакета.Параметры.Цена = ЦеныНоменклатуры.Получить(СписокВидовЦенМатериалов.Получить(НомерЦены).Значение);
						ОбластьМакета.Параметры.ЦенаСФотопечатью = ЦеныСФотоНоменклатуры.Получить(СписокВидовЦенМатериалов.Получить(НомерЦены).Значение);
						Таб.Присоединить(ОбластьМакета, 4);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
		
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальныеЦеныПриИзменении(Элемент)
	УправлениеВидимостьюПоИндивидуальнымЦенам();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Отчет.ДоговорКонтрагента = Отчет.Контрагент.ОсновнойДоговор;
КонецПроцедуры

&НаСервере
Процедура ПрисоединитьТабличныйДокумент(ОсновнойДокумент, Знач ПрисоединяемыйДокумент)
	
	ВремТабДок = Новый ТабличныйДокумент;
	ОбластьЯчеек = ВремТабДок.Вывести(ПрисоединяемыйДокумент);
	
	ОбластьЯчеек.СоздатьФорматСтрок();
	
	ОсновнойДокумент.Вывести(ВремТабДок);
	
КонецПроцедуры


Функция СкомпоноватьВТабличныйДокумент(ТабДок, СхемаКомпоновкиДанных, КомпоновщикНастроек, ВнешниеНаборыДанных) Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	Если ВнешниеНаборыДанных.Количество() > 0 Тогда
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
	Иначе
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	КонецЕсли;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВExcel(Команда)
	СохранитьПрайсВФайлExcelСЛистамиПоГруппам();	
КонецПроцедуры

&НаСервере
Функция ПолучитьСодержаниеЯчейки(пТабличныйДокумент, Строка, Колонка)	
	Если Колонка = 0 Тогда
		Возврат "";
	КонецЕсли;	
	мСодержание = пТабличныйДокумент.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;	
	Возврат СокрЛП(мСодержание);
КонецФункции

&НаСервере
Функция РазложитьНаГруппыТоваровНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	МакетОсновной = ТекОбъект.ПолучитьМакет("Макет");
	ОбластьГруппа=МакетОсновной.ПолучитьОбласть("Группа");
	
	СписокПрайсов=Новый СписокЗначений;
	ТабДок = ЭтотОбъект.Результат;
	Для строка=1 по ТабДок.ВысотаТаблицы цикл
		колонка1 = ПолучитьСодержаниеЯчейки(ТабДок, Строка, 1);
		Если Колонка1="Фото товара" тогда
			СтрокаОкончанияЗаголовка=СТрока;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ГруппаТоваров="";
	ЭтоПервыйТовар=Истина;
	НовыйТабДок=Новый ТабличныйДокумент;
	Для строка=СтрокаОкончанияЗаголовка+1 по ТабДок.ВысотаТаблицы цикл
		Колонка1=ПолучитьСодержаниеЯчейки(ТабДок, Строка, 1);
		Колонка2=ПолучитьСодержаниеЯчейки(ТабДок, Строка, 2);	  
		Если Колонка2="" Тогда
			Если ГруппаТоваров<>"" и НовыйТабДок.ВысотаТаблицы<>0 Тогда
				//НовыйТабДок.Показать();
				стр=Новый Структура("Наименование,Табдок",ГруппаТоваров,НовыйТабДок);
				// стр.наименование=ГруппаТоваров;
				//стр.табдок=НовыйТабДок;
				СписокПрайсов.Добавить(стр);
				НовыйТабДок=Новый ТабличныйДокумент;
				ЭтоПервыйТовар=Истина;
			КонецЕсли;
			ГруппаТоваров=Колонка1;
		Иначе
			Если ЭтоПервыйТовар тогда
				НовыйТабДок=Новый ТабличныйДокумент;
				НовыйТабДок.Вывести(ТабДок.ПолучитьОбласть(1,,СтрокаОкончанияЗаголовка,));
				ОбластьГруппа.Параметры.Номенклатура=ГруппаТоваров;
				НовыйТабДок.Вывести(ОбластьГруппа);
			КонецЕсли;
			НовыйТабДок.Вывести(ТабДок.ПолучитьОбласть(Строка,,Строка,));
			ЭтоПервыйТовар=Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат СписокПрайсов;
КонецФункции

&НаКлиенте
Процедура СохранитьПрайсВФайлExcelСЛистамиПоГруппам() Экспорт
	Если не ЗначениеЗаполнено(ИмяФайла) Тогда
		Сообщить("Не выбран файл. Действие не будет выполнено");
		Возврат;
	КонецЕсли;
	СписокПрайсов=Новый СписокЗначений;  
	
	массивПрайсов=СформироватьДляExcel();
	СписокПрайсов.ЗагрузитьЗначения(массивПрайсов);
	
	//ИмяФайла = КаталогВременныхФайлов() + "Прайс-лист от " + Формат(Отчет.Дата,"ДЛФ=Д") +".xlsx";
	ИмяВременногоФайлаШаблон = ПолучитьИмяВременногоФайла("XLSx");
	
	Эксель    = New COMObject("Excel.Application");
	
	Попытка
		ДвоичныеДанные = ПолучитьМакетНаСервере("ШаблонExcel");
		ДвоичныеДанные.Записать(ИмяВременногоФайлаШаблон);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Книга = Эксель.Workbooks.Open(ИмяВременногоФайлаШаблон);   
	Позиция=3;
	Первый = Ложь;
	
	//Для защиты от дублей имен
	СооИмена = Новый СписокЗначений();
	
	//Перебираем отчеты в MXL
	Для Каждого Элемент ИЗ СписокПрайсов Цикл
		ТабДок=Элемент.Значение.ТабДок;
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("XLSx");
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSx); //Сохраняем в временный файл
		
		ТекКнига = Эксель.Workbooks.Open(ИмяВременногоФайла);  
		
		Если Первый Тогда 
			Книга = ТекКнига; //Первый файл и есть результат, чтобы сохранялись цвета
		Иначе
			ТекКнига.Sheets(1).Copy(, Книга.Sheets(Позиция)); //Copy(Before, After)
		КонецЕсли; 
		
		
		//Защита от одинаковых ярлыков
		ТекБазаНаименование =Элемент.Значение.Наименование;
		ТекНаименование = ТекБазаНаименование; СчНаименований = 2;
		ТекНаименование=стрзаменить(ТекНаименование,"/","|");
		Пока СооИмена.НайтиПоЗначению(ТекНаименование) <> Неопределено Цикл
			ТекНаименование = ТекБазаНаименование + "(" + СчНаименований + ")";
			СчНаименований = СчНаименований + 1;
		КонецЦикла;
		СооИмена.Добавить(ТекНаименование);
		Книга.Sheets(Позиция).Name = лев(ТекНаименование,31); //Переименовываем
		//Гиперссылка
		Лист=Книга.Sheets(Позиция) ;
		Range=Эксель.Range(Эксель.Cells(1,1),Эксель.ActiveCell.SpecialCells(11));
		Col=Range.Columns.Count;
		row=Range.Rows.Count;
		строка=1;
		Пока Строка<=row Цикл
			Если стрНАйти(Лист.cells(Строка,3).Text,"http")<>0 Тогда
				//Лист.Hyperlinks.Add(Лист.Cells(Строка, 2), Лист.cells(Строка,2).Text, Лист.cells(Строка,2).Text);
				Лист.Hyperlinks.Add(Лист.Range(Лист.Cells(Строка, 1),Лист.Cells(Строка, 2)), Лист.cells(Строка,3).Text, Лист.cells(Строка,1).Text);
				Лист.cells(Строка,3).Value = "";
			КонецЕсли;
			строка=Строка+1;
		КонецЦикла;
		
		Лист.Hyperlinks.Add(Лист.Cells(1,4),"https://optceiling.ru/zastrojshhikam/","Индивидуальные цены на объекты");
		Лист.Hyperlinks.add(Лист.cells(1,2),"","Содержание!R1C1"); 
		
		
		
		Если Первый Тогда
			//Делаем доступными ярлыки листов
			Эксель.ActiveWindow.DisplayWorkbookTabs = 1; 
			Эксель.ActiveWindow.TabRatio = 0.6;  
			Первый = ложь;
		Иначе
			ТекКнига.Close();
		КонецЕсли;
		Позиция=Позиция+1;
		
		
	КонецЦикла;
	
	ЛистСодержание=Книга.Sheets(1);
	row=11;
	Для каждого НазваниеЛиста из СооИмена ЦИкл
		ЛистСодержание.cells(row,2).Value=НазваниеЛиста.Значение;
		ЛистСодержание.Hyperlinks.add(ЛистСодержание.cells(row,2),"","'"+лев(НазваниеЛиста.Значение,31)+"'!R1C1"); 
		row=row+1;	
	КонецЦикла;
	
	//Удаляем, чтобы не переспрашивал
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;
	
	Книга.SaveAs(ИмяФайла, 51); //xlWorkbookNormal -4143 Workbook normal 
	//ActiveWindow.TabRatio = 0
	Книга.Close();
	Попытка
		ЗапуститьПриложение(ИмяФайла);
	Исключение
	КОнецПопытки;
КонецПроцедуры

&НаСервере
Функция СформироватьДляExcel()
	СписокТаб=Новый Массив;
	
	
	СписокВидовЦен = Новый СписокЗначений;
	СтруктураПараметров = Новый Структура;	
	ИнициализацияПараметровОтчета(СписокВидовЦен, СтруктураПараметров);
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ТекОбъект.ПолучитьМакет("МакетExcel");
	ВывестиКомплектующиеExcel(СтруктураПараметров, Макет,СписокТаб);	
	тз=ПреобразоватьМассивВТаблицуЗначений(СписокТаб);
	тз.Сортировать("Позиция");
	СписокТаб=ОбщегоНазначения.ТаблицаЗначенийВМассив(тз);	
	Возврат СПисокТаб;
КонецФункции

&НаСервере
Процедура ВывестиКомплектующиеExcel(СтруктураПараметров, Макет, СписокТаб)
	ТабШаблон=Новый ТабличныйДокумент;
	ТабШаблон.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист";
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабШаблон.Вывести(ОбластьМакета);	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Основное");
	ТабШаблон.Вывести(ОбластьМакета);
	Для каждого ВидЦен из СтруктураПараметров.СписокВидовЦен Цикл
		ОбластьМакета=Макет.ПолучитьОбласть("ШапкаТаблицы|Цена");
		Если ВидЦен.Значение.Наименование = "БП1" Тогда
			ОбластьМакета.параметры.Видцены=Строка("дилер");
		ИначеЕсли ВидЦен.Значение.Наименование = "Розничный прайс" Тогда
			ОбластьМакета.параметры.Видцены=Строка("розница");
		Иначе	
			ОбластьМакета.параметры.Видцены=Строка(ВидЦен);
		КонецЕсли;	
		ТабШаблон.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Период", 				КонецДня(СтруктураПараметров.ДатаОтчета));
	Запрос.УстановитьПараметр("ВидЦены", 				СтруктураПараметров.СписокВидовЦен);
	Запрос.УстановитьПараметр("Номенклатура", 			СтруктураПараметров.СписокДляОтбораНоменклатуры);
	Запрос.УстановитьПараметр("Валюта", 				СтруктураПараметров.Валюта);
	Запрос.УстановитьПараметр("НеПоказыватьНулевыеЦены", НЕ СтруктураПараметров.ПоказыватьНулевыеЦены);
	
	Запрос.УстановитьПараметр("ИспользоватьИндивидуальныеЦены",	Отчет.ИндивидуальныеЦены);
	Запрос.УстановитьПараметр("Контрагент",				Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",		Отчет.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("СвойствоUrlТовара",		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Заголовок","Url"));

	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Отменена КАК Отменена
	|ПОМЕСТИТЬ ВТ_ИндивидуальныеЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И Валюта = &Валюта) КАК ЦеныНоменклатурыИндивидуальныеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Период,
	|				Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|					И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Цена, 0)
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныВрем
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Валюта = &Валюта) КАК ЦеныСрезПоследних
	|		ПО (ЦеныСрезПоследних.ВидЦены = ВидыЦен.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Валюта = &Валюта) КАК ЦеныСсылочныхСрезПоследних
	|		ПО (ЦеныСсылочныхСрезПоследних.ВидЦены = ВидыЦен.ВидЦеныНоменклатуры)
	|ГДЕ
	|	ВидыЦен.Ссылка В(&ВидЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЦеныВрем.Номенклатура КАК Номенклатура,
	|	ВТ_ЦеныВрем.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ЦеныВрем.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ЦеныВрем.ВидЦены КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ИндивидуальныеЦены.Цена ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_ИндивидуальныеЦены.Отменена
	|						ТОГДА ВТ_ИндивидуальныеЦены.Цена
	|					ИНАЧЕ ВТ_ЦеныВрем.Цена
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ЦеныВрем.Цена
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	ВТ_ЦеныВрем КАК ВТ_ЦеныВрем
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальныеЦены КАК ВТ_ИндивидуальныеЦены
	|		ПО (&ИспользоватьИндивидуальныеЦены)
	|			И ВТ_ЦеныВрем.Валюта = ВТ_ИндивидуальныеЦены.Валюта
	|			И ВТ_ЦеныВрем.ЕдиницаИзмерения = ВТ_ИндивидуальныеЦены.ЕдиницаИзмерения
	|			И ВТ_ЦеныВрем.Номенклатура = ВТ_ИндивидуальныеЦены.Номенклатура
	|			И ВТ_ЦеныВрем.ХарактеристикаНоменклатуры = ВТ_ИндивидуальныеЦены.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИндивидуальныеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЦеныВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(СправочникХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ВТ_Цены.ЕдиницаИзмерения, СправочникНоменклатура.БазоваяЕдиницаИзмерения) КАК ЕдИзм,
	|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена,
	|	ВТ_Цены.ВидЦены КАК ВидЦены,
	|	ЕСТЬNULL(НоменклатураПрисоединенныеФайлы.ФайлХранилище, НЕОПРЕДЕЛЕНО) КАК ФайлХранилище,
	|	СправочникНоменклатура.Код КАК КодНоменклатуры,
	|	UrlsТоваров.Значение КАК Url
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СправочникХарактеристикиНоменклатуры
	|		ПО (СправочникХарактеристикиНоменклатуры.Владелец = СправочникНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО СправочникНоменклатура.Ссылка = ВТ_Цены.Номенклатура
	|			И (ЕСТЬNULL(СправочникХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ВТ_Цены.ХарактеристикаНоменклатуры)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|		ПО (НоменклатураПрисоединенныеФайлы.ВладелецФайла = СправочникНоменклатура.Ссылка)
	|			И (НоменклатураПрисоединенныеФайлы.Ссылка = СправочникНоменклатура.ФайлКартинки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			UrlТовара.Ссылка КАК Ссылка,
	|			UrlТовара.Свойство КАК Свойство,
	|			UrlТовара.Значение КАК Значение
	|		ИЗ
	|			Справочник.Номенклатура.ДополнительныеРеквизиты КАК UrlТовара
	|		ГДЕ
	|			НЕ UrlТовара.Значение ЕСТЬ NULL
	|			И UrlТовара.Свойство = &СвойствоUrlТовара) КАК UrlsТоваров
	|		ПО СправочникНоменклатура.Ссылка = UrlsТоваров.Ссылка
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)
	|	И НЕ СправочникНоменклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА &НеПоказыватьНулевыеЦены
	|				ТОГДА ЕСТЬNULL(ВТ_Цены.Цена, 0) <> 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СправочникНоменклатура.ЭтоГруппа УБЫВ,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ВидЦены
	|ИТОГИ ПО
	|	Номенклатура ИЕРАРХИЯ,
	|	ХарактеристикаНоменклатуры
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СвойствоВыводитьГруппуВОтдельныйЛист=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ВыводитьВОтдельномЛисте");
	ВыводимаяГруппа=СПравочники.Номенклатура.ПустаяСсылка();	
	ТекущаяПозиция=0;
	Таб=Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист";
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		// вывод групп номенклатуры
		Если ВыборкаНоменклатуры.Номенклатура.ЭтоГруппа Тогда
			Свойство=РегистрыСведений.ДополнительныеСведения.Получить(Новый Структура("Объект,Свойство",ВыборкаНоменклатуры.Номенклатура,СвойствоВыводитьГруппуВОтдельныйЛист));
			Если ЗначениеЗаполнено(Свойство.Значение) и Свойство.Значение<>0 Тогда
				Если Таб.ВысотаТаблицы>0 Тогда
					стр=Новый Структура("Наименование,ТабДок,Позиция",ВыводимаяГруппа.Наименование,Таб,ТекущаяПозиция);
					СписокТаб.Добавить(стр);
				КОнецЕсли;
				ВыводимаяГруппа=ВыборкаНоменклатуры.Номенклатура;
				ТекущаяПозиция=Свойство.Значение;
				Таб=Новый ТабличныйДокумент;
				Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист";
				Таб.Вывести(ТабШаблон);
			ИначеЕсли  ЗначениеЗаполнено(ВыводимаяГруппа) и ВыборкаНоменклатуры.Номенклатура.ПринадлежитЭлементу(ВыводимаяГруппа) Тогда 	
				ОбластьМакета = Макет.ПолучитьОбласть("Группа|Основное");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаНоменклатуры);
				ОбластьМакета.параметры.Номенклатура=ВРег(строка(ВыборкаНоменклатуры.номенклатура));
				Таб.Вывести(ОбластьМакета);
				//nva+++
				Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество() - 1 Цикл
					ОбластьМакета = Макет.ПолучитьОбласть("Группа|Цена");
					Таб.Присоединить(ОбластьМакета);
				КонецЦикла;
				//nva---
			КонецЕсли;
			// вывод самой номенклатуры
		ИначеЕсли ЗначениеЗаполнено(ВыводимаяГруппа)  ТОгда
			//тзНоменклатура=ВыборкаНоменклатуры.Выгрузить();
			//тзХарактеристики=тзНоменклатура.скопировать();
			//тзХарактеристики.свернуть("ХарактеристикаНоменклатуры");
			//ОбластьМакета = Макет.ПолучитьОбласть("Строка|Основное");
			//Если тзНоменклатура.количество()>0 Тогда
			//	Номенклатура=тзНоменклатура[0];
			//Иначе Номенклатура=ВыборкаНоменклатуры.Номенклатура;
			//КОнецЕсли;
			//
			//
			//Для каждого Характеристика из тзХарактеристики цикл
			//	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Номенклатура);
			//	ОбластьМакета.Параметры.Номенклатура=Строка(Номенклатура)+?(ЗначениеЗаполнено(Характеристика.ХарактеристикаНоменклатуры)," ("+Строка(Характеристика.ХарактеристикаНоменклатуры)+")","");				
			//	СвойствоСсылкаНаИзображение=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаНаИзображение");					
			//	СсылкаНаИзображение=РегистрыСведений.ДополнительныеСведения.Получить(Новый Структура("Объект,Свойство",ВыборкаНоменклатуры.Номенклатура,СвойствоСсылкаНаИзображение));
			//	Если ЗначениеЗаполнено(СсылкаНаИзображение.Значение) Тогда
			//		ОбластьМакета.Параметры.СсылкаНаИзображение=СсылкаНаИзображение.Значение;
			//	КонецЕсли;
			//	Таб.Вывести(ОбластьМакета);
			//	
			//	Для каждого ВидЦен из СтруктураПараметров.СписокВидовЦен Цикл
			//		ОбластьМакета=Макет.ПолучитьОбласть("Строка|Цена");
			//		
			//		НайденнаяСтроки = тзНоменклатура.НайтиСтроки(Новый Структура("ВидЦены,ХарактеристикаНоменклатуры",ВидЦен, Характеристика.ХарактеристикаНоменклатуры));
			//		ЦенаТовара=0;
			//		Если НайденнаяСтроки.Количество() > 0 Тогда
			//			ЦенаТовара = НайденнаяСтроки[0].Цена;
			//		КонецЕсли;
			//		ОбластьМакета.параметры.Цена=Строка(ЦенаТовара);
			//		Таб.Присоединить(ОбластьМакета);
			//	КонецЦикла;
			//КонецЦикла;
			
			ВыборкаХарактеристика = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаХарактеристика.Следующий() и ВыборкаХарактеристика.Номенклатура.ПРинадлежитЭлементу(ВыводимаяГруппа) Цикл	
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Основное");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаХарактеристика);
				ОбластьМакета.Параметры.Номенклатура=Строка(ВыборкаХарактеристика.Номенклатура)+?(ЗначениеЗаполнено(ВыборкаХарактеристика.ХарактеристикаНоменклатуры)," ("+Строка(ВыборкаХарактеристика.ХарактеристикаНоменклатуры)+")","");				
				
				//СвойствоСсылкаНаИзображение=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СсылкаНаИзображение");					
				//СсылкаНаИзображение=РегистрыСведений.ДополнительныеСведения.Получить(Новый Структура("Объект,Свойство",ВыборкаХарактеристика.Номенклатура,СвойствоСсылкаНаИзображение));	
				//
				//Если ЗначениеЗаполнено(СсылкаНаИзображение.Значение) Тогда
				//	ОбластьМакета.Параметры.СсылкаНаИзображение=СсылкаНаИзображение.Значение;
				//КонецЕсли;
						Цены = Новый Соответствие;
						ВыборкаЦен = ВыборкаХарактеристика.Выбрать();
						Пока ВыборкаЦен.Следующий() Цикл
							СсылкаНаИзображение = ВыборкаЦен.Url;
							Если ЗначениеЗаполнено(СсылкаНаИзображение) Тогда
								ОбластьМакета.Параметры.СсылкаНаИзображение=СсылкаНаИзображение;
							КонецЕсли;
							Цены.Вставить(ВыборкаЦен.ВидЦены, ВыборкаЦен.Цена);
							ОбластьМакета.параметры.едизм=ВыборкаЦен.едИзм;
						КонецЦикла;
						
						Таб.Вывести(ОбластьМакета);
						Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество() - 1 Цикл
							ОбластьМакета = Макет.ПолучитьОбласть("Строка|Цена");
							ОбластьМакета.Параметры.Цена = Цены.Получить(СтруктураПараметров.СписокВидовЦен.Получить(НомерЦены).Значение);
							Таб.Присоединить(ОбластьМакета);
						КонецЦикла;

				
			КонецЦикла
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	Если Таб.ВысотаТаблицы>0 Тогда
		стр=Новый Структура("Наименование,ТабДок,Позиция",ВыводимаяГруппа.Наименование,Таб,текущаяПозиция);
		СписокТаб.Добавить(стр);
	КОнецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчетыВФайлExcelСЛистами(СписокОтчетов, ИмяФайла) Экспорт
	Эксель    = New COMObject("Excel.Application");
	//Эксель.visible = true;
	//Книга = Эксель.Workbooks.Add();    
	
	//Для НомерЛиста = 1 To Книга.Sheets.Count - 1 Цикл
	//	Книга.Sheets(1).Delete();
	//КонецЦикла;
	
	Первый = истина;
	
	//Для защиты от дублей имен
	СооИмена = Новый СписокЗначений();
	
	//Перебираем отчеты в MXL
	Для Каждого Элемент ИЗ СписокОтчетов Цикл
		ТабДок = Элемент.Значение;
		//ТабДок.Показать();
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("XLS");
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLS); //Сохраняем в временный файл
		
		ТекКнига = Эксель.Workbooks.Open(ИмяВременногоФайла);            
		Если Первый Тогда 
			Книга = ТекКнига; //Первый файл и есть результат, чтобы сохранялись цвета
		Иначе
			ТекКнига.Sheets(1).Copy(, Книга.Sheets(Книга.Sheets.Count)); //Copy(Before, After)
		КонецЕсли; 
		
		
		//Защита от одинаковых ярлыков
		ТекБазаНаименование = Элемент.Представление;
		ТекНаименование = ТекБазаНаименование; СчНаименований = 2;
		Пока СооИмена.НайтиПоЗначению(ТекНаименование) <> Неопределено Цикл
			ТекНаименование = ТекБазаНаименование + "(" + СчНаименований + ")";
			СчНаименований = СчНаименований + 1;
		КонецЦикла;
		СооИмена.Добавить(ТекНаименование);
		Книга.Sheets(Книга.Sheets.Count).Name = ТекНаименование; //Переименовываем
		
		Если Первый Тогда
			//Делаем доступными ярлыки листов
			Эксель.ActiveWindow.DisplayWorkbookTabs = 1; 
			Эксель.ActiveWindow.TabRatio = 0.6;  
			Первый = ложь;
		Иначе
			ТекКнига.Close();
		КонецЕсли;
		
	КонецЦикла;
	
	//Удаляем, чтобы не переспрашивал
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;
	
	Книга.SaveAs(ИмяФайла, -4143); //xlWorkbookNormal -4143 Workbook normal 
	//ActiveWindow.TabRatio = 0
	Книга.Close();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(имяМакета)
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ОтчетОбъект.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьМассивВТаблицуЗначений(МассивДанные) 
	
	тзДанные = Новый ТаблицаЗначений;
	
	Для Каждого ЭлементМассива Из МассивДанные Цикл
		// Рисуем колонки для таблицы
		
		Если тзДанные.Колонки.Количество() = 0 Тогда
			Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
				тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
			КонецЦикла;
		КонецЕсли;
		
		// Добавляем данные в таблицу
		
		НоваяСтрока = тзДанные.Добавить();
		Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
			НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЦикла;
	КонецЦикла;
	
	Возврат тзДанные;
	
КонецФункции 

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	СтандартнаяОбработка = Ложь;// Отказываемся от стандартной обработки процедуры
	
	// Создаем диалог выбора файла и указываем для чего он будет использоваться
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); // или ВыборКаталога или Сохранение
	Диалог.Фильтр = "Документ Excel (*.xlsx)|*.xlsx"; // Строка с файловыми фильтрами
	Диалог.Заголовок = "Выберите документ PDF"; // Текст заголовка окна выбора
	
	// Создаем объект ОписаниеОповещения, который будет передан в метод Показать
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПриВыбореФайла", ЭтотОбъект);
	// Также можно задать и третий параметр - Диалог. Тогда в процедуре ПриВыбореФайла из параметра ДополнительныеПараметры
	// можно получить каталог (в котором хранится выбранный файл), и фильтр (которому соответствует файл)
	// Пример: ОповещениеЗавершения = Новый ОписаниеОповещения("ПриВыбореФайла", ЭтотОбъект, Диалог);
	
	Диалог.Показать(ОповещениеЗавершения); // Открываем окно выбора файла
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореФайла(ВыбФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбФайлы <> Неопределено Тогда
		ИмяФайла = ВыбФайлы[0];
	КонецЕсли;
	
КонецПроцедуры
