
&После("ПередЗаписью")
Процедура НВД_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//nva+++
	Если НЕ Отказ Тогда
		Попытка
			ОтправитьСообщениеВОбсуждения(Ссылка);	
		Исключение
			Информация = ИнформацияОбОшибке();
		
		    КраткоеПредставление = КраткоеПредставлениеОшибки(Информация);
		
			ПодробноеПредставление = ПодробноеПредставлениеОшибки(Информация);
					
		    СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия");
		
			СтруктураСобытий.ИмяСобытия 		 = "Ошибка системы взаимодействия";
		
			СтруктураСобытий.ПредставлениеУровня = "Ошибка";	//"Информация", "Ошибка", "Предупреждение", "Примечание".
			СтруктураСобытий.Комментарий 		 = ПодробноеПредставление;
			СтруктураСобытий.ДатаСобытия 		 = ТекущаяДата();
		
			СобытияДляЖурналаРегистрации = Новый СписокЗначений();
			СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
		
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
		КонецПопытки;
	КонецЕсли;
	//nva---
	
КонецПроцедуры 

Функция ОтправитьСообщениеВОбсуждения(Ссылка) 
	
	Отбор = Новый ОтборОбсужденийСистемыВзаимодействия;
	Отбор.Ключ = "ПоступленияТоваров";
	Обсуждения = СистемаВзаимодействия.ПолучитьОбсуждения(Отбор);
	
	Если Обсуждения.Количество() > 0 Тогда
		Обсуждение = Обсуждения[0];
	Иначе
		Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение(); 
		Обсуждение.Отображаемое = Истина;
		Обсуждение.Заголовок = "Поступления товаров";
		Обсуждение.Ключ = "ПоступленияТоваров";
		Обсуждение.Участники.Добавить(СистемаВзаимодействия.СтандартныеПользователи.ВсеПользователиПриложения);
		Обсуждение.Записать();             
	КонецЕсли;	                     
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ИдПользователяСВ = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(Ссылка.Автор.ИдентификаторПользователяИБ);
	Исключение
		УИНПользователя = Ссылка.Автор.ИдентификаторПользователяИБ;

		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИНПользователя);

		ПользовательСВ = СистемаВзаимодействия.СоздатьПользователя(ПользовательИБ);
		ПользовательСВ.Записать();
		ИдПользователяСВ = ПользовательСВ.Идентификатор;
	КонецПопытки;	
	
	//ТекстСообщения = "Пользователь " + Ссылка.Автор + " создал " + Ссылка + " на Контрагента " +  Ссылка.Контрагент + ";
	ТекстСообщения = "";
	А = 1;
	Для Каждого Товар Из Ссылка.Товары Цикл
		ТекстСообщения = ТекстСообщения + Строка(А) + ". " + Товар.Номенклатура.Наименование + " " + Товар.Количество + " " + Товар.ЕдиницаИзмерения + "
		|";
		А = А + 1;
	КонецЦикла;	
	ТекстСообщения = ТекстСообщения + "
	|Ссылка: 
	|" + ПолучитьНавигационнуюСсылку(Ссылка);
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор); 
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Автор = ИдПользователяСВ;
	//Сообщение.Получатели.Добавить(ИдПользователяСВ);
	
	Сообщение.Записать(); 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции
